[
    {
        "title": "Trinity",
        "author": "Anna Lewis",
        "description": "Scifi Alien Romance Eliana Russet lives an ordinary life with an ordinary job and an ordinary best friend. But her whole world is twisted upside down when she finds out that she’s pregnant…which is virtually impossible considering she’s been celibate for the last six months. Zander Olgarian, an impossibly attractive man, reveals himself as the father of her child and Eliana’s world comes crashing down. Not only is Zander her child’s father, but he is also an alien prince, sent down to Earth to create his heir. Eliana has to fight through secret government groups trying to hunt her, loud-mouthed best friends, and hot-headed women on her quest to protect her child and figure out exactly what she’s gotten herself into. With every new turn, she doesn’t know who to trust. She’s becoming lost in a world unknown to her and she’s struggling to keep a hold on her sanity. But she’s a fighter, and she’ll be damned if she lets anyone hurt her baby. Standalone Romance Short Story With No Cliffhanger! ---- SEARCH TERMS: Pregnancy romance, secret baby romance, baby romance, pregnancy romance, alpha male alien romance, alpha male romance, scifi alien romance, alien abduction romance, alpha male aliens, alien fantasy books, alien romance, aliens, scifi romance, Space opera romance, science fiction romance, steamy science fiction romance, hot aliens, fantasy alien romance, paranormal romance, military science fiction books, paranormal with sex, fantasy fiction, psychic romance, steamy paranormal romance, sci fi romance, sci-fi romance, Fated mates, alien mate, new adult, genetic engineering, alien contact, alpha male, alpha female, supernatural, alien invasion romance",
        "category": "Romance",
        "format": "Ebook",
        "length": "Short Read",
        "published_date": 2022,
        "thumbnail": "http://books.google.com/books/content?id=D0baDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Pregnant to an Alien King",
        "author": "Gloria Martin",
        "description": "A Standalone Short Story with No Cliffhanger! Jesper, newly crowned king of planet Abalon, was celebrating. He’d finally ascended the throne and the entire capital city was celebrating with him. Rockwell, Jasper’s close friend and High General suggested that they should have one last wild night and do something they wouldn’t normally. Something out of their world…of course this leads two tipsy Abalonians to Earth. When Jesper sees Clarice and has to have her. They spend one fateful night together and Jesper returns to Abalon the next day with nothing but a sweet memory. Or so he thinks. Several months later, when it’s discovered that an Abalonian child was born to a human, everything changes for King Jesper, as well as Clarice who finds herself whisked away to an entirely different planet. --- TAGS: Pregnancy romance, baby romance, pregnancy romance, alpha male alien romance, alpha male romance, scifi alien romance, alien abduction romance, alpha male aliens, alien fantasy books, alien romance, aliens, scifi romance, Space opera romance, science fiction romance, steamy science fiction romance, hot aliens, fantasy alien romance, paranormal romance, military science fiction books, paranormal with sex, fantasy fiction, psychic romance, steamy paranormal romance, sci fi romance, sci-fi romance, Fated mates, alien mate, new adult, genetic engineering, alien contact, alpha male, alpha female, supernatural, alien invasion romance",
        "category": "Romance",
        "format": "Ebook",
        "length": "Short Read",
        "published_date": 2010,
        "thumbnail": "http://books.google.com/books/content?id=oELaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Mirror of Her Dreams",
        "author": "Stephen R. Donaldson",
        "description": "With The Chronicles of Thomas Covenant, Stephen R. Donaldson changed the face of fantasy fiction forever. In The Mirror of Her Dreams, the astonishing first novel in the two-volume Mordant’s Need series, Donaldson shows us a world of wondrous beauty and seductive illusion, where mirrors hold the deadliest of magics and nothing is what it seems. . . . The daughter of rich but neglectful parents, Terisa Morgan lives alone in a New York City apartment, a young woman who has grown to doubt her own existence. Surrounded by the flat reassurance of mirrors, she leads an unfulfilled life—until the night a strange man named Geraden comes crashing through one of her mirrors, on a quest to find a champion to save his kingdom of Mordant from a pervasive evil that threatens the land. Terisa is no champion. She wields neither magic nor power. And yet, much to her own surprise, when Geraden begs her to come back with him, she agrees. Now, in a culture where women are little more than the playthings of powerful men, in a castle honeycombed with secret passages and clever traps, in a kingdom threatened from without and within by enemies able to appear and vanish out of thin air, Terisa must become more than the pale reflection of a person. For the way back to Earth is closed to her. And the enemies of Mordant will stop at nothing to see her dead.",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Short Read",
        "published_date": 1974,
        "thumbnail": "http://books.google.com/books/content?id=zUVwAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "A Man Rides Through",
        "author": "Stephen R. Donaldson",
        "description": "In The Mirror of Her Dreams, the dazzling first volume of Mordant’s Need, New York Times bestselling author Stephen R. Donaldson introduced us to the richly imagined world of Mordant, where mirrors are magical portals into places of beauty and terror. Now, with A Man Rides Through, Donaldson brings the story of Terisa Morgan to an unforgettable conclusion. . . . Aided by the powerful magic of Vagel, the evil Arch-Imager, the merciless armies are marching against the kingdom of Mordant. In its hour of greatest need, two unlikely champions emerge. One is Geraden, whose inability to master the simplest skills of Imagery has made him a laughingstock. The other is Terisa Morgan, transferred to Mordant from a Manhattan apartment by Geraden’s faulty magic. Together, Geraden and Terisa discover undreamed-of talents within themselves—talents that make them more than a match for any Imager . . . including Vagel himself. Unfortunately, those talents also mark them for death. Branded as traitors, they are forced to flee the castle for their lives. Now, all but defenseless in a war-torn countryside ravaged by the vilest horrors Imagery can spawn, Geraden and Terisa must put aside past failures and find the courage to embrace their powers—and their love—before Vagel can spring his final trap.",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Short Read",
        "published_date": 2021,
        "thumbnail": "http://books.google.com/books/content?id=KaNRAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Oxford Book of Science Fiction Stories",
        "author": "Tom Shippey",
        "description": "A collection of classic science fiction short stories features tales by H. G. Wells, Arthur C. Clark, Frederik Pohl, Clifford Simak, Brian Aldiss, Ursala K. LeGuin, and many others. Edited by the author of The Road to Middle-Earth. 20,000 first printing.",
        "category": "Romance",
        "format": "Paperback",
        "length": "Short Read",
        "published_date": 2013,
        "thumbnail": "http://books.google.com/books/content?id=hVqYPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "The Cold Between",
        "author": "Elizabeth Bonesteel",
        "description": "From debut author Elizabeth Bonesteel, The Cold Between is the start to a stellar military science fiction series that combines hints of mystery and romance with action and adventure in the tradition of Elizabeth Moon, Linnea Sinclair, and Lois McMaster Bujold. When her crewmate, Danny, is murdered on the colony of Volhynia, Central Corps chief engineer, Commander Elena Shaw, is shocked to learn the main suspect is her lover, Treiko Zajec. She knows Trey is innocent—he was with her when Danny was killed. So who is the real killer and why are the cops framing an innocent man? Retracing Danny’s last hours, they discover that his death may be tied to a mystery from the past: the explosion of a Central Corps starship at a wormhole near Volhynia. For twenty-five years, the Central Gov has been lying about the tragedy, even willing to go to war with the outlaw PSI to protect their secrets. With the authorities closing in, Elena and Trey head to the wormhole, certain they’ll find answers on the other side. But the truth that awaits them is far more terrifying than they ever imagined . . . a conspiracy deep within Central Gov that threatens all of human civilization throughout the inhabited reaches of the galaxy—and beyond.",
        "category": "Romance",
        "format": "Paperback",
        "length": "Short Read",
        "published_date": 2007,
        "thumbnail": "http://books.google.com/books/content?id=ynblCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Alien Mate",
        "author": "Cara Bristol",
        "description": "Falsely convicted of a crime, I'm sentenced to life as a mail-order bride to an alien. I'm Starr Elizabeth Conner. Earth's government falsely convicted me of a crime, packed me on a ship with other female felons, and sent us to Dakon, a primitive, frozen wasteland of a planet. But I'm no barbarian’s 'mail order bride,' even if he is super tall, muscular, and the chief of his tribe. He doesn’t want a BBW blonde, either--it's written all over his chiseled face. He'll be truly angry if he ever learns what my 'crime' was. I am Torg. I have waited 34 rotations for a mate of my own. With this shipment, I was sure to get a fine, sturdy mate who'll bear me many daughters. Instead, I receive a small, curvy, pale-haired female who looks at me with anger and fear. It is only when we 'kiss' that I believe things may work out between us. But I'm hearing rumors that Starr and her shipmates are law-breakers. To survive, Dakonians must obey all laws … or be exiled into the frozen wasteland. Just when I have found her, will I have to banish my mate?",
        "category": "Romance",
        "format": "Ebook",
        "length": "Standard Length",
        "published_date": 2003,
        "thumbnail": "http://books.google.com/books/content?id=8FkqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Trinity",
        "author": "Anna Lewis",
        "description": "Scifi Alien Romance Eliana Russet lives an ordinary life with an ordinary job and an ordinary best friend. But her whole world is twisted upside down when she finds out that she’s pregnant…which is virtually impossible considering she’s been celibate for the last six months. Zander Olgarian, an impossibly attractive man, reveals himself as the father of her child and Eliana’s world comes crashing down. Not only is Zander her child’s father, but he is also an alien prince, sent down to Earth to create his heir. Eliana has to fight through secret government groups trying to hunt her, loud-mouthed best friends, and hot-headed women on her quest to protect her child and figure out exactly what she’s gotten herself into. With every new turn, she doesn’t know who to trust. She’s becoming lost in a world unknown to her and she’s struggling to keep a hold on her sanity. But she’s a fighter, and she’ll be damned if she lets anyone hurt her baby. Standalone Romance Short Story With No Cliffhanger! ---- SEARCH TERMS: Pregnancy romance, secret baby romance, baby romance, pregnancy romance, alpha male alien romance, alpha male romance, scifi alien romance, alien abduction romance, alpha male aliens, alien fantasy books, alien romance, aliens, scifi romance, Space opera romance, science fiction romance, steamy science fiction romance, hot aliens, fantasy alien romance, paranormal romance, military science fiction books, paranormal with sex, fantasy fiction, psychic romance, steamy paranormal romance, sci fi romance, sci-fi romance, Fated mates, alien mate, new adult, genetic engineering, alien contact, alpha male, alpha female, supernatural, alien invasion romance",
        "category": "Romance",
        "format": "Ebook",
        "length": "Standard Length",
        "published_date": 2013,
        "thumbnail": "http://books.google.com/books/content?id=D0baDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Deathstalker",
        "author": "Simon R. Green",
        "description": "Owen Deathstalker, last of the infamous warrior Clan, always considered himself more of a writer than a fighter, preferring his history books to making any actual history with a sword. But books won’t protect him from Her Imperial Majesty Lionstone XIV, who just Outlawed and condemned Owen to death, without any explanation, reason, or warning. No wonder she’s called the Iron Bitch. Now, on the run from Imperial starcruisers, shady mercenaries, and just about everyone else in the Empire, Owen’s options are limited. Though the name Deathstalker still commands respect in certain quarters, out on the Rim, Owen is lucky he can cobble together a makeshift team of castoffs, including an ex-pirate, a cyborg, and a bounty hunter. But allies won’t be enough to save him. If he’s to live, Owen can either run forever...or take down the corrupt Empire. To do that, he’ll need the fabled Darkvoid Device—an artifact dating back to the first Deathstalker and perhaps the only weapon powerful enough to help this ragtag rebellion win. The time has come for Owen to finally embrace his Deathstalker heritage...and all the blood and death that go along with it. Deathstalker is the first book in New York Times bestselling author Simon R. Green’s beloved space opera series.",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_date": 2000,
        "thumbnail": "http://books.google.com/books/content?id=9xoqDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Auxem",
        "author": "Lisa Lace",
        "description": "Their union could save a species. First, they'll have to save themselves. The Auxem are desperate. A virus has killed all their women and is beginning to affect the males' fertility. Their only chance for survival is mating with human women. Jayne Lynch is in charge of supervising the small group of volunteers who will be test subjects for a breeding program with the aliens. She's supposed to be impartial, but then she meets Arnon, the dark-haired, dark-eyed, muscular crown prince. The chemistry between them is too strong to ignore. Arnon is equally drawn to the curvy, blonde-haired Earthling. His father, the king, doesn't approve, but Arnon thinks Jayne is perfect - until he learns that she hasn't been entirely honest with him. The catch is that Arnon is hiding a painful secret of his own. Can he and his mate learn to trust each other in time to save their marriage and the breeding program? Or is their happy ending doomed...along with everyone on Auxem? Auxem is Book 13 in the TerraMates series and a STAND-ALONE, full-length science fiction romance. There are no cliffhangers, and a happy ending is guaranteed!",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_date": 2002,
        "thumbnail": "http://books.google.com/books/content?id=Qx77MAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    }
]