[
    {
        "title": "Varro's Human Bride",
        "author": "Sue Lyndon",
        "description": "On his planet, husbands own their wives. Julie is desperate to travel to Tarrkua and join her sister--the only family she has left in this universe. But to reach the distant alien planet, she must assume the identity of another Earth woman who's supposed to marry a Tarrkuan. Can she pull off the switch without her new alien husband learning of her deceit? After years spent in the asteroid mines, Varro returns to his home planet only to discover his betrothed has married another. Angry and hurt, he vows to never trust another female again, though he knows he must fulfill his duties to his people and procreate as soon as possible. Now he must take the human bride who's offered to him--a stranger from Earth, no less. But warmth fills him the moment he first glimpses his little bride, and her sweet demeanor soon wins him over. Perhaps an arranged marriage to a human is what the Gods had intended for him all along. Once Julie and Varro are married, he takes her home and claims her thoroughly, leaving no doubt in her mind that she now belongs to him. He also informs her that he's more than her husband--he's also her master--and she's expected to obey his every command. When she's naughty, he doesn't hesitate to apply a sturdy leather strap to her bottom. But he also possesses a gentler side and she can't help falling for the strict but loving alien. She also can't help but shudder in ecstasy as he claims her roughly, time and time again, leaving her breathless and trembling for his masterful touch. But all lies eventually unravel. What will Varro do when he learns of her deceit?",
        "category": "Romance",
        "format": "Ebook",
        "length": "Short Read",
        "published_date": 1981,
        "thumbnail": "http://books.google.com/books/content?id=vGcQEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Trinity",
        "author": "Anna Lewis",
        "description": "Scifi Alien Romance Eliana Russet lives an ordinary life with an ordinary job and an ordinary best friend. But her whole world is twisted upside down when she finds out that she’s pregnant…which is virtually impossible considering she’s been celibate for the last six months. Zander Olgarian, an impossibly attractive man, reveals himself as the father of her child and Eliana’s world comes crashing down. Not only is Zander her child’s father, but he is also an alien prince, sent down to Earth to create his heir. Eliana has to fight through secret government groups trying to hunt her, loud-mouthed best friends, and hot-headed women on her quest to protect her child and figure out exactly what she’s gotten herself into. With every new turn, she doesn’t know who to trust. She’s becoming lost in a world unknown to her and she’s struggling to keep a hold on her sanity. But she’s a fighter, and she’ll be damned if she lets anyone hurt her baby. Standalone Romance Short Story With No Cliffhanger! ---- SEARCH TERMS: Pregnancy romance, secret baby romance, baby romance, pregnancy romance, alpha male alien romance, alpha male romance, scifi alien romance, alien abduction romance, alpha male aliens, alien fantasy books, alien romance, aliens, scifi romance, Space opera romance, science fiction romance, steamy science fiction romance, hot aliens, fantasy alien romance, paranormal romance, military science fiction books, paranormal with sex, fantasy fiction, psychic romance, steamy paranormal romance, sci fi romance, sci-fi romance, Fated mates, alien mate, new adult, genetic engineering, alien contact, alpha male, alpha female, supernatural, alien invasion romance",
        "category": "Romance",
        "format": "Ebook",
        "length": "Short Read",
        "published_date": 2002,
        "thumbnail": "http://books.google.com/books/content?id=D0baDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Mirror of Her Dreams",
        "author": "Stephen R. Donaldson",
        "description": "With The Chronicles of Thomas Covenant, Stephen R. Donaldson changed the face of fantasy fiction forever. In The Mirror of Her Dreams, the astonishing first novel in the two-volume Mordant’s Need series, Donaldson shows us a world of wondrous beauty and seductive illusion, where mirrors hold the deadliest of magics and nothing is what it seems. . . . The daughter of rich but neglectful parents, Terisa Morgan lives alone in a New York City apartment, a young woman who has grown to doubt her own existence. Surrounded by the flat reassurance of mirrors, she leads an unfulfilled life—until the night a strange man named Geraden comes crashing through one of her mirrors, on a quest to find a champion to save his kingdom of Mordant from a pervasive evil that threatens the land. Terisa is no champion. She wields neither magic nor power. And yet, much to her own surprise, when Geraden begs her to come back with him, she agrees. Now, in a culture where women are little more than the playthings of powerful men, in a castle honeycombed with secret passages and clever traps, in a kingdom threatened from without and within by enemies able to appear and vanish out of thin air, Terisa must become more than the pale reflection of a person. For the way back to Earth is closed to her. And the enemies of Mordant will stop at nothing to see her dead.",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Short Read",
        "published_date": 2023,
        "thumbnail": "http://books.google.com/books/content?id=zUVwAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "A Man Rides Through",
        "author": "Stephen R. Donaldson",
        "description": "In The Mirror of Her Dreams, the dazzling first volume of Mordant’s Need, New York Times bestselling author Stephen R. Donaldson introduced us to the richly imagined world of Mordant, where mirrors are magical portals into places of beauty and terror. Now, with A Man Rides Through, Donaldson brings the story of Terisa Morgan to an unforgettable conclusion. . . . Aided by the powerful magic of Vagel, the evil Arch-Imager, the merciless armies are marching against the kingdom of Mordant. In its hour of greatest need, two unlikely champions emerge. One is Geraden, whose inability to master the simplest skills of Imagery has made him a laughingstock. The other is Terisa Morgan, transferred to Mordant from a Manhattan apartment by Geraden’s faulty magic. Together, Geraden and Terisa discover undreamed-of talents within themselves—talents that make them more than a match for any Imager . . . including Vagel himself. Unfortunately, those talents also mark them for death. Branded as traitors, they are forced to flee the castle for their lives. Now, all but defenseless in a war-torn countryside ravaged by the vilest horrors Imagery can spawn, Geraden and Terisa must put aside past failures and find the courage to embrace their powers—and their love—before Vagel can spring his final trap.",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Short Read",
        "published_date": 2015,
        "thumbnail": "http://books.google.com/books/content?id=KaNRAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Cold Between",
        "author": "Elizabeth Bonesteel",
        "description": "From debut author Elizabeth Bonesteel, The Cold Between is the start to a stellar military science fiction series that combines hints of mystery and romance with action and adventure in the tradition of Elizabeth Moon, Linnea Sinclair, and Lois McMaster Bujold. When her crewmate, Danny, is murdered on the colony of Volhynia, Central Corps chief engineer, Commander Elena Shaw, is shocked to learn the main suspect is her lover, Treiko Zajec. She knows Trey is innocent—he was with her when Danny was killed. So who is the real killer and why are the cops framing an innocent man? Retracing Danny’s last hours, they discover that his death may be tied to a mystery from the past: the explosion of a Central Corps starship at a wormhole near Volhynia. For twenty-five years, the Central Gov has been lying about the tragedy, even willing to go to war with the outlaw PSI to protect their secrets. With the authorities closing in, Elena and Trey head to the wormhole, certain they’ll find answers on the other side. But the truth that awaits them is far more terrifying than they ever imagined . . . a conspiracy deep within Central Gov that threatens all of human civilization throughout the inhabited reaches of the galaxy—and beyond.",
        "category": "Romance",
        "format": "Paperback",
        "length": "Short Read",
        "published_date": 2016,
        "thumbnail": "http://books.google.com/books/content?id=ynblCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Chaos Reigning",
        "author": "Jessie Mihalik",
        "description": "Interplanetary intrigue and romance combine in this electrifying finale to the Consortium Rebellion series. As the youngest member of her High House, Catarina von Hasenberg is used to being underestimated, but her youth and flighty, bubbly personality mask a clever mind and stubborn determination. Her enemies, blind to her true strength, do not suspect that Cat is a spy—which makes her the perfect candidate to go undercover at a rival House’s summer retreat to gather intelligence on their recent treachery. Cat’s overprotective older sister reluctantly agrees, but on one condition: Cat cannot go alone. Alexander Sterling, a quiet, gorgeous bodyguard, will accompany her, posing as her lover. After Cat tries, and fails, to ditch Alex, she grudgingly agrees, confident in her ability to manage him. After all, she’s never found a person she can’t manipulate. But Alex proves more difficult—and more desirable—than Cat anticipated. When she’s attacked and nearly killed, she and Alex are forced to work together to figure out how deep the treason goes. With rumors of widespread assaults on Serenity raging, communications down, and the rest of her family trapped off-planet, Catarina must persuade Alex to return to Earth to expose the truth and finish this deadly battle once and for all. But Cat can’t explain why she’s the perfect person to infiltrate hostile territory without revealing secrets she’d rather keep buried. . . .",
        "category": "Romance",
        "format": "Paperback",
        "length": "Short Read",
        "published_date": 2014,
        "thumbnail": "http://books.google.com/books/content?id=77eoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Alien Mate",
        "author": "Cara Bristol",
        "description": "Falsely convicted of a crime, I'm sentenced to life as a mail-order bride to an alien. I'm Starr Elizabeth Conner. Earth's government falsely convicted me of a crime, packed me on a ship with other female felons, and sent us to Dakon, a primitive, frozen wasteland of a planet. But I'm no barbarian’s 'mail order bride,' even if he is super tall, muscular, and the chief of his tribe. He doesn’t want a BBW blonde, either--it's written all over his chiseled face. He'll be truly angry if he ever learns what my 'crime' was. I am Torg. I have waited 34 rotations for a mate of my own. With this shipment, I was sure to get a fine, sturdy mate who'll bear me many daughters. Instead, I receive a small, curvy, pale-haired female who looks at me with anger and fear. It is only when we 'kiss' that I believe things may work out between us. But I'm hearing rumors that Starr and her shipmates are law-breakers. To survive, Dakonians must obey all laws … or be exiled into the frozen wasteland. Just when I have found her, will I have to banish my mate?",
        "category": "Romance",
        "format": "Ebook",
        "length": "Standard Length",
        "published_date": 2012,
        "thumbnail": "http://books.google.com/books/content?id=8FkqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Trinity",
        "author": "Anna Lewis",
        "description": "Scifi Alien Romance Eliana Russet lives an ordinary life with an ordinary job and an ordinary best friend. But her whole world is twisted upside down when she finds out that she’s pregnant…which is virtually impossible considering she’s been celibate for the last six months. Zander Olgarian, an impossibly attractive man, reveals himself as the father of her child and Eliana’s world comes crashing down. Not only is Zander her child’s father, but he is also an alien prince, sent down to Earth to create his heir. Eliana has to fight through secret government groups trying to hunt her, loud-mouthed best friends, and hot-headed women on her quest to protect her child and figure out exactly what she’s gotten herself into. With every new turn, she doesn’t know who to trust. She’s becoming lost in a world unknown to her and she’s struggling to keep a hold on her sanity. But she’s a fighter, and she’ll be damned if she lets anyone hurt her baby. Standalone Romance Short Story With No Cliffhanger! ---- SEARCH TERMS: Pregnancy romance, secret baby romance, baby romance, pregnancy romance, alpha male alien romance, alpha male romance, scifi alien romance, alien abduction romance, alpha male aliens, alien fantasy books, alien romance, aliens, scifi romance, Space opera romance, science fiction romance, steamy science fiction romance, hot aliens, fantasy alien romance, paranormal romance, military science fiction books, paranormal with sex, fantasy fiction, psychic romance, steamy paranormal romance, sci fi romance, sci-fi romance, Fated mates, alien mate, new adult, genetic engineering, alien contact, alpha male, alpha female, supernatural, alien invasion romance",
        "category": "Romance",
        "format": "Ebook",
        "length": "Standard Length",
        "published_date": 2007,
        "thumbnail": "http://books.google.com/books/content?id=D0baDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Deathstalker",
        "author": "Simon R. Green",
        "description": "Owen Deathstalker, last of the infamous warrior Clan, always considered himself more of a writer than a fighter, preferring his history books to making any actual history with a sword. But books won’t protect him from Her Imperial Majesty Lionstone XIV, who just Outlawed and condemned Owen to death, without any explanation, reason, or warning. No wonder she’s called the Iron Bitch. Now, on the run from Imperial starcruisers, shady mercenaries, and just about everyone else in the Empire, Owen’s options are limited. Though the name Deathstalker still commands respect in certain quarters, out on the Rim, Owen is lucky he can cobble together a makeshift team of castoffs, including an ex-pirate, a cyborg, and a bounty hunter. But allies won’t be enough to save him. If he’s to live, Owen can either run forever...or take down the corrupt Empire. To do that, he’ll need the fabled Darkvoid Device—an artifact dating back to the first Deathstalker and perhaps the only weapon powerful enough to help this ragtag rebellion win. The time has come for Owen to finally embrace his Deathstalker heritage...and all the blood and death that go along with it. Deathstalker is the first book in New York Times bestselling author Simon R. Green’s beloved space opera series.",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_date": 2009,
        "thumbnail": "http://books.google.com/books/content?id=9xoqDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Auxem",
        "author": "Lisa Lace",
        "description": "Their union could save a species. First, they'll have to save themselves. The Auxem are desperate. A virus has killed all their women and is beginning to affect the males' fertility. Their only chance for survival is mating with human women. Jayne Lynch is in charge of supervising the small group of volunteers who will be test subjects for a breeding program with the aliens. She's supposed to be impartial, but then she meets Arnon, the dark-haired, dark-eyed, muscular crown prince. The chemistry between them is too strong to ignore. Arnon is equally drawn to the curvy, blonde-haired Earthling. His father, the king, doesn't approve, but Arnon thinks Jayne is perfect - until he learns that she hasn't been entirely honest with him. The catch is that Arnon is hiding a painful secret of his own. Can he and his mate learn to trust each other in time to save their marriage and the breeding program? Or is their happy ending doomed...along with everyone on Auxem? Auxem is Book 13 in the TerraMates series and a STAND-ALONE, full-length science fiction romance. There are no cliffhangers, and a happy ending is guaranteed!",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_date": 2023,
        "thumbnail": "http://books.google.com/books/content?id=Qx77MAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Awaken",
        "author": "Lori Lind",
        "description": "Awaken is a full-length sci-fi romance novel featuring some serious enemies-to-lovers heat and a story of redemption. This book is packed full of aliens living among us and their control over our planet through a secret society. If you're a fan of dangerous and emotionally scarred heroes, a heroine who is trying to figure out her identity, and a plot to save the universe which began over a thousand years ago, then you should definitely read Awaken, the debut book in Lori Lind's sci-fi romantic All is Fair in Love and Galactic War series.Finnian fell in love with Elara before he knew she was the girl he'd been hunting for years to kill. Elara doesn't know who or what she is. Her entire life had been nothing more than a fabrication until the day of her eighteenth birthday when her true destiny was revealed. Now she has to learn fast or end up dead.",
        "category": "Romance",
        "format": "Paperback",
        "length": "Standard Length",
        "published_date": 2007,
        "thumbnail": "http://books.google.com/books/content?id=UTC9zwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "The Mammoth Book of Futuristic Romance",
        "author": "Trisha Telep",
        "description": "Love will find a way - 19 fantastic future-set romances. The good news is, in the future there will be no shortage of romance. On space ships, on newly-colonized planets or on a barely recognizable Earth, life forms, whether human, alien or something in between, will find their way to love. As giant corporations grasp new opportunities for profit and future armies clash, both in deep space and 'dirtside', former romantic partners try to put the past behind them and time-travelling rebels set out to romance the past. These science fiction stories of future love and lust - by Marcella Burnard, Bianca d'Arc, Jess Granger, Linnea Sinclair, C. L. Wilson and many more - are brimming with passion and humour. So, even though in space no one can hear you scream, they might just be able to hear you laugh.",
        "category": "Romance",
        "format": "Paperback",
        "length": "Standard Length",
        "published_date": 2000,
        "thumbnail": "http://books.google.com/books/content?id=U8XABAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Crossing in Time",
        "author": "D. L. Orton",
        "description": "The past isn't over, it's an opening; the future isn't hidden, it's a trap. If she ever wants to see him again, she'll have to take the risk... They say that true love transcends space and time, but what if your lover is murdered, and you're given the chance to go back in time to warn his much-younger self? You climb into the time machine, knowing it might kill you in a matter of hours... Only to discover he doesn't believe you. In fact, he thinks you're one fry short of a Happy Meal. (Oh, and you're supposed to save the world while you're at it. Go figure.) Fall into this \"engaging, funny, romantic & harrowing\" (Publishers Weekly ⭐️'d Review) time-travel love story and prepare to encounter a finicky time machine, a mysterious seashell, and a very clever dog (some sex, some swearing, some violence, but no vampires and absolutely no ditzes.) If there's only one love story you read this year, this is it.",
        "category": "Romance",
        "format": "Ebook",
        "length": "Long Read",
        "published_date": 2023,
        "thumbnail": "http://books.google.com/books/content?id=6E-FDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Synnr's Saint",
        "author": "Kate Rudolph",
        "description": "Taken from Earth and used like a lab rat… Emily was a normal law student until she was abducted by aliens. Forced to perform death defying feats by night and undergoing medical tests by day, she doesn’t know how much longer she can take it. When one alien takes particular interest in her she’s afraid things have gone from bad to worse. He’s got wings and fangs, and he makes her heart pound. But she can’t want an alien like that… can she? He doesn’t have time to rescue a human… Oz is on Kilrym for a reason, and it’s not to rescue the ethereal performer who captivates him by night. But covert ops are impossible when his mind is on the human who could be his fated mate. War is on the horizon, but what if the only way to save his people is to sacrifice Emily? Despite the fact that they were born light years apart, they are a perfect match. But Oz is keeping secrets, and when Emily finds out the truth she may never be able to forgive him, no matter how much she needs him to survive and escape the planet alive. Synnr’s Saint kicks off the Zulir Warrior Mates action/adventure science fiction romance series. The heroines were abducted from Earth, but they’re ready to fight back alongside their alien warrior mates. The Zulir Warrior Mates series brings you feisty women, alpha aliens, fated mates, and relationships hot enough to steam up your screen. This book is great for readers of paranormal romance and sci fi romance who love to read in their free time! alien romance books, alien romance audiobooks, fated mates, alien abduction romance, soulmates, alien human romance, best alien romance, alien romance series, science fiction romance, sci-fi romance, sfr, paranormal romance, science fiction romance novels, space opera romance",
        "category": "Romance",
        "format": "Ebook",
        "length": "Long Read",
        "published_date": 2017,
        "thumbnail": "http://books.google.com/books/content?id=OVfjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Body Memory",
        "author": "M. L. Buchman",
        "description": "He remembers her. Her touch, her scent, the way her glance could make his heart race. His very body remembers her though she is long gone. Until his job began to grind it away, one small memory at a time.",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Long Read",
        "published_date": 2024,
        "thumbnail": "http://books.google.com/books/content?id=qv7wEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Loving Hope",
        "author": "Ann Gimpel",
        "description": "Hope’s had her eye on Charlie for a long time, for all the good it’s done her. He’s not even aware of her existence—other than as a fellow agent working Black Ops for the CIA. Her friends, Glory, Honor, and Charity, found men to love, so Hope knows it’s possible. But the odds aren’t in her favor. Not in a world of normal humans where she’s a genetically modified aberration. Hell, even she refers to her kind as freaks. What man in his right mind would want one of those in his bed? Charlie swore off women after his last marriage went down in drama-tipped flames fifteen years ago. His first mistress is danger. He fell in love with the adrenaline rush when he signed on as a Navy Seal right out of college, and he never got over the thrill of pitting himself against the impossible. Hope caught his eye the night she escaped her compound, but years of ignoring anything resembling a feeling made it easy to ignore the attraction—until they’re paired on a mission. Her intelligence and resourcefulness impress the hell out of him, but her half-naked body, exposed after an animal attack, forces him to face feelings he was certain he’d buried for good.",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Long Read",
        "published_date": 2022,
        "thumbnail": "http://books.google.com/books/content?id=uqwNDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "To Keep a Wife",
        "author": "K. C. Klein",
        "description": "Lake has gotten the life she never dared dreamed of-a safe haven, and the love of a good man, her husband, Hudson Land. But Lake's hard-won happiness doesn't last long when powerful Elders lay siege on Black Creek Manor in retaliation for her past defiance. As Lake watches everything she loves go up in flames, she sacrifices herself to keep her family alive, never imagining it's not her life that is endanger, but the heart and soul of who she is. Hudson wakes from a head wound to find his whole world is reduced to ashes. With no memory of why he's sacrificed everything for a woman whose name is tattooed on his chest, Hudson is determined to make his heart match the emptiness of his mind, wiping out everything except the hatred for those who are to blame-the Elders and the wife he sought to protect. As evil and fear spread across a war-torn land, can Hudson and Lake forgive each other's betrayals and grab at their one chance at saving not only their lives... but their love as well?",
        "category": "Romance",
        "format": "Paperback",
        "length": "Long Read",
        "published_date": 2014,
        "thumbnail": "http://books.google.com/books/content?id=AetnjgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Loving Hope",
        "author": "Ann Gimpel",
        "description": "Hope’s had her eye on Charlie for a long time, for all the good it’s done her. He’s not even aware of her existence—other than as a fellow agent working Black Ops for the CIA. Her friends, Glory, Honor, and Charity, found men to love, so Hope knows it’s possible. But the odds aren’t in her favor. Not in a world of normal humans where she’s a genetically modified aberration. Hell, even she refers to her kind as freaks. What man in his right mind would want one of those in his bed? Charlie swore off women after his last marriage went down in drama-tipped flames fifteen years ago. His first mistress is danger. He fell in love with the adrenaline rush when he signed on as a Navy Seal right out of college, and he never got over the thrill of pitting himself against the impossible. Hope caught his eye the night she escaped her compound, but years of ignoring anything resembling a feeling made it easy to ignore the attraction—until they’re paired on a mission. Her intelligence and resourcefulness impress the hell out of him, but her half-naked body, exposed after an animal attack, forces him to face feelings he was certain he’d buried for good.",
        "category": "Romance",
        "format": "Paperback",
        "length": "Long Read",
        "published_date": 2021,
        "thumbnail": "http://books.google.com/books/content?id=uqwNDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Ascent (The Invasion Chronicles—Book Three): A Science Fiction Thriller",
        "author": "Morgan Rice",
        "description": "“TRANSMISSION is riveting, unexpected, and firmly rooted in strong psychological profiles backed with thriller and sci-fi elements: what more could readers wish for? (Just the quick publication of Book Two, Arrival.)” --Midwest Book Review From #1 worldwide bestselling fantasy author Morgan Rice comes book #3 in a long-anticipated science fiction series. With planet Earth destroyed, what will become of 13 year old Kevin and Chloe in the mother ship? Will the aliens enslave them? What do they want? Is there any hope of escape? And will Kevin and Chloe ever return to Earth again? “Action-packed …. Rice’s writing is solid and the premise intriguing.” –Publishers Weekly, re A Quest of Heroes “A superior fantasy… A recommended winner for any who enjoy epic fantasy writing fueled by powerful, believable young adult protagonists.” –Midwest Book Review, re Rise of the Dragons “An action packed fantasy sure to please fans of Morgan Rice’s previous novels, along with fans of works such as THE INHERITANCE CYCLE by Christopher Paolini…. Fans of Young Adult Fiction will devour this latest work by Rice and beg for more.” –The Wanderer, A Literary Journal (regarding Rise of the Dragons) Book #4 in the series is also now available! Also available are Morgan Rice’s many series in the fantasy genre, including A QUEST OF HEROES (BOOK #1 IN THE SORCERER’S RING), a free download with over 1,300 five star reviews!",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Short Read",
        "published_date": 2012,
        "thumbnail": "http://books.google.com/books/content?id=pfxmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Project Hail Mary",
        "author": "Andy Weir",
        "description": "#1 NEW YORK TIMES BESTSELLER • From the author of The Martian, a lone astronaut must save the earth from disaster in this “propulsive” (Entertainment Weekly), cinematic thriller full of suspense, humor, and fascinating science—in development as a major motion picture starring Ryan Gosling. HUGO AWARD FINALIST • ONE OF THE YEAR’S BEST BOOKS: Bill Gates, GatesNotes, New York Public Library, Parade, Newsweek, Polygon, Shelf Awareness, She Reads, Kirkus Reviews, Library Journal • “An epic story of redemption, discovery and cool speculative sci-fi.”—USA Today “If you loved The Martian, you’ll go crazy for Weir’s latest.”—The Washington Post Ryland Grace is the sole survivor on a desperate, last-chance mission—and if he fails, humanity and the earth itself will perish. Except that right now, he doesn’t know that. He can’t even remember his own name, let alone the nature of his assignment or how to complete it. All he knows is that he’s been asleep for a very, very long time. And he’s just been awakened to find himself millions of miles from home, with nothing but two corpses for company. His crewmates dead, his memories fuzzily returning, Ryland realizes that an impossible task now confronts him. Hurtling through space on this tiny ship, it’s up to him to puzzle out an impossible scientific mystery—and conquer an extinction-level threat to our species. And with the clock ticking down and the nearest human being light-years away, he’s got to do it all alone. Or does he? An irresistible interstellar adventure as only Andy Weir could deliver, Project Hail Mary is a tale of discovery, speculation, and survival to rival The Martian—while taking us to places it never dreamed of going.",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Short Read",
        "published_date": 2024,
        "thumbnail": "http://books.google.com/books/content?id=iEiHEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Disappeared",
        "author": "Kristine Kathryn Rusch",
        "description": "Three cases have collided for Miles Flint: a stolen spaceyacht filled with dead bodies, two kidnapped human children, and a human woman on the run, trying to Disappear to avoid alien prosecution. Flint must enforce the law, but how can he do the right thing in a universe where the right thing is very, very wrong?",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Short Read",
        "published_date": 2011,
        "thumbnail": "http://books.google.com/books/content?id=4AQmuQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Ender's Game",
        "author": "Orson Scott Card",
        "description": "\"The classic of modern science fiction\"--Front cover.",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Short Read",
        "published_date": 2002,
        "thumbnail": "http://books.google.com/books/content?id=jaM7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Paradox Hotel",
        "author": "Rob Hart",
        "description": "“Time travel, murder, corruption, restless baby dinosaurs, and a snarky robot named Ruby collide in this excellent, noir-inflected, humor-infused, science-fiction thriller.”—The Boston Globe An impossible crime. A detective on the edge of madness. The future of time travel at stake. From the author of The Warehouse . . . ONE OF THE BEST BOOKS OF THE YEAR: NPR, Kirkus Reviews January Cole’s job just got a whole lot harder. Not that running security at the Paradox was ever really easy. Nothing’s simple at a hotel where the ultra-wealthy tourists arrive costumed for a dozen different time periods, all eagerly waiting to catch their “flights” to the past. Or where proximity to the timeport makes the clocks run backward on occasion—and, rumor has it, allows ghosts to stroll the halls. None of that compares to the corpse in room 526. The one that seems to be both there and not there. The one that somehow only January can see. On top of that, some very important new guests have just checked in. Because the U.S. government is about to privatize time-travel technology—and the world’s most powerful people are on hand to stake their claims. January is sure the timing isn’t a coincidence. Neither are those “accidents” that start stalking their bidders. There’s a reason January can glimpse what others can’t. A reason why she’s the only one who can catch a killer who’s operating invisibly and in plain sight, all at once. But her ability is also destroying her grip on reality—and as her past, present, and future collide, she finds herself confronting not just the hotel’s dark secrets but her own. At once a dazzlingly time-twisting murder mystery and a story about grief, memory, and what it means to—literally—come face-to-face with our ghosts, The Paradox Hotel is another unforgettable speculative thrill ride from acclaimed author Rob Hart.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Short Read",
        "published_date": 2024,
        "thumbnail": "http://books.google.com/books/content?id=h86UEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Zero Sum Game",
        "author": "S. L. Huang",
        "description": "ZERO SUM GAME Best of Lists: * Best Books of the Month at The Verge, Book Riot, Unbound Worlds, SYFY, & Kirkus * The Mary Sue Book Club Pick * Library Journal Best Debuts of Fall and Winter A blockbuster, near-future science fiction thriller, S.L. Huang's Zero Sum Game introduces a math-genius mercenary who finds herself being manipulated by someone possessing unimaginable power... Cas Russell is good at math. Scary good. The vector calculus blazing through her head lets her smash through armed men twice her size and dodge every bullet in a gunfight, and she'll take any job for the right price. As far as Cas knows, she’s the only person around with a superpower...until she discovers someone with a power even more dangerous than her own. Someone who can reach directly into people’s minds and twist their brains into Moebius strips. Someone intent on becoming the world’s puppet master. Cas should run, like she usually does, but for once she's involved. There’s only one problem... She doesn’t know which of her thoughts are her own anymore. \"Fresh and exciting... a great start to an exciting series--and an exciting career.\" --Boing Boing At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Short Read",
        "published_date": 2023,
        "thumbnail": "http://books.google.com/books/content?id=XyBGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Outer Spheres",
        "author": "Andrew Wallace",
        "description": "How can such a bright future be so full of darkness? Beautiful young Charity Freestone has it all: the love of a good man, the revelation of her remarkable identity, and her family reunited after their spectacular battle with the Sons of the Crystal Mind. However, at her moment of triumph Charity is tricked into joining the mysterious New Form Enterprise, whose harsh regime seems designed to break her. Before she can learn their strange purpose, a shocking betrayal brings unique and terrifying freedom. Cut off from its advanced technology, Charity is hunted through war-torn, subterranean Diamond City by an enemy who is always closer than she thinks. As she struggles to make sense of her inhumanly ruthless pursuers, Charity must confront her own complicity in the nightmare that engulfs her. And when she does, she discovers there are far worse places than the dreaded Outer Spheres. Book Two of Andrew Wallace’s viscerally thrilling Diamond Roads science fiction series, The Outer Spheres takes extraordinary heroine Charity Freestone into even stranger and more disturbing territory. The novel threads bleeding-edge science through a fearsomely-wrought war story to explore the unimaginable outcomes of our most terrifying decisions. Blending the vast and eerie scale of Peter F Hamilton’s The Reality Dysfunction with the originality and political insight of Anne Leckie’s Ancilliary Justice, The Outer Spheres forges a unique vision of fear and wonder. Diamond Roads is fast becoming a whole new mythology, exploring the way things are against a wildly-imagined backdrop of how they might turn out. To see if Charity survives, and whether she can be truly free of her pursuers and her own demons, buy the book now. Praise for Diamond Roads: Andrew Wallace shows a real talent for world building in this well-written, fast-paced debut novel. From the first page, Diamond Roads is packed with sci-fi smarts. I’m looking forward to reading more from this author – Anne Charnock, winner of the Clarke Award for Dreams Before the Start of Time & the BSFA Award for The Enclave Fast-paced, clever and beautifully written, Diamond Roads is a richly imagined dystopian thriller that introduces the latest in a long line of cool, kick-ass SF heroines. Charity Freestone combines the strength of Ripley with the wiles of Katniss and the vulnerability of Halo Jones. If you liked Wool, you'll love this – Mark Edwards, bestselling author of The Magpies & Follow You Home I loved this smart, continually surprising thriller set in a richly drawn world – Simon Guerrier, author of Doctor Who: The Pirate Loop; Primeval: Fire & Water & Being Human: The Road",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Standard Length",
        "published_date": 2023,
        "thumbnail": "http://books.google.com/books/content?id=d4vmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "People of Dust",
        "author": "Marcus Martin",
        "description": "The Lunar Inspector is dead. Luke Remini must urgently find the killer. But he's a wanted man himself... Nuclear fuel from Lunar Three has brought Earth's two superpowers to the table. For the first time in thirty years, peace is within reach. But rumors of a new bioweapon could spark war. The Moon has become the covert battle ground for a conflict bigger than anyone could possibly know... \"Action-packed, with humor throughout, it had me from the first page\" - Marie Thorpe From international bestselling author Marcus Martin, People of Change is a thrilling near-future sci-fi series. Bursting with twists, action, and dark humor, you'll be racing to the next page. The People of Change books can be read independently and in any order. The series contains strong language, adult themes, and gripping characters. You're welcome.",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Standard Length",
        "published_date": 2002,
        "thumbnail": "http://books.google.com/books/content?id=QxAuEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Outer Spheres",
        "author": "Andrew Wallace",
        "description": "How can such a bright future be so full of darkness? Beautiful young Charity Freestone has it all: the love of a good man, the revelation of her remarkable identity, and her family reunited after their spectacular battle with the Sons of the Crystal Mind. However, at her moment of triumph Charity is tricked into joining the mysterious New Form Enterprise, whose harsh regime seems designed to break her. Before she can learn their strange purpose, a shocking betrayal brings unique and terrifying freedom. Cut off from its advanced technology, Charity is hunted through war-torn, subterranean Diamond City by an enemy who is always closer than she thinks. As she struggles to make sense of her inhumanly ruthless pursuers, Charity must confront her own complicity in the nightmare that engulfs her. And when she does, she discovers there are far worse places than the dreaded Outer Spheres. Book Two of Andrew Wallace’s viscerally thrilling Diamond Roads science fiction series, The Outer Spheres takes extraordinary heroine Charity Freestone into even stranger and more disturbing territory. The novel threads bleeding-edge science through a fearsomely-wrought war story to explore the unimaginable outcomes of our most terrifying decisions. Blending the vast and eerie scale of Peter F Hamilton’s The Reality Dysfunction with the originality and political insight of Anne Leckie’s Ancilliary Justice, The Outer Spheres forges a unique vision of fear and wonder. Diamond Roads is fast becoming a whole new mythology, exploring the way things are against a wildly-imagined backdrop of how they might turn out. To see if Charity survives, and whether she can be truly free of her pursuers and her own demons, buy the book now. Praise for Diamond Roads: Andrew Wallace shows a real talent for world building in this well-written, fast-paced debut novel. From the first page, Diamond Roads is packed with sci-fi smarts. I’m looking forward to reading more from this author – Anne Charnock, winner of the Clarke Award for Dreams Before the Start of Time & the BSFA Award for The Enclave Fast-paced, clever and beautifully written, Diamond Roads is a richly imagined dystopian thriller that introduces the latest in a long line of cool, kick-ass SF heroines. Charity Freestone combines the strength of Ripley with the wiles of Katniss and the vulnerability of Halo Jones. If you liked Wool, you'll love this – Mark Edwards, bestselling author of The Magpies & Follow You Home I loved this smart, continually surprising thriller set in a richly drawn world – Simon Guerrier, author of Doctor Who: The Pirate Loop; Primeval: Fire & Water & Being Human: The Road",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_date": 2013,
        "thumbnail": "http://books.google.com/books/content?id=d4vmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Ambush",
        "author": "Dean M. Cole",
        "description": "**Bestselling Author of Solitude: Dimension Space Book One** Humans rule the galaxy...Today! The Milkyway's predominant species discovers a lost colony of their ancestors--humans--populating today's Earth. Then our genetic link draws the attention and enmity of their galactic rivals. When a plan to elevate present-day Earth leads to an alien invasion, a small, multinational military task force is all that stands between humanity and certain annihilation. If you like action-packed, page-turning novels, then you'll love the electrifying action in this apocalyptic military thriller. Grab Book One Today! Independence Day meets The X-Files when Air Force fighter pilots Jake Giard and Sandra Fitzpatrick join a decades-old secret project to integrate today's Earth into a galactic government. But when a galactic civil war spills onto our shores, plunging the planet into an otherworldly post-apocalyptic hell, can Jake and Sandy save humanity from extinction? A Little More About Ambush... As unknown aliens with a dark secret continue to raid the planet, Jake fights through a post-apocalyptic hell, struggling to comprehend the enigmatic aftermath of the first attack. On the West Coast, Sandra's squadron smashes against the invading aliens. Thrown to ground, Sandy wades through blazing infernos and demented looters in a desperate attempt to save her family. Finally, with the fate of the world in the balance, both captains must take the battle to the enemy--humanity's very survival hanging on their success. What the Critics are Saying KirkusReviews \"Cole tackles the first-contact scenario with bombastic flair. [He] delivers the high-resolution imagery of a Hollywood blockbuster ... A technologically riveting dream for sci-fi action fans.\" AudiobookReviewer \"SECTOR 64: Ambush was a highly imaginative action-packed apocalyptic assault on your mind.\" IndieReader \"SECTOR 64: AMBUSH is an engaging book from the very first page to the final words of the Epilogue.\" Audiobook-Heaven \"His descriptions of aerial battle and military procedure are accurately detailed and his knowledge of the aircraft themselves fascinated me ... Sector 64: Ambush is a great read.\" Scroll up and grab a copy today.",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_date": 2023,
        "thumbnail": "http://books.google.com/books/content?id=aU89zQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Ambush",
        "author": "Dean M. Cole",
        "description": "**Bestselling Author of Solitude: Dimension Space Book One** Humans rule the galaxy...Today! The Milkyway's predominant species discovers a lost colony of their ancestors--humans--populating today's Earth. Then our genetic link draws the attention and enmity of their galactic rivals. When a plan to elevate present-day Earth leads to an alien invasion, a small, multinational military task force is all that stands between humanity and certain annihilation. If you like action-packed, page-turning novels, then you'll love the electrifying action in this apocalyptic military thriller. Grab Book One Today! Independence Day meets The X-Files when Air Force fighter pilots Jake Giard and Sandra Fitzpatrick join a decades-old secret project to integrate today's Earth into a galactic government. But when a galactic civil war spills onto our shores, plunging the planet into an otherworldly post-apocalyptic hell, can Jake and Sandy save humanity from extinction? A Little More About Ambush... As unknown aliens with a dark secret continue to raid the planet, Jake fights through a post-apocalyptic hell, struggling to comprehend the enigmatic aftermath of the first attack. On the West Coast, Sandra's squadron smashes against the invading aliens. Thrown to ground, Sandy wades through blazing infernos and demented looters in a desperate attempt to save her family. Finally, with the fate of the world in the balance, both captains must take the battle to the enemy--humanity's very survival hanging on their success. What the Critics are Saying KirkusReviews \"Cole tackles the first-contact scenario with bombastic flair. [He] delivers the high-resolution imagery of a Hollywood blockbuster ... A technologically riveting dream for sci-fi action fans.\" AudiobookReviewer \"SECTOR 64: Ambush was a highly imaginative action-packed apocalyptic assault on your mind.\" IndieReader \"SECTOR 64: AMBUSH is an engaging book from the very first page to the final words of the Epilogue.\" Audiobook-Heaven \"His descriptions of aerial battle and military procedure are accurately detailed and his knowledge of the aircraft themselves fascinated me ... Sector 64: Ambush is a great read.\" Scroll up and grab a copy today.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Standard Length",
        "published_date": 2023,
        "thumbnail": "http://books.google.com/books/content?id=aU89zQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Solitude",
        "author": "Dean M. Cole",
        "description": "Months after the apocalypse, Earth's last man discovers the last woman is stranded on the International Space Station, barely alive-so begins a race against time. If you like action-packed, page-turning novels, you'll love the electrifying action in this award-winning, apocalyptic thriller.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Standard Length",
        "published_date": 2024,
        "thumbnail": "http://books.google.com/books/content?id=29ZBzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Ascent (The Invasion Chronicles—Book Three): A Science Fiction Thriller",
        "author": "Morgan Rice",
        "description": "“TRANSMISSION is riveting, unexpected, and firmly rooted in strong psychological profiles backed with thriller and sci-fi elements: what more could readers wish for? (Just the quick publication of Book Two, Arrival.)” --Midwest Book Review From #1 worldwide bestselling fantasy author Morgan Rice comes book #3 in a long-anticipated science fiction series. With planet Earth destroyed, what will become of 13 year old Kevin and Chloe in the mother ship? Will the aliens enslave them? What do they want? Is there any hope of escape? And will Kevin and Chloe ever return to Earth again? “Action-packed …. Rice’s writing is solid and the premise intriguing.” –Publishers Weekly, re A Quest of Heroes “A superior fantasy… A recommended winner for any who enjoy epic fantasy writing fueled by powerful, believable young adult protagonists.” –Midwest Book Review, re Rise of the Dragons “An action packed fantasy sure to please fans of Morgan Rice’s previous novels, along with fans of works such as THE INHERITANCE CYCLE by Christopher Paolini…. Fans of Young Adult Fiction will devour this latest work by Rice and beg for more.” –The Wanderer, A Literary Journal (regarding Rise of the Dragons) Book #4 in the series is also now available! Also available are Morgan Rice’s many series in the fantasy genre, including A QUEST OF HEROES (BOOK #1 IN THE SORCERER’S RING), a free download with over 1,300 five star reviews!",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Long Read",
        "published_date": 2019,
        "thumbnail": "http://books.google.com/books/content?id=pfxmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Return (The Invasion Chronicles—Book Four): A Science Fiction Thriller",
        "author": "Morgan Rice",
        "description": "“TRANSMISSION is riveting, unexpected, and firmly rooted in strong psychological profiles backed with thriller and sci-fi elements: what more could readers wish for? (Just the quick publication of Book Two, Arrival.)” --Midwest Book Review From #1 worldwide bestselling fantasy author Morgan Rice comes RETURN, book #4 in a long-anticipated science fiction series. Can Kevin and Chloe survive alone in outer space? Can Luna, alone on planet Earth, avoid capture? All hope seems lost for Kevin and Chloe as their escape pod hurtles into nothingness, as they run out of rations and supplies. All hope seems lost for Luna as the aliens outnumber and encircle her. If there any hope left for humanity? “Action-packed …. Rice’s writing is solid and the premise intriguing.” –Publishers Weekly, re A Quest of Heroes “A superior fantasy… A recommended winner for any who enjoy epic fantasy writing fueled by powerful, believable young adult protagonists.” –Midwest Book Review, re Rise of the Dragons “An action packed fantasy sure to please fans of Morgan Rice’s previous novels, along with fans of works such as THE INHERITANCE CYCLE by Christopher Paolini…. Fans of Young Adult Fiction will devour this latest work by Rice and beg for more.” –The Wanderer, A Literary Journal (regarding Rise of the Dragons) Also available are Morgan Rice’s many series in the fantasy genre, including A QUEST OF HEROES (BOOK #1 IN THE SORCERER’S RING), a free download with over 1,300 five star reviews!",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Long Read",
        "published_date": 2001,
        "thumbnail": "http://books.google.com/books/content?id=Vo5yDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Blood Crazy",
        "author": "Simon Clark",
        "description": "It is a quiet, uneventful Saturday in Doncaster. Nick Aten, and his best friend Steve Price – troubled seventeen year olds – spend it as usual hanging around the sleepy town, eating fast food and planning their revenge on Tug Slatter, a local bully and their arch-enemy. But by Sunday, Tug Slatter becomes the last of their worries because somehow overnight civilization is in ruins. Adults have become murderously insane – literally. They're infected with an uncontrollable urge to kill the young. Including their own children. As Nick and Steve try to escape the deadly town covered with the mutilated bodies of kids, a group of blood-thirsty adults ambushes them. Just a day before they were caring parents and concerned teachers, today they are savages destroying the future generation. Will Nick and Steve manage to escape? Is their hope that outside the Doncaster borders the world is 'normal' just a childish dream? Blood Crazy, first published in 1995, is a gripping, apocalyptic horror from Simon Clark.",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Long Read",
        "published_date": 2021,
        "thumbnail": "http://books.google.com/books/content?id=pwKrBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Judas Unchained",
        "author": "Peter F. Hamilton",
        "description": "WALL STREET JOURNAL BESTSELLER • “An interstellar suspense thriller . . . sweeping in scope and emotional range.”—San Antonio Express-News In the star-spanning civilization known as the Intersolar Commonwealth, twenty-three planets have fallen victim to the Prime, a technologically advanced alien species genetically hardwired to exterminate all other forms of life. But the Prime is not the only threat. The Starflyer, an alien with mind-control abilities impossible to detect or resist, has secretly infiltrated the Commonwealth and is sabotaging the war effort. Is the Starflyer an ally of the Prime, or has it orchestrated a fight to the death between the two species for its own advantage? Caught between two deadly enemies, the fractious Commonwealth must unite as never before. This will be humanity’s finest hour—or its last gasp. Praise for Judas Unchained, the sequel to Pandora’s Star “Bristles with the energy of golden age SF, but the style and characterizations are polished and modern.”—SF Site “You’re in for quite a ride.”—The Santa Fe New Mexican “The reader is left breathless in amazement.”—SFRevu",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Long Read",
        "published_date": 2019,
        "thumbnail": "http://books.google.com/books/content?id=j1WZfzhwzaQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Zero Sum Game",
        "author": "S. L. Huang",
        "description": "ZERO SUM GAME Best of Lists: * Best Books of the Month at The Verge, Book Riot, Unbound Worlds, SYFY, & Kirkus * The Mary Sue Book Club Pick * Library Journal Best Debuts of Fall and Winter A blockbuster, near-future science fiction thriller, S.L. Huang's Zero Sum Game introduces a math-genius mercenary who finds herself being manipulated by someone possessing unimaginable power... Cas Russell is good at math. Scary good. The vector calculus blazing through her head lets her smash through armed men twice her size and dodge every bullet in a gunfight, and she'll take any job for the right price. As far as Cas knows, she’s the only person around with a superpower...until she discovers someone with a power even more dangerous than her own. Someone who can reach directly into people’s minds and twist their brains into Moebius strips. Someone intent on becoming the world’s puppet master. Cas should run, like she usually does, but for once she's involved. There’s only one problem... She doesn’t know which of her thoughts are her own anymore. \"Fresh and exciting... a great start to an exciting series--and an exciting career.\" --Boing Boing At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Long Read",
        "published_date": 2005,
        "thumbnail": "http://books.google.com/books/content?id=XyBGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Return (The Invasion Chronicles—Book Four): A Science Fiction Thriller",
        "author": "Morgan Rice",
        "description": "“TRANSMISSION is riveting, unexpected, and firmly rooted in strong psychological profiles backed with thriller and sci-fi elements: what more could readers wish for? (Just the quick publication of Book Two, Arrival.)” --Midwest Book Review From #1 worldwide bestselling fantasy author Morgan Rice comes RETURN, book #4 in a long-anticipated science fiction series. Can Kevin and Chloe survive alone in outer space? Can Luna, alone on planet Earth, avoid capture? All hope seems lost for Kevin and Chloe as their escape pod hurtles into nothingness, as they run out of rations and supplies. All hope seems lost for Luna as the aliens outnumber and encircle her. If there any hope left for humanity? “Action-packed …. Rice’s writing is solid and the premise intriguing.” –Publishers Weekly, re A Quest of Heroes “A superior fantasy… A recommended winner for any who enjoy epic fantasy writing fueled by powerful, believable young adult protagonists.” –Midwest Book Review, re Rise of the Dragons “An action packed fantasy sure to please fans of Morgan Rice’s previous novels, along with fans of works such as THE INHERITANCE CYCLE by Christopher Paolini…. Fans of Young Adult Fiction will devour this latest work by Rice and beg for more.” –The Wanderer, A Literary Journal (regarding Rise of the Dragons) Also available are Morgan Rice’s many series in the fantasy genre, including A QUEST OF HEROES (BOOK #1 IN THE SORCERER’S RING), a free download with over 1,300 five star reviews!",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Long Read",
        "published_date": 2024,
        "thumbnail": "http://books.google.com/books/content?id=Vo5yDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Invisible Man",
        "author": "H. G. Wells",
        "description": "One dark and stormy night, a stranger arrives in West Sussex at a village inn. He is heavily clad in an overcoat and his face is wrapped in bandages. He takes a room at the inn, but refuses to socialize with anyone. He stays cooped up in his room all day and night, working with strange chemicals and apparatus. Suddenly, strange events begin to happen in the village. Mysterious burglaries and fires break out, culminating in a destructive rampage across the peaceful countryside. The stranger is the keeper of a terrible secret... The Invisible Man: A Grotesque Romance (to give the book its full title) by HG Wells was published in 1897. Written in novella form, this bizarre science fiction tale was first published in Pearson's Weekly as a serial and later compiled into a single book. Based on scientific theories of optics and physics, this story instantly caught the imagination of readers and has been regularly adapted to film, television and radio since it first made its appearance more than a hundred years ago. Herbert George Wells' writing career owes itself to an accident suffered in childhood. As an eight year old boy, he was once confined to bed with a broken leg. His father, a professional cricketer and failed businessman, regularly brought him books from the local library so that he could pass the time. His father's financial troubles compelled his mother to go to work as a lady's maid in a local mansion, while the children were put to work as apprentices with various local tradesmen. For Wells, this was one of the most unhappy, yet also the most profitable times in his life. The mansion where his mother worked had an enormous library where the child continued to read and educate himself. At eighteen, he went to work as a teacher in a residential school. His career flourished after that, and he won a scholarship to work under the great biologist, Thomas Huxley in London. He began writing science fiction stories in 1895 with the publication of The Time Machine, where he proposed the concept of selective time travel. Several other extremely popular Sci-Fi novels and short stories followed, interspersed with romantic stories, novels, ghost stories, film scripts, articles, satirical novels, historical and political treatises and non-fiction papers. Wells was an extremely prolific writer and continues to inspire generations of writers even today. The Invisible Man is a book that evokes great interest among readers of all ages and is an important landmark in the history of Sci-Fi writing. One dark and stormy night, a stranger arrives in West Sussex at a village inn. He is heavily clad in an overcoat and his face is wrapped in bandages. He takes a room at the inn, but refuses to socialize with anyone. He stays cooped up in his room all day and night, working with strange chemicals and apparatus. Suddenly, strange events begin to happen in the village. Mysterious burglaries and fires break out, culminating in a destructive rampage across the peaceful countryside. The stranger is the keeper of a terrible secret... The Invisible Man: A Grotesque Romance (to give the book its full title) by HG Wells was published in 1897. Written in novella form, this bizarre science fiction tale was first published in Pearson's Weekly as a serial and later compiled into a single book. Based on scientific theories of optics and physics, this story instantly caught the imagination of readers and has been regularly adapted to film, television and radio since it first made its appearance more than a hundred years ago.",
        "category": "Comics",
        "format": "Ebook",
        "length": "Short Read",
        "published_date": 2016,
        "thumbnail": "http://books.google.com/books/content?id=_2WLtAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "The Invisible Man Illustrated",
        "author": "H. G. Wells",
        "description": "The Invisible Man is a science fiction novel by H. G. Wells. Originally serialized in Pearson's Weekly in 1897, it was published as a novel the same year. The Invisible Man of the title is Griffin, a scientist who has devoted himself to research into optics and invents a way to change a body's refractive index to that of air so that it neither absorbs nor reflects light and thus becomes invisible. He successfully carries out this procedure on himself, but fails in his attempt to reverse it. An enthusiast of random and irresponsible violence, Griffin has become an iconic character in horror fiction.This is a classic science-fiction book with over 100 pages of pure excitement and wonder. The Invisible Man may start out slowly, but once you pay close attention, the book becomes a spine-tingling thriller that will leave you breathless. It all starts when a mysterious stranger comes into the town of Iping, all wrapped up in bandages. He never takes off his glasses, bandages, or coat, and brings all sorts of strange chemicals in little bottles with him. He sits in his hotel room all day, working with the chemicals. No one knows what he's doing, but eventually, people get suspicious. Who is this disguised man? Is he a criminal in hiding? Or maybe he's horribly disfigured! All the same, they want to get a glimpse of this strange man's face. Just imagine their surprise when they find out that this man is invisible! I would definitely inspire anyone who likes a good hard read and science-fiction to read this fantastic novel",
        "category": "Comics",
        "format": "Ebook",
        "length": "Short Read",
        "published_date": 2016,
        "thumbnail": "http://books.google.com/books/content?id=_d0UzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Objective First Workbook Without Answers with Audio CD",
        "author": "Annette Capel",
        "description": "Third edition of the best-selling Cambridge English: First (FCE) course. The syllabus for this exam has changed and this book has now been replaced by 9781107628397 Objective First Fourth edition Workbook without answers with Audio CD.",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Short Read",
        "published_date": 2019,
        "thumbnail": "http://books.google.com/books/content?id=YUg5_Y4zH-IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Objective First Workbook with Answers with Audio CD",
        "author": "Annette Capel",
        "description": "Third edition of the best-selling Cambridge English: First (FCE) course. The syllabus for this exam has changed and this book has now been replaced by 9781107628458 Objective First Fourth edition Workbook with answers with Audio CD.",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Short Read",
        "published_date": 1988,
        "thumbnail": "http://books.google.com/books/content?id=w4Yhla97DsoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Zap!",
        "author": "Bryan Baugh",
        "description": "Star Wars, Star Trek, Alien, Predator, The Matrix - part of the appeal of great science fiction is its distinctive look. Now, withZap! How to Draw Fantastic Sci-Fi Comics,artists everywhere can learn to create their own sci-fi realities and to draw space heroes and heroines, intergalactic villains, robots, spaceships, blasting rockets, slimy aliens, and much more. A history of science-fiction comics is followed by an overview of the genre illustrated by the masters, including Alex Raymond (creator of Flash Gordon), Wally Wood (who shaped the look of 1950s sci-fi), and Basil Wolverton (whose bizarre art launched a thousand mid-century sci-fi stories). Then readers turn to Bryan Baugh’s clear, detailed step-by-step instruction on how to draw dynamic cosmic action figures plus all the futuristic technology they can dream up. Perfect for artists, fans, even writers,Zap! How to Draw Fantastic Sci-Fi Comicslets the art of the future spring from the art of the past.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Short Read",
        "published_date": 2024,
        "thumbnail": "http://books.google.com/books/content?id=0l4UID9J1uEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "A Girl in Time",
        "author": "John Birmingham",
        "description": "On the eve of a huge, breakout success, a poor but brilliant young game developer is pulled out of her world, and time itself, by a cowboy desperately searching for the daughter he lost two hundred years ago. Cady McCall is ready to be rich and famous. She has sacrificed everything, putting her work ahead of family and friends. Now with breakout success and huge, insane wealth so close she can taste it, her life is blown apart by Deputy Marshal John 'Titanic' Smith, the man who rescues her from two muggers, only to carry her off into history. Lost on the seas of time, Smith is desperate to get home to his family in 1876, and now Cady is lost along with him, facing danger and finding love in Victorian London, Ancient Rome and in the near-future America of President for Life Donald Trump.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Short Read",
        "published_date": 2024,
        "thumbnail": "http://books.google.com/books/content?id=ouz1nAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Sci-Fi San Francisco",
        "author": "Emma Dudley",
        "description": "San Francisco is weird. That's why it's a perfect setting for science fiction stories. Sci-Fi San Francisco collects speculative comics from more than two dozen creators, featuring dimension-hopping realtors, biotech shenanigans, hyper-evolved cats, and visions of the future both optimistic and apocalyptic.",
        "category": "Comics",
        "format": "Ebook",
        "length": "Standard Length",
        "published_date": 1980,
        "thumbnail": "http://books.google.com/books/content?id=n6gLtAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Warlord of Mars: Fall of Barsoom Vol. 1: Collection",
        "author": "Robert Place Napton",
        "description": "124 pages! 100,000 years before the time of John Carter! Barsoom is a dying world: its once mighty oceans are receding and its atmosphere grows more tenuous by the day. The Orovars, who have dominated for a million years, are on the verge of extinction at the hands of the Green Hordes and the emerging Red Martians. Two Orovars - a Scientist and a General - race against time to save their people before Mars plunges into barbarism!",
        "category": "Comics",
        "format": "Ebook",
        "length": "Standard Length",
        "published_date": 2023,
        "thumbnail": "http://books.google.com/books/content?id=-EjiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Imagine Wanting Only This",
        "author": "Kristen Radtke",
        "description": "ONE OF THE BEST BOOKS OF THE YEAR: Forbes • Lit Hub • Electric Lit A gorgeous graphic memoir about loss, love, and confronting grief When Kristen Radtke was in college, the sudden death of a beloved uncle and the sight of an abandoned mining town after his funeral marked the beginning moments of a lifelong fascination with ruins and with people and places left behind. Over time, this fascination deepened until it triggered a journey around the world in search of ruined places. Now, in this genre-smashing graphic memoir, she leads us through deserted cities in the American Midwest, an Icelandic town buried in volcanic ash, islands in the Philippines, New York City, and the delicate passageways of the human heart. Along the way, we learn about her family and a rare genetic heart disease that has been passed down through generations, and revisit tragic events in America’s past. A narrative that is at once narrative and factual, historical and personal, Radtke’s stunning illustrations and piercing text never shy away from the big questions: Why are we here, and what will we leave behind? (With black-and-white illustrations throughout; part of the Pantheon Graphic Novel series)",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_date": 2023,
        "thumbnail": "http://books.google.com/books/content?id=7gBmDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Logan's Run: Last Day #1",
        "author": "William F. Nolan",
        "description": "Logan has been trained to kill, born and bred from conception to be the best of the best, but his time is short. He’s nearing the end of his life. Age 21, when every citizen reports for Deep Sleep. But before his life ends he’s got one final mission: find and destroy Sanctuary, a fabled haven for those that chose to defy the system. William F. Nolan’s masterpiece of dystopian future once again races into the 23rd Century with this all-new comic book adaptation of LOGAN’S RUN. When Last Day comes, will you lie down and die... or run!",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_date": 2022,
        "thumbnail": "http://books.google.com/books/content?id=HqSNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Mutants and Mystics",
        "author": "Jeffrey J. Kripal",
        "description": "\"Account of how comic book heroes have helped their creators and fans alike explore and express a wealth of paranormal experiences ignored by mainstream science. Delving deeply into the work of major figures in the field - from Jack Kirby's cosmic superhero sagas and Philip K. Dick's futuristic head-trips to Alan Moore's sex magic and Whitley Strieber's communion with visitors - Kripal shows how creators turned to science fiction to convey the reality of the inexplicable and the paranormal they experienced in their lives. Expanded consciousness found its language in the metaphors of sci-fi - incredible powers, unprecedented mutations, time-loops and vast intergalactic intelligences - and the deeper influences of mythology and religion that these in turn drew from ; the wildly creative work that followed caught the imaginations of millions. Moving deftly from Cold War science and Fredric Wertham's anticomics crusade to gnostic revelation and alien abduction, Kripal spins out a hidden history of American culture, rich with mythical themes and shot through with an awareness that there are other realities far beyond our everyday understanding.\"--Jacket.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Standard Length",
        "published_date": 2015,
        "thumbnail": "http://books.google.com/books/content?id=8kNjcn8KsuUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Little Book of Vintage Sauciness",
        "author": "Tim Pilcher",
        "description": "This small, but perfectly formed, collection of kitsch and saucy images comes complete with fascinating letters from cult Fifties fetish magazine, Bizarre. From spankings to bondage, vamps to willing victims, this little nugget of cult craziness is truly a spicy bit of \"Pepper to season your chow!\"",
        "category": "Comics",
        "format": "Paperback",
        "length": "Standard Length",
        "published_date": 2011,
        "thumbnail": "http://books.google.com/books/content?id=P5F8tgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Paragon",
        "author": "Autumn Kalquist",
        "description": "Tadeo Raines knows what they say about him. It’s all lies. But lies are better than the truth. He broke the rules once and swore he’d never do it again. Now traitors plot against the fleet, and he's tasked with hunting them down and stopping them. Permanently. Tadeo was born to command, born to lead the last remnants of humanity to a new Earth. He knows there’s a better world out there: Daylight at the end of humanity's long night. And he's willing to do whatever it takes to get the fleet there. Even if it means walking the line between loyalty and treason. And breaking the rules... Again. Legacy Code is a suspenseful and dark genetic engineering science fiction series that has earned five star reviews from fans of some of the best sci-fi and fantasy books like Hunger Games, Divergent, and Red Rising, and has been compared favorably to Wool, 1984, and the new Battlestar Galactica. What readers are saying: If you like mysteries and/or sci-fi you will love this book!!! \"This is a very good story that has your heart pounding as you turn the pages. Intrigue, nefarious plots, twists and turns around every corner - great series, even if you're not a fan of science fiction.\" \"From the moment I read the first paragraph of Paragon, up until the last sentence, I was enthralled. Non-stop, on edge, exciting action. I honestly couldn't put a fault on this one, I loved all of it, including the song! The Fractured Era series is still up there amongst my favourite novels of the year.\" \"Full of questions, traitors galore, secrets & suspicions. You can't even trust your own family in this world!\" Phenomenal...that's the best word to describe it. Autumn Kalquist manages to weave a tale that is jam packed with suspense and whodunit plots. Just loved it with it many twists and turns that keeps you on your toes. The characters were great and you just didn't know who to trust in the conspiracy that was going on. ...Highly recommended series and anxious to read the next book. I love all of this author's books. I have read many post-apocalyptic and dystopian tales and this is different from all the rest. She always keeps me guessing. My only complaint is she doesn’t write them fast enough!! I believe this is the first 5 star rating I've ever given. LOVED IT! Such a great follow up to Legacy Code (which ended up on my Top Ten 2014 list) I love Autumn's writing style, she is so talented and takes you right there alongside the characters. This is a beautiful and unique story and I can't wait to read more!! \"In a story where I fell in love with the characters, it is easy to have your heart broken, have a smile on your face, or cry over a simple scene in the book. This is one series I would never stop reading, and admittedly, have read on more than one occasion!\" \"This series has me intrigued, it feels realistic, real and frightening at the same time. Humanity is alone in space in their fleet of ships and they have nowhere to go, they try to find a better earth, a new home. I want to know if they ever find it.\" keywords: science fiction best sellers, top sci-fi books, top science fiction books, best sci-fi fantasy books, genetic engineering science fiction series, best science fiction novels, genetic engineering, space colony, space colonization, space opera, apocalypse, post-apocalyptic, generation ship, end of the world, space battle, space explorer",
        "category": "Comics",
        "format": "Ebook",
        "length": "Long Read",
        "published_date": 2004,
        "thumbnail": "http://books.google.com/books/content?id=c_DmCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Invisible Kingdom Library Edition",
        "author": "G. Willow Wilson",
        "description": "The sweeping, multi-Eisner-Award winning and Hugo nominated sci-fi epic is collected in an oversized hardcover edition! This special library edition features every cover, extensive process art section, and the original pitch of this thrilling tour-de-force! In a distant galaxy, acolyte Vess and hardened freighter pilot Grix join forces to expose an inconceivable conspiracy between the most dominant religion and an all-powerful mega-corporation. Suddenly prey in an interstellar chase through the dreaded Junk Rings to The Point of No Return, this unexpected pair is faced with a grave decision: reveal the truth or plunge the world into anarchy. And when the valiant crew of the Sundog is captured by the dangerous Siblings of Rebirth, Vess and Grix must fight to save not only the universe, but also their newfound love—against all odds. Praise for Invisible Kingdom: \"Sharp, funny, and utterly breathtaking, Wilson and Ward's Invisible Kingdom is a world you won't want to leave.\"—Kelly Sue DeConnick (Pretty Deadly, Captain Marvel) \"Invisible Kingdom is the comic I didn't know I wanted and now can't live without. It's a vitamin boost for the eyes and mind, full of great vistas of ideas. Two master creators doing a barrel roll just outside our atmosphere. You want this book.\"—Gail Simone (Birds of Prey, Batgirl) \"G. Willow Wilson and Christian Ward are two of contemporary comics most visionary creators, and in Invisible Kingdom they are working together at the height of their powers to tell a stunningly relevant story with rip-roaring wisdom and mind-bending visuals. Highly recommended.\"—Saladin Ahmed (Ms Marvel, Black Bolt) \"Invisible Kingdom isn't just for science fiction fans; it's for readers who enjoy a fast-paced narrative that also pushes boundaries. Simultaneously up close and personal yet vast in scope. It's my kind of space opera.\"—Nnedi Okorafor (LaGuardia, The Binti Trilogy, Who Fears Death) \"A smart pop-art feminist Star Wars. Fans of science fiction epics... will want to strap in for the longer ride.\"—Publishers Weekly \"One of the most unique sci-fi comics since Saga& resonates in the present day.\"—Bleeding Cool \"A stunning and immersive world.\"—Sequential Planet \"Invisible Kingdom delivers spiritual sci-fi with spectacular visual style.\"—The A.V. Club",
        "category": "Comics",
        "format": "Ebook",
        "length": "Long Read",
        "published_date": 2009,
        "thumbnail": "http://books.google.com/books/content?id=BANjEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "L. Ron Hubbard Presents Writers of the Future Volume 39",
        "author": "L. Ron Hubbard",
        "description": "In the world of speculative fiction… Your favorite authors… Have selected best new voices of the year. 24 Award-winning Authors and Illustrators 3 Bonus Short Stories by Kevin J. Anderson • L. Ron Hubbard • S. M. Stirling Art and Writing Tips by Lazarus Chernik • L. Ron Hubbard • Kristine Kathryn Rusch Edited by Dean Wesley Smith • Jody Lynn Nye 16-page color gallery of artwork • Cover art by Tom Wood Check out the stories Brandon Sanderson, Orson Scott Card, Nnedi Okorafor, Robert J. Sawyer, Kevin J. Anderson, Jody Lynn Nye and others chose as the best of the best. Be amazed. Be amused. Be transported … by stories that take you by surprise and take you further and deeper into new worlds and new ideas than you’ve ever gone before…. Twelve captivating tales from the most exciting new voices in science fiction and fantasy accompanied by three from masters of the genre. A miracle? An omen? Or something else? One day, they arrived in droves—the foxes of the desert, the field, the imagination….—“Kitsune” by Devon Bohm When a vampire, a dragon and a shape-shifting Chihuahua meet on a beach in Key West, fireworks go off! But that’s just the background.—“Moonlight and Funk” by Marianne Xenos The Grim Reaper, trapped in an IRS agent’s dying body, must regain his powers before he dies and faces judgment for his original sin.—“Death and the Taxman” by David Hankins In a metaverse future, a woman who exposes falseness in others must decide what is real to her—the love she lost or the love she may have found.—“Under My Cypresses” by Jason Palmatier Vic Harden wasn’t lured by glory on a daring mission into the reaches of outer space—he was ordered out there by his editor.—“The Unwilling Hero” by L. Ron Hubbard Dangerous opportunities present themselves when an alien ship arrives in the solar system seeking repairs.—“White Elephant” by David K. Henrickson With her spaceship at the wrong end of a pirate’s guns, a former war hero must face down her enemies and demons to save Earth’s last best chance for peace.—“Piracy for Beginners” by J. R. Johnson Dan Shamble, Zombie P.I., faces one of his funniest and most perplexing cases ever—an enlightened ogre, a salamander with low self-esteem, and a raging fire dragon terrorizing the Unnatural Quarter!—“Fire in the Hole” by Kevin J. Anderson Years after the Second Holocaust, the last surviving Jews on earth attempt to rewrite the past.—“A Trickle in History” by Elaine Midcoh When I said I’d do anything to pay off my debts and get back home to Earth, I didn’t mean survey a derelict spaceship at the edge of the solar system—but here I am.—“The Withering Sky” by Arthur H. Manner High-powered telescopes bring galactic life to our TVs, and network tuner Hank Enos figures he’s seen everything—until the day an alien boy stares back.—“The Fall of Crodendra M.” by T. J. Knight Knights, damsels and dragons, curses and fates foretold—the stuff of legends and stories, but unexpectedly perverse.—“Constant Never” by S. M. Stirling Determined to save his wife, Tumelo takes an unlikely client through South Africa’s ruins to the heart of the Desolation—a journey that will cost or save everything.—“The Children of Desolation” by Spencer Sekulin When a terrorist smuggles a nuclear weapon into London, a team regresses in time to AD 1093 to assassinate a knight on the battlefield, thereby eliminating the terrorist a millennia before his birth.—“Timelines and Bloodlines” by L. H. Davis The Grand Exam, a gateway to power for one, likely death for all others—its entrants include ambitious nobles, desperate peasants, and Quiet Gate, an old woman with nothing left to lose.—“The Last History” by Samuel Parr You will love this collection of the best new voices in science fiction and fantasy because, as Locus magazine puts it, “Not only is the writing excellent...it is also extremely varied. There’s a lot of hot new talent.” Get it now.",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Long Read",
        "published_date": 2008,
        "thumbnail": "http://books.google.com/books/content?id=agGoEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Objective First Workbook Without Answers with Audio CD",
        "author": "Annette Capel",
        "description": "Third edition of the best-selling Cambridge English: First (FCE) course. The syllabus for this exam has changed and this book has now been replaced by 9781107628397 Objective First Fourth edition Workbook without answers with Audio CD.",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Long Read",
        "published_date": 2001,
        "thumbnail": "http://books.google.com/books/content?id=YUg5_Y4zH-IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Mutants and Mystics",
        "author": "Jeffrey J. Kripal",
        "description": "\"Account of how comic book heroes have helped their creators and fans alike explore and express a wealth of paranormal experiences ignored by mainstream science. Delving deeply into the work of major figures in the field - from Jack Kirby's cosmic superhero sagas and Philip K. Dick's futuristic head-trips to Alan Moore's sex magic and Whitley Strieber's communion with visitors - Kripal shows how creators turned to science fiction to convey the reality of the inexplicable and the paranormal they experienced in their lives. Expanded consciousness found its language in the metaphors of sci-fi - incredible powers, unprecedented mutations, time-loops and vast intergalactic intelligences - and the deeper influences of mythology and religion that these in turn drew from ; the wildly creative work that followed caught the imaginations of millions. Moving deftly from Cold War science and Fredric Wertham's anticomics crusade to gnostic revelation and alien abduction, Kripal spins out a hidden history of American culture, rich with mythical themes and shot through with an awareness that there are other realities far beyond our everyday understanding.\"--Jacket.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Long Read",
        "published_date": 2024,
        "thumbnail": "http://books.google.com/books/content?id=8kNjcn8KsuUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Zap!",
        "author": "Bryan Baugh",
        "description": "Star Wars, Star Trek, Alien, Predator, The Matrix - part of the appeal of great science fiction is its distinctive look. Now, withZap! How to Draw Fantastic Sci-Fi Comics,artists everywhere can learn to create their own sci-fi realities and to draw space heroes and heroines, intergalactic villains, robots, spaceships, blasting rockets, slimy aliens, and much more. A history of science-fiction comics is followed by an overview of the genre illustrated by the masters, including Alex Raymond (creator of Flash Gordon), Wally Wood (who shaped the look of 1950s sci-fi), and Basil Wolverton (whose bizarre art launched a thousand mid-century sci-fi stories). Then readers turn to Bryan Baugh’s clear, detailed step-by-step instruction on how to draw dynamic cosmic action figures plus all the futuristic technology they can dream up. Perfect for artists, fans, even writers,Zap! How to Draw Fantastic Sci-Fi Comicslets the art of the future spring from the art of the past.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Long Read",
        "published_date": 2011,
        "thumbnail": "http://books.google.com/books/content?id=0l4UID9J1uEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Legacy Code",
        "author": "Autumn Kalquist",
        "description": "A brutal conspiracy threatens humanity's survival. Three hundred years ago, the Earth died, and the last humans fled. Beaten. Broken in more ways than one. But there was something they couldn't leave behind: The Legacy Code—mangled genes that force them to abort half their unborn children. When Era and Dritan Corinth get placements on the safest ship in the fleet and win a chance to have a child, they feel lucky. Until the day Era's supposed to find out if her baby has the Defect, and the ship suffers a hull breach. An investigation uncovers new threats: Dangerous secrets. Lies. Treason. Era begins to question everything she’s been taught about the fleet, their search for a new Earth, and the Defect. But the answers she seeks were never meant to be found... Legacy Code is a suspenseful and dark genetic engineering science fiction series that has earned five star reviews from fans of some of the best sci-fi and fantasy books like Hunger Games, Divergent, and Red Rising, and has been compared favorably to Wool, 1984, and the new Battlestar Galactica. \"Addictive sci-fi series. I haven't been this hooked on an author since Anne McCaffery's Killashandra series.\" ~ Marie Hall, New York Times and USA Today Bestselling Author What Readers are Saying: “One of the best books I've ever read, I can't wait to read the rest of the series.” “Space, spaceships, planets, wormholes, dystopian, pregnancy, oh my! I thoroughly enjoyed Legacy Code. It was a quick read for me, as I found it hard to put down. After the first few chapters I was hooked & couldn't get enough… A great mix of SciFi & Dystopian! One of my top favourite reads for 2014.” “Compelling post-apocalyptic novel about survival: Wow. That was... astounding. I really enjoyed reading this… Living in space inside space ships? Holograms? Post-apocalypse? Heck, yeah!” “I cannot get enough of the Fractured Era series. It's the best sci-fi series I've read since The Post-Human series by David Simpson.” “…An uncertain future has the colonists on edge, leading to acts of terrorism and assassination attempts on government officials… There are several intriguing elements at play, most significantly, the mystery of the Legacy Code and whether it holds the key to humanity's survival…I'm looking forward to continuing the series to see where it goes from here.” “A couple of chapters in and I was already hooked! I ended up staying up til midnight (as a mother of a toddler this is a rare occasion) in order to finish it.” “I just finished this book...at 6:00 AM. This society crafted by Autumn Kalquist is fascinating. I can't even imagine how much time she spent carefully plotting every detail. Their existence feels so real and so frighteningly possible.” “It kind of had an initial feel of Battlestar Galactica -- a civilization that has to abandon their planet and go in search of a new one. …It had mystery, a bit of a thriller like aspect, humor, and a taste of romance.\" “I both love and hate this book...but in a good way! Instantly I fell in love with the characters and storyline that Kalquist spun together…This story is based in the future (almost a space opera / dystopian) where the populations of earth escaped to space to find a better world. ...we arrive in a distant future where civilization exists on space ships and they have to take decades before making jumps across space -similar in a way to what I imagine Stargate” “It pulled me in faster than most books I have read and kept me on the edge of my seat through the end. I read it all in just a few hours.\" keywords: free science fiction books, free sci fi books, free science fiction, free sci fi, free space books, free space opera books, free ebooks, fiction books free, sci fi books free, science fiction books free, free mystery books, genetic engineering, space colony, space colonization, space opera, apocalypse, post-apocalyptic, generation ship, end of the world, space battle, space explorer",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Short Read",
        "published_date": 2021,
        "thumbnail": "http://books.google.com/books/content?id=RS7OAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Blue Shift",
        "author": "Delia Strange",
        "description": "One novella, seven short stories and a duo of flash fiction SECOND LIFE: Brenda has lived in Dungoora for as long as she can remember, just like everyone else in the tiny outback town. She lives with an old man that could be her grandfather and with a young girl that could be her daughter. Except they're not. The secret that bonds the small community is both comforting and claustrophobic. Even in a town full of secrets, it's difficult to keep any of your own. FORTUNE: If you could see the future, would you look? AIR FIRE WATER EARTH: A four part story told in reverse. MECCA: A 'Femme' novel prequel. THE SONG: A tale from the depths of the Brisbane River. ...and many more tales of science fiction and speculation.",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Short Read",
        "published_date": 2022,
        "thumbnail": "http://books.google.com/books/content?id=OVrMrQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "The Disappeared",
        "author": "Kristine Kathryn Rusch",
        "description": "Three cases have collided for Miles Flint: a stolen spaceyacht filled with dead bodies, two kidnapped human children, and a human woman on the run, trying to Disappear to avoid alien prosecution. Flint must enforce the law, but how can he do the right thing in a universe where the right thing is very, very wrong?",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Short Read",
        "published_date": 2011,
        "thumbnail": "http://books.google.com/books/content?id=4AQmuQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "The Body Double",
        "author": "Emily Beyda",
        "description": "A dark, glittering debut novel echoing Hitchcock's Vertigo, The Body Double is the suspenseful story of a young woman who is recruited by a stranger to give up her old life and identity to impersonate a reclusive Hollywood star. A strange man discovers our nameless narrator selling popcorn at a decrepit small-town movie theater and offers her an odd and lucrative position: she will forget her job, her acquaintances, even her name, and move to Los Angeles, where she will become the body double of the famous and troubled celebrity Rosanna Feld. A nervous breakdown has forced Rosanna out of the public eye, and she needs a look-alike to take her place in the tabloid media circus of Hollywood. Overseen by Max, who hired her for the job, our narrator spends her days locked up in a small apartment in the hills watching hidden camera footage of Rosanna, wearing Rosanna's clothes, eating the food Rosanna likes, practicing her mannerisms, learning to become Rosanna in every way. But as she makes her public debut as Rosanna, alarming questions begin to arise. What really caused Rosanna's mental collapse? Will she ever return? And is Max truly her ally, or something more sinister?",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Short Read",
        "published_date": 2022,
        "thumbnail": "http://books.google.com/books/content?id=oigvEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Science Fiction Universe and Beyond",
        "author": "Michael Mallory",
        "description": "Travel where no man has gone before with this decade-by-decade progression of science-fiction classics. From the classic, low-budget space exploration Flash Gordon tales of the Saturday matinee serials, to the slick CGI-realized world of The Matrix, science-fiction films have long been pushing the boundaries of the visually and dramatically fantastic—turning the known world on its head, playing with the laws of physics, and all the while holding their audience spellbound. The Science Fiction Universe . . . and Beyond offers a breadth of knowledge, insight, and passion to a century of close encounters, black holes, time travel, distant planets, impossible quests, nuclear war, futuristic technology, inexplicable forces, spaceships, extraordinary monsters, and subterranean societies. Arranged chronologically, showing the progression of sci-fi over the decades, and delving into interesting back stories and trivia, this volume includes a variety of classic films and television shows, such as The Day the Earth Stood Still (1951), Invasion of the Body Snatchers (1956), The Twilight Zone (1959–1964), Doctor Who (1963–1989), 2001: A Space Odyssey (1968), A Clockwork Orange (1971), Star Wars, Episode IV—A New Hope (1977), Alien (1979), E.T.: The Extra-Terrestrial (1982), Star Trek: The Next Generation (1987–1994), Terminator 2: Judgment Day (1991), Stargate SG-1 (1997–2007), Battlestar Galactica (2004–2009), and many others.",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Short Read",
        "published_date": 2016,
        "thumbnail": "http://books.google.com/books/content?id=72CwoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Motel of the Mysteries",
        "author": "David Macaulay",
        "description": "It is the year 4022; all of the ancient country of Usa has been buried under many feet of detritus from a catastrophe that occurred back in 1985. Imagine, then, the excitement that Howard Carson, an amateur archeologist at best, experienced when in crossing the perimeter of an abandoned excavation site he felt the ground give way beneath him and found himself at the bottom of a shaft, which, judging from the DO NOT DISTURB sign hanging from an archaic doorknob, was clearly the entrance to a still-sealed burial chamber. Carson's incredible discoveries, including the remains of two bodies, one of then on a ceremonial bed facing an altar that appeared to be a means of communicating with the Gods and the other lying in a porcelain sarcophagus in the Inner Chamber, permitted him to piece together the whole fabric of that extraordinary civilization.",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Short Read",
        "published_date": 2018,
        "thumbnail": "http://books.google.com/books/content?id=aiDKBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Avram Davidson Science Fiction & Fantasy MEGAPACK®",
        "author": "Avram Davidson",
        "description": "Avram Davidson (1923-1993) was an American writer of fantasy fiction, science fiction, and crime fiction, as well as the author of many stories that do not fit into a genre niche. He won a Hugo Award and three World Fantasy Awards in the science fiction and fantasy genre, a World Fantasy Life Achievement award, plus an Ellery Queen's Mystery Magazine short story award and an Edgar Award in the mystery genre. This volume assembled 20 of his classic works. Included: WHAT STRANGE STARS AND SKIES THE UNKNOWN LAW THE TEETH OF DESPAIR THE SINGULAR EVENTS WHICH OCCURRED IN THE HOVEL ON THE ALLEY OFF OF EYE STREET THE LINEAMENTS OF GRATIFIED DESIRE THE GOLEM THE COST OF KENT CASTWELL THE BOUNTY HUNTER PRESENT FOR LONA NOW LET US SLEEP NOW LET US SLEEP MR. STILWELL'S STAGE MISS BUTTERMOUTH LOVE CALLED THIS THING JURY-RIG I DID NOT HEAR YOU, SIR FAIR TRADE FAED-OUT DEATH OF A DAMNED GOOD MAN WHERE DO YOU LIVE, QUEEN ESTHER? ADVENTURES IN UNHISTORY: WHO FIRED THE PHOENIX? If you enjoy this ebook, don't forget to search your favorite ebook store for \"Wildside Press Megapack\" to see more of the 290+ volumes in this series, covering adventure, historical fiction, mysteries, westerns, ghost stories, science fiction -- and much, much more!",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Standard Length",
        "published_date": 2021,
        "thumbnail": "http://books.google.com/books/content?id=_uzTCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The 28th Golden Age of Science Fiction MEGAPACK ®: Edward Wellen (Vol. 2)",
        "author": "Edward Wellen",
        "description": "Edward Paul Wellen (1919-2011) wrote primarily short stories throughout his long career, primarily in both the mystery field, but also (especially early in his career) in science fiction magazines. This is the second collection of his science fiction stories we have published, and it’s another good one. Included are: ORIGINS OF GALACTIC LAW THE BIG CHEESE ROOT OF EVIL THE VOICES THE WORLD IN THE JUKE BOX THE SUPERSTITION SEEDERS THE ENGRAMMAR AGE UTTER SILENCE ARMY WITHOUT BANNERS SWEET DREAMS DR. VICKERS' CAR NOTE FOR A TIME CAPSULE OLD HAT IOU DEADLY GAME If you enjoy this volume of classic mysteries, don't forget to search your favorite ebook store for \"Wildside Press Megapack\" to see the 270+ other entries in this series, including science fiction, fantasy, mysteries, adventure, horror, westerns -- and much, much more!",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Standard Length",
        "published_date": 1981,
        "thumbnail": "http://books.google.com/books/content?id=8kQhCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Great North Road",
        "author": "Peter F. Hamilton",
        "description": "NAMED ONE OF THE BEST BOOKS OF THE YEAR BY PUBLISHERS WEEKLY New York Times bestselling author Peter F. Hamilton’s riveting new thriller combines the nail-biting suspense of a serial-killer investigation with clear-eyed scientific and social extrapolation to create a future that seems not merely plausible but inevitable. A century from now, thanks to a technology allowing instantaneous travel across light-years, humanity has solved its energy shortages, cleaned up the environment, and created far-flung colony worlds. The keys to this empire belong to the powerful North family—composed of successive generations of clones. Yet these clones are not identical. For one thing, genetic errors have crept in with each generation. For another, the original three clone “brothers” have gone their separate ways, and the branches of the family are now friendly rivals more than allies. Or maybe not so friendly. At least that’s what the murder of a North clone in the English city of Newcastle suggests to Detective Sidney Hurst. Sid is a solid investigator who’d like nothing better than to hand off this hot potato of a case. The way he figures it, whether he solves the crime or not, he’ll make enough enemies to ruin his career. Yet Sid’s case is about to take an unexpected turn: because the circumstances of the murder bear an uncanny resemblance to a killing that took place years ago on the planet St. Libra, where a North clone and his entire household were slaughtered in cold blood. The convicted slayer, Angela Tramelo, has always claimed her innocence. And now it seems she may have been right. Because only the St. Libra killer could have committed the Newcastle crime. Problem is, Angela also claims that the murderer was an alien monster. Now Sid must navigate through a Byzantine minefield of competing interests within the police department and the world’s political and economic elite . . . all the while hunting down a brutal killer poised to strike again. And on St. Libra, Angela, newly released from prison, joins a mission to hunt down the elusive alien, only to learn that the line between hunter and hunted is a thin one. BONUS: This edition includes an excerpt from Peter F. Hamilton’s The Abyss Beyond Dreams. Praise for Great North Road “A mesmerizing page-turner.”—Publishers Weekly (starred review) “A gripping saga that blends wilderness survival, police procedural, political and social intrigue, and dynastic sf into a mammoth tale featuring believable characters and exceptionally skilled storytelling.”—Library Journal (starred review) “A perfect introduction to [Hamilton’s] gifts for character design, dialogue, and sheer, big-idea-driven storytelling.”—Booklist (starred review) “Compelling and original . . . an awesome novel [with] plenty of action.”—SFRevu “One very compelling and entertaining science fiction novel.”—SF Site “Simply brilliant . . . an astonishing achievement.”—Tor.com",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_date": 2019,
        "thumbnail": "http://books.google.com/books/content?id=HFJYRWxLXUMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Outer Spheres",
        "author": "Andrew Wallace",
        "description": "How can such a bright future be so full of darkness? Beautiful young Charity Freestone has it all: the love of a good man, the revelation of her remarkable identity, and her family reunited after their spectacular battle with the Sons of the Crystal Mind. However, at her moment of triumph Charity is tricked into joining the mysterious New Form Enterprise, whose harsh regime seems designed to break her. Before she can learn their strange purpose, a shocking betrayal brings unique and terrifying freedom. Cut off from its advanced technology, Charity is hunted through war-torn, subterranean Diamond City by an enemy who is always closer than she thinks. As she struggles to make sense of her inhumanly ruthless pursuers, Charity must confront her own complicity in the nightmare that engulfs her. And when she does, she discovers there are far worse places than the dreaded Outer Spheres. Book Two of Andrew Wallace’s viscerally thrilling Diamond Roads science fiction series, The Outer Spheres takes extraordinary heroine Charity Freestone into even stranger and more disturbing territory. The novel threads bleeding-edge science through a fearsomely-wrought war story to explore the unimaginable outcomes of our most terrifying decisions. Blending the vast and eerie scale of Peter F Hamilton’s The Reality Dysfunction with the originality and political insight of Anne Leckie’s Ancilliary Justice, The Outer Spheres forges a unique vision of fear and wonder. Diamond Roads is fast becoming a whole new mythology, exploring the way things are against a wildly-imagined backdrop of how they might turn out. To see if Charity survives, and whether she can be truly free of her pursuers and her own demons, buy the book now. Praise for Diamond Roads: Andrew Wallace shows a real talent for world building in this well-written, fast-paced debut novel. From the first page, Diamond Roads is packed with sci-fi smarts. I’m looking forward to reading more from this author – Anne Charnock, winner of the Clarke Award for Dreams Before the Start of Time & the BSFA Award for The Enclave Fast-paced, clever and beautifully written, Diamond Roads is a richly imagined dystopian thriller that introduces the latest in a long line of cool, kick-ass SF heroines. Charity Freestone combines the strength of Ripley with the wiles of Katniss and the vulnerability of Halo Jones. If you liked Wool, you'll love this – Mark Edwards, bestselling author of The Magpies & Follow You Home I loved this smart, continually surprising thriller set in a richly drawn world – Simon Guerrier, author of Doctor Who: The Pirate Loop; Primeval: Fire & Water & Being Human: The Road",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_date": 2013,
        "thumbnail": "http://books.google.com/books/content?id=d4vmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Mammoth Book of Extreme Science Fiction",
        "author": "Mike Ashley",
        "description": "Here are 25 stories of science fiction that push the envelope, by the biggest names in an emerging new crop of high-tech futuristic SF - including Charles Stross, Robert Reed, Alastair Reynolds, Peter Hamilton and Neal Asher. High-tech SF has made a significant comeback in the last decade, as bestselling authors successfully blend the super-science of 'hard science fiction' with real characters in an understandable scenario. It is perhaps a reflection of how technologically controlled our world is that readers increasingly look for science fiction that considers the fates of mankind as a result of increasing scientific domination. This anthology brings together the most extreme examples of the new high-tech, far-future science fiction, pushing the limits way beyond normal boundaries. The stories include: \"A Perpetual War Fought Within a Cosmic String\", \"A Weapon That Could Destroy the Universe\", \"A Machine That Detects Alternate Worlds and Creates a Choice of Christs\", \"An Immortal Dead Man Sent To The End of the Universe\", \"Murder in Virtual Reality\", \"A Spaceship So Large That There is An Entire Planetary System Within It\", and \"An Analytical Engine At The End of Time\", and \"Encountering the Untouchable.\"",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Standard Length",
        "published_date": 2024,
        "thumbnail": "http://books.google.com/books/content?id=_mHBBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Widowland",
        "author": "C. J. Carey",
        "description": "2023 Philip K. Dick Award Nominee \"A compulsive, terrifying read.\"—Kate Quinn, New York Times bestselling author of The Rose Code For readers of Margaret Atwood's The Handmaid's Tale comes a thrilling feminist dystopian novel set in an alternative history that terrifyingly imagines what a British alliance with Germany would look like if the Nazis had won WWII. To control the past, they edited history. To control the future, they edited literature. LONDON, 1953. Thirteen years have passed since England surrendered to the Nazis and formed a Grand Alliance with Germany. It was forced to adopt many of its oppressive ideologies, one of which was the strict classification of women into hierarchical groups based on the perceived value they brought to society. Rose Ransom, a member of the privileged Geli class, remembers life from before the war but knows better than to let it show. She works for the Ministry of Culture, rewriting the classics of English literature to ensure there are no subversive thoughts that will give women any ideas. Outbreaks of insurgency have been seen across the country with graffiti made up of seditious lines from forbidden works by women painted on public buildings. Suspicion has fallen on Widowland, the run-down slums where childless women over fifty have been banished. Rose is given the dangerous task of infiltrating Widowland to find the source of the rebellion before the Leader arrives in England for the Coronation ceremony of King Edward VIII and Queen Wallis. Will Rose follow her instructions and uncover the criminals? Or will she fight for what she knows in her heart is right? Praise for Widowland: \"A mind-bender of a novel about the power of literature to change minds. I loved it!\" —Mark Sullivan, bestselling author of The Last Green Valley and Beneath a Scarlet Sky \"I rarely come across a book I can't put down but I devoured this one.\" —Rhys Bowen, New York Times bestselling author of two historical mystery series as well as several internationally bestselling historical novels \"An electrifying, Orwellian dystopia with a thrilling feminist twist.\" —Lara Prescott, New York Times bestselling author of The Secrets We Kept \"Tense, thought-provoking, and terrifying.\" —Natalie Jenner, international bestselling author of The Jane Austen Society and Bloomsbury Girls",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Standard Length",
        "published_date": 2003,
        "thumbnail": "http://books.google.com/books/content?id=gGpMEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Clash of Flesh and Metal",
        "author": "Alicia Ellis",
        "description": "She must obey a stranger's orders, or the androids will attack again… Despite Lena's fears about the dangers of the Model One androids, CyberCorp has shipped them to customers. They work perfectly—except around Lena. When an android attacks one of her best friends, she insists the robots are fatally flawed. Desperate to keep this situation from spiraling out of control, like it did last time, Lena casts suspicion on everyone she knows. This time, she won't trust anyone. When she gets a threatening note from someone claiming to be controlling the androids, she'll obey—but only to stall for time. Can she find whoever's responsible, before someone else she loves dies?",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Long Read",
        "published_date": 2019,
        "thumbnail": "http://books.google.com/books/content?id=IwnfEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Murder on the Intergalactic Railway",
        "author": "Kate MacLeod",
        "description": "For Murdina Ritchie, acceptance at the Oymyakon Foreign Service Academy means one last chance at her dream of becoming a diplomat for the Union of Free Worlds. For Shackleton Fitz IV, it represents his last chance not to fail out of military service entirely. Strange that fate should throw them together now, among the last group of students admitted after the start of the semester. They had once shared the strongest of friendships. But that all ended a long time ago. But when an insufferable but politically important woman turns up murdered, the two agree to put their differences aside and work together to solve the case. Because the murderer might strike again. But more importantly, solving a murder would just have to impress the dour colonel who clearly thinks neither of them belong at his academy. This is book 1 in the complete six-book THE RITCHIE AND FITZ SCI-FI MURDER MYSTERY series.",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Long Read",
        "published_date": 2023,
        "thumbnail": "http://books.google.com/books/content?id=gXG1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Disappeared",
        "author": "Kristine Kathryn Rusch",
        "description": "Three cases have collided for Miles Flint: a stolen spaceyacht filled with dead bodies, two kidnapped human children, and a human woman on the run, trying to Disappear to avoid alien prosecution. Flint must enforce the law, but how can he do the right thing in a universe where the right thing is very, very wrong?",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Long Read",
        "published_date": 2024,
        "thumbnail": "http://books.google.com/books/content?id=4AQmuQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "The Limit",
        "author": "Kristen Landon",
        "description": "When his family exceeds its legal debt limit, thirteen-year-old Matt is sent to the Federal Debt Rehabilitation Agency workhouse, where he discovers illicit activities are being carried out using the children who have been placed there.",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Long Read",
        "published_date": 2006,
        "thumbnail": "http://books.google.com/books/content?id=QDN3wZfQFSwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Fires of Invention",
        "author": "Jeffrey Scott Savage",
        "description": "Even though technology and inventions have been outlawed in the mountain city of Cove, in order to save the city Trenton and Kallista must follow a set of mysterious blueprints to build a creature to protect them from the dragons outside their door.",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Long Read",
        "published_date": 2012,
        "thumbnail": "http://books.google.com/books/content?id=dI7iswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Paragon",
        "author": "Autumn Kalquist",
        "description": "Tadeo Raines knows what they say about him. It’s all lies. But lies are better than the truth. He broke the rules once and swore he’d never do it again. Now traitors plot against the fleet, and he's tasked with hunting them down and stopping them. Permanently. Tadeo was born to command, born to lead the last remnants of humanity to a new Earth. He knows there’s a better world out there: Daylight at the end of humanity's long night. And he's willing to do whatever it takes to get the fleet there. Even if it means walking the line between loyalty and treason. And breaking the rules... Again. Legacy Code is a suspenseful and dark genetic engineering science fiction series that has earned five star reviews from fans of some of the best sci-fi and fantasy books like Hunger Games, Divergent, and Red Rising, and has been compared favorably to Wool, 1984, and the new Battlestar Galactica. What readers are saying: If you like mysteries and/or sci-fi you will love this book!!! \"This is a very good story that has your heart pounding as you turn the pages. Intrigue, nefarious plots, twists and turns around every corner - great series, even if you're not a fan of science fiction.\" \"From the moment I read the first paragraph of Paragon, up until the last sentence, I was enthralled. Non-stop, on edge, exciting action. I honestly couldn't put a fault on this one, I loved all of it, including the song! The Fractured Era series is still up there amongst my favourite novels of the year.\" \"Full of questions, traitors galore, secrets & suspicions. You can't even trust your own family in this world!\" Phenomenal...that's the best word to describe it. Autumn Kalquist manages to weave a tale that is jam packed with suspense and whodunit plots. Just loved it with it many twists and turns that keeps you on your toes. The characters were great and you just didn't know who to trust in the conspiracy that was going on. ...Highly recommended series and anxious to read the next book. I love all of this author's books. I have read many post-apocalyptic and dystopian tales and this is different from all the rest. She always keeps me guessing. My only complaint is she doesn’t write them fast enough!! I believe this is the first 5 star rating I've ever given. LOVED IT! Such a great follow up to Legacy Code (which ended up on my Top Ten 2014 list) I love Autumn's writing style, she is so talented and takes you right there alongside the characters. This is a beautiful and unique story and I can't wait to read more!! \"In a story where I fell in love with the characters, it is easy to have your heart broken, have a smile on your face, or cry over a simple scene in the book. This is one series I would never stop reading, and admittedly, have read on more than one occasion!\" \"This series has me intrigued, it feels realistic, real and frightening at the same time. Humanity is alone in space in their fleet of ships and they have nowhere to go, they try to find a better earth, a new home. I want to know if they ever find it.\" keywords: science fiction best sellers, top sci-fi books, top science fiction books, best sci-fi fantasy books, genetic engineering science fiction series, best science fiction novels, genetic engineering, space colony, space colonization, space opera, apocalypse, post-apocalyptic, generation ship, end of the world, space battle, space explorer",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Long Read",
        "published_date": 2021,
        "thumbnail": "http://books.google.com/books/content?id=c_DmCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Ferandan",
        "author": "Mark Grisham",
        "description": "Haldan explores the piles of junk that cover the entire surface of Ferandan. There he seeks answers, but finds himself in great danger under the cool red sun. His adventures with the enigmatic dwellers in the waste lead him to understand that not everything is as it seems at the recycling factory where his father works.",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Short Read",
        "published_date": 2016,
        "thumbnail": "http://books.google.com/books/content?id=UYXpoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "A Matter of Matter",
        "author": "L. Ron Hubbard",
        "description": "Chuck Lambert toils for 11 grueling years to scrape together enough money to finally buy a planet of his own. Rather than purchase on legally from the Interior Department of the Outer Galactic Control, he succumbs to the flashy advertising of a galactic swindler named Madman Murphy.",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Short Read",
        "published_date": 2021,
        "thumbnail": "http://books.google.com/books/content?id=lyrm5fJSrSkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Poor Man's Fight",
        "author": "Elliott Kay",
        "description": "High school senior Tanner Malone has bombed the Test, a high-stakes exam that establishes how much he owes for his corporate-funded education. Burdened by a crushing debt that rules out college, Tanner enlists in the navy of Archangel, a star system with four terraformed worlds. But he hasn't factored in the space pirates. Just as Tanner begins basic training, the government ramps up its forces to confront a band of rowdy raiders who are wreaking havoc in the void. Led by complex and charismatic Captain Casey, the outlaws love a little murder and mayhem, but they are also democratic, egalitarian, and devoted to freeing each new recruit from debt and corporate oppression. Assigned to the front lines, Tanner soon finds himself caught in the crossfire between ruthless foes, cruel comrades, and unforgiving space. Can he do his duty when good and evil look so much alike?",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Short Read",
        "published_date": 2018,
        "thumbnail": "http://books.google.com/books/content?id=iUM4rgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "The Black Sultan",
        "author": "L. Ron Hubbard",
        "description": "Meet Eddie Moran, a slightly disreputable American cooling his heels in French Morocco. And don’t be surprised if the young Cary Grant comes to mind, because Eddie’s as smooth as they come, one step ahead of the game...and of the police. Who’s after him? Just about everybody. What’s he done? A bit of everything—smuggler, revolutionary, whatever crooked little scheme will pay for his next meal or next drink. But Eddie’s latest caper is one he may not be able to escape...even if he wants to. Stumbling into a fight between a couple of Berber chieftains, Eddie lands in a prison run by The Black Sultan. He may be a captive of the Sultan, but he’s captivated by a stunning young woman the Sultan means to add to his harem. For her, Eddie might just go straight—if he can get them out of this hellhole alive. When The Black Sultan was originally published, Hubbard said that writers too often “forget a great deal of the languorous quality which made the Arabian Nights so pleasing. Jewels, beautiful women, towering cities filled with mysterious shadows, sultans equally handy with robes of honor and the beheading sword.... These things still exist, undimmed, losing no luster to the permeating Occidental flavor which reaches even the far corners of the earth today.” Hubbard brings this unique insight to his stories of North Africa and the Legionnaires, investing them with an authenticity of time, place and character that kept his readers asking for more. Also includes the adventure story, “Escape for Three,” in which a bold trio of French Legionnaires come to the rescue of their great leader—only to decide he may not be so great after all. “Action, strong characters, suspense, snappy dialogue, and titillating romance.” —Publishers Weekly",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Short Read",
        "published_date": 2024,
        "thumbnail": "http://books.google.com/books/content?id=G3IDceCeO4oC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Widowland",
        "author": "C. J. Carey",
        "description": "2023 Philip K. Dick Award Nominee \"A compulsive, terrifying read.\"—Kate Quinn, New York Times bestselling author of The Rose Code For readers of Margaret Atwood's The Handmaid's Tale comes a thrilling feminist dystopian novel set in an alternative history that terrifyingly imagines what a British alliance with Germany would look like if the Nazis had won WWII. To control the past, they edited history. To control the future, they edited literature. LONDON, 1953. Thirteen years have passed since England surrendered to the Nazis and formed a Grand Alliance with Germany. It was forced to adopt many of its oppressive ideologies, one of which was the strict classification of women into hierarchical groups based on the perceived value they brought to society. Rose Ransom, a member of the privileged Geli class, remembers life from before the war but knows better than to let it show. She works for the Ministry of Culture, rewriting the classics of English literature to ensure there are no subversive thoughts that will give women any ideas. Outbreaks of insurgency have been seen across the country with graffiti made up of seditious lines from forbidden works by women painted on public buildings. Suspicion has fallen on Widowland, the run-down slums where childless women over fifty have been banished. Rose is given the dangerous task of infiltrating Widowland to find the source of the rebellion before the Leader arrives in England for the Coronation ceremony of King Edward VIII and Queen Wallis. Will Rose follow her instructions and uncover the criminals? Or will she fight for what she knows in her heart is right? Praise for Widowland: \"A mind-bender of a novel about the power of literature to change minds. I loved it!\" —Mark Sullivan, bestselling author of The Last Green Valley and Beneath a Scarlet Sky \"I rarely come across a book I can't put down but I devoured this one.\" —Rhys Bowen, New York Times bestselling author of two historical mystery series as well as several internationally bestselling historical novels \"An electrifying, Orwellian dystopia with a thrilling feminist twist.\" —Lara Prescott, New York Times bestselling author of The Secrets We Kept \"Tense, thought-provoking, and terrifying.\" —Natalie Jenner, international bestselling author of The Jane Austen Society and Bloomsbury Girls",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Short Read",
        "published_date": 2003,
        "thumbnail": "http://books.google.com/books/content?id=gGpMEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Contract of Defiance: Spectras Arise Trilogy, Book 1",
        "author": "Tammy Salyer",
        "description": "WHEN ALL OTHER OPTIONS RUN OUT, NEVER LET GO OF YOUR GUN. In a few hundred years, the Algol system becomes humanity's new home. The question is: is it a better one? When a crew of arms smugglers botches their latest job, Corps-deserter and crewmember, Aly Erikson, is separated from her brother, the only person she can trust, and left behind to fight for her life. In the aftermath, as she tries to piece together what happened, a crew of roughneck settlers pressgang her into a dangerous mission in the heart of Corps territory. Time is running out to get back everything she's lost… Her crew, her brother, and her options. But no one is taking her gun. Winner of the 2010 Rocky Mountain Fiction Writers Colorado Gold Contest for best action/thriller. Finalist in the Kindle Book Review 2012 Best Indie Book Contest for science fiction/fantasy. What people saying about the Spectras Arise Series “A fast-paced and fun sci-fi space adventure with a great protagonist… starts with a running gun fight and doesn't let up until the explosive conclusion.” “Top Notch SciFi Read!” “I'm torn between wanting to savor every exciting moment of this gorgeously written series or binge-read to find out what happens next.” “Thrilling, Roller-Coaster Ride of Military Sci-Fi Adventure” “Contains the kind of action that makes it hard to turn off the light and go to sleep.” Other books in the Spectras Arise series Conviction: A Spectras Arise Prequel Novella Contract of Defiance: Spectras Arise Trilogy, Book 1 Contract of Betrayal, Spectras Arise Trilogy, Book 2 Contract of War, Spectras Arise Trilogy, Book 3 The Spectras Arise Series Omnibus, including all four books Fans of the following authors may also enjoy this science fiction series: Aaron Dembski Bowden, Adrian Tchaikovsky, Ann Leckie, Anna Hackett, Anthony J.Melchiorri, Arthur C Clarke, B. V. Larson, Carlos R. Tkacz, Craig A. Falconer, Craig Alanson, Craig Martelle, Dan Simmons, Dennis E. Taylor, Douglas E. Richards, Eric Vall, Ernest Cline, Evan Currie, G.S. Jennsen, Gav Thorpe, George Mann, Ian St Martin, Ian Watson, Isaac Asimov, Isaac Hooke, James Corey, Jay Allan, Jessie Mihalik, Joe Haldeman, John Conroe, John Ringo, Jonathan Yanez, Joseph Lallo, Josh Hayes, Josh Reynolds, Joshua Dalzelle, Kris Longknife, Larry Niven, Lindsay Buroker, Martin L. Shoemaker, Mike Resnick, Neil Clarke, Nicholas Sansbury Smith, Nick Webb, Ray Bradbury, Richard Heinlein, Rick Partlow, S. H. Jucha, Samuel Delany, Scott Moon, Vaughn Hepner, Vicky Peterwald Fans of the following books and series may also enjoy this science fiction series: A Call To Arms, A Call To Vengeance, A Rising Thunder, A Trick Of Light, Across The Galactic Pond, Agent To The Stars, Albion Lost, Alliance, Archangel One, Ashes Of Victory, At All Costs, Aurora Blazing, Aurora Renegades, Aurora Rising, Big Sigma, Broken Worlds, Chaos Space Marines, Children Of Time, Clone World, Come Tumbling Down, Count Zero, Cursed Stars, Cygnus Space Opera, Dark Age, Dark Space, Dropship, Earth Fall, Echoes Of Honor, Edge Of Valor, Extinction Shadow, Field Of Dishonor, Flag In Exile, Flight Of The Reaper, Forever Gate, Forever War, Foundation And Earth, Foundation's Edge, Fracture Spacers, Fractured Empire Complete Cadicle Series, Free Trader, Fuzzy Nation, Galactic Vanguard, Galactic War, Gateway To War, Genome, Ghost Fleet, Head On, Helsreach (Space Marine Battles), Hero Code, Honor Among Enemies, Honor Harrington Universe, Hyperion, Imperial Sunset, Imperial Twilight, In Enemy Hands, Infinity Born, Interdependency, Interstellar Warspike Chronicles, Iron Wolves, Judge Jury, Jumper, Kiss Of Eon, Land Of Wolves, Leviathan Wakes, Lock In, Lucky's Marines, Mission Critical, Mission Of Honor, Monster Hunter Guardian, Nemesis, New Frontiers, Odysseus Ascendant Spacers, Odysseus Awakening Spacers, Old Man's War, Omega Force, On Basilisk Station, Primaris Space Marines, Primordial Threat, Recon, Redshirts, Refuge Spacers, Renegade Atlas, Renegade Descent, Renegade Fleet, Renegade Lost, Renegade Moon, Renegade Rising, Renegade Star, Resonant Abyss, Resonant Son, Resurgence, River Of Night, Ruins of the Galaxy, Salvation, Salvation Lost, Shadow Of Freedom, Shadow Of Victory, Shield Of Terra, Ship Of Ruin, Shockwave, Shots Fired, Smoke Bitten, Solar War, Space Marine Conquests, Space Marine Legends, Spacers, Star Force, Star Kingdom, Star Trek Books, Star Forged, Starshine, Stranger In A Strange Land, Summer Frost, Superdreadnought, Terradox Quadrilogy, Terran Scout Fleet 1, The Android's Dream, The Caves Of Steel, The Collapsing Empire, The Consuming Fire, The End Of All Things, The Eon Series, The Expanding Universe, The Fifth Column, The Free Trader Of Planet Vii, The Free Trader Of Warren Deep, The Genesis Fleet, The Ghost Brigades, The Gordian Protocol, The Hidden Ship, The Honor Of The Queen, The Human Division, The Last Colony, The Last Dance, The Last Emperox, The Last Stand, The Lost Colony, The Lost Starship, The Orbs Series, The Originator Wars, The Robots Of Dawn, The Sagan Diary, The Short Victorious War, The Slaver Wars, The Star Cross, The Void Within, Though Hell Should Bar The Way, Through Fiery Trials, Tiamat's Wrath, To Clear Away The Shadows, Tomorrow Factory, Uncompromising Honor, Undying Mercenaries Series, Unlocked, Vanquish, Vigilance Spacers, War Of Honor, Wastelands, We Are Legion, Winds Of Wrath, Wings Of The Reaper, Winter World, Wrath Of The Reaper, Zoe's Tale, Zone War Keywords related to this science fiction series: Ace, Action Adventure, Action Adventure Books, Action Books, Adventure, Angry Robot, Baen, Daw, Del Rey, Essential Reads, Female Action Adventure, Female Adventure Books, Female Space Marines, Fleet, Futuristic Weapons, Galactic Empire, Galactic Liberation, Galactic Vanguard, Galactic War, Genetic Engineering, Heroine, Hugo, Hugo Award, Military Science Fiction, Military Science Fiction Action Adventure, Military Science Fiction Books, Military Science Fiction Series, Msf Books, Nebula, Nebula Award, New Wave Sf, Outcast Marines, Popular Series, Republic, Science Fiction, Science Fiction Action Adventure, Science Fiction Series, Smuggler, Soldier, Space Flight, Space Marine, Space Opera, Space Warfare, Spaceship, Starship, Strong Female Character, Subterranean Press, Top Rated Books, Tor Omnibus Set, Omnibus Collection, Omnibus Bundle, Science Fiction Omnibus, Science Fiction Bundle, Science Fiction Box Sets, Science Fiction Box Set, Collections & Anthologies, Boxed Set, Best Rated Science Fiction Omnibus",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Short Read",
        "published_date": 2013,
        "thumbnail": "http://books.google.com/books/content?id=Lwz2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Spark Anomaly",
        "author": "Jeffrey Freedman",
        "description": "\"What happens when 2 earthquakes occur 42 minutes apart in Chile & China?\" Answer: The end of the world As Arnold Spark, drives his rescue vehicle across the magma lake toward the destroyed volcanic generator's intake pipe, he wonders if his design is to blame for the catastrophe. Spark searches the globe for the truth aided by: Soona, a lonely robot living on the moon, who must escape her cruel human captors to search for answers on the comet Charybdis; Helen, a bereaved widow, who blames Spark for her husband's death; And Cathy, a shy college student who is oblivious to Spark's quest, but solves his disguised homework problems unaware her brilliant solutions are the key to saving humanity The Spark Anomaly is a thrilling Sci-Fi adventure novel set in a 2067 utopia with a hidden dark side. You will enter an amazing world of future technologies and believable advances in modern physics. \"...Indiana Jones [style] solid sci fi with characters we relate to and care about... Cathy and the housekeeping robots made me laugh out loud.\" - Star Trek novelist Margaret W Bonanno",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Standard Length",
        "published_date": 2010,
        "thumbnail": "http://books.google.com/books/content?id=KHjUygEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Clarity's Dawn",
        "author": "A.R. Knight",
        "description": "To survive on an alien world, Kaishi must decide whether to trust the creature inside her mind, or reject it and risk everything to fight for her freedom. Ignos lied. The alien promised to take Kaishi and her friends back to Earth, to home. Instead, Ignos has brought them to its own world, teeming with other parasites that see the humans as hosts, and a potential gateway to their own survival. The Sevora make an offer to Kaishi: join with them, take their technology, and forge a new destiny for both species together. With the Sevora, of course, controlling their human hosts. Across the stars, Sax escapes the crumbling space station and finds himself at odds with his own race and galactic law. Picked up by salvagers who see him as a valuable piece of living scrap, Sax must learn how to live outside the structure that gave him his power, even while he tries to find a way to bring it down. Clarity’s Dawn is the third book in The Skyward Saga, a sci-fi adventure series spanning alien worlds, unique technologies, and colorful characters scrambling to survive as odds mount against them. If you like fast-paced, action-driven science fiction with a new twist on the alien encounter story, you’ll love A.R. Knight’s Clarity’s Dawn and the entire Skyward Saga. Grab Clarity’s Dawn and continue your interstellar adventure today!",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Standard Length",
        "published_date": 2015,
        "thumbnail": "http://books.google.com/books/content?id=XfO7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Deathstalker",
        "author": "Simon R. Green",
        "description": "Owen Deathstalker, last of the infamous warrior Clan, always considered himself more of a writer than a fighter, preferring his history books to making any actual history with a sword. But books won’t protect him from Her Imperial Majesty Lionstone XIV, who just Outlawed and condemned Owen to death, without any explanation, reason, or warning. No wonder she’s called the Iron Bitch. Now, on the run from Imperial starcruisers, shady mercenaries, and just about everyone else in the Empire, Owen’s options are limited. Though the name Deathstalker still commands respect in certain quarters, out on the Rim, Owen is lucky he can cobble together a makeshift team of castoffs, including an ex-pirate, a cyborg, and a bounty hunter. But allies won’t be enough to save him. If he’s to live, Owen can either run forever...or take down the corrupt Empire. To do that, he’ll need the fabled Darkvoid Device—an artifact dating back to the first Deathstalker and perhaps the only weapon powerful enough to help this ragtag rebellion win. The time has come for Owen to finally embrace his Deathstalker heritage...and all the blood and death that go along with it. Deathstalker is the first book in New York Times bestselling author Simon R. Green’s beloved space opera series.",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_date": 2023,
        "thumbnail": "http://books.google.com/books/content?id=9xoqDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "XOM-B",
        "author": "Jeremy Robinson",
        "description": "Freeman is a genius with an uncommon mixture of memory, intelligence and creativity. He lives in a worldwide utopia, but it was not always so. There was a time known as the Grind—when Freeman's people lived as slaves to another race referred to simply as \"Master.\" They were property. But a civil rights movement emerged. Change seemed near, but the Masters refused to bend. Instead, they declared war. And lost. Now, the freed world is threatened by a virus, spread through bites, sweeping through the population. Those infected are propelled to violence, driven to disperse the virus. Uniquely suited to respond to this new threat, Freeman searches for a cure, but instead finds the source—the Masters, intent on reclaiming the world. Freeman must fight for his life, for his friends and for the truth, which is far more complex and dangerous than he ever imagined. Robinson's lightning fast, cutting-edge novels have won over thriller, horror, science-fiction and action/adventure fans alike, and he has received high praise from peers like James Rollins, Jonathan Maberry, and Scott Sigler. XOM-B is a wildly inventive zombie novel with a high-tech twist that will keep readers guessing until the very last sentence.",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_date": 1991,
        "thumbnail": "http://books.google.com/books/content?id=DOhzAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Sci-Fi Junior High",
        "author": "Scott Seegert",
        "description": "At Sci-Fi Junior High, everyone knows Kelvin Klosmo's scientist parents are geniuses, but Kelvin's own geniusness hasn't exactly ... kicked in yet. Can he keep his secret hidden, even when an evil scientist takes the form of a stuffed bunny and tries to conquer the universe? A hilarious illustrated story that's out of this world!",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Standard Length",
        "published_date": 2023,
        "thumbnail": "http://books.google.com/books/content?id=dLA3DgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Outer Earth: The Complete Trilogy",
        "author": "Rob Boffard",
        "description": "'EXHILARATING AND UNFORGETTABLE' Sarah Lotz, author of The Three 'SETS A NEW STANDARD FOR ALL-ACTION SF' Ken MacLeod An omnibus edition containing all three of Rob Boffard's thrilling Outer Earth novels: Tracer, Zero-G and Impact. Outer Earth is a huge space station orbiting the ruins of our planet. Dirty, overcrowded and inescapable, it's humanity's last refuge . . . and possibly its final resting place. For there are dark forces at work on the station: forces that seek to unleash chaos. If they succeed, there will be nowhere left to run. 'Fast-paced, action-packed, cinematic space adventure' Civilian Reader 'Relentlessly fast pace...Vivid action scenes' SFX 'Compelling, compulsive...Thoroughly entertaining' SciFi and Fantasy Reviews 'Guaranteed to keep you hooked until the very last page' Glamour",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Standard Length",
        "published_date": 1981,
        "thumbnail": "http://books.google.com/books/content?id=ABeUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Colony World",
        "author": "Tarah Benner",
        "description": "The high-octane fourth installment in The Elderon Chronicles. Three years after a heartbreaking defeat, Maggie’s world is unrecognizable. She’s gone underground to hide from Mordecai. Her career as a journalist is over. She’s scrubbing toilets in a seedy hotel just to make ends meet. Mordecai’s vision for bot domination has brought the country to its knees. An attack on Congress and a humanoid army has shrouded Maggie’s city in fear. Tripp is a hostage on his own space station, forced to finance Mordecai’s campaign of terror. Maggie, Ping, and Alex are fighting from the shadows, but Maggie can’t escape the wounds of her past. When she receives a message from Tripp, she puts a dangerous plan into motion. The mission could thwart Mordecai’s global ambitions and stop the spread of bots. But when Maggie gets a visit from a mysterious stranger, her entire world is turned upside down. Overnight she becomes the most hunted woman alive and learns a shocking truth. *** KEYWORDS: best science fiction, sci fi, adventure stories, space opera, military sci fi, space marine, military science fiction, space force, action and adventure, robots, AI, artificial intelligence evil robots, space station, space colony, colonization, free space opera, free military science fiction, free military sci fi, sci fi romance, spaceships, space travel, sci fi books that are free, read ebooks for free, stories to read online free, google books free to read, evil corporation, strong female lead, female protagonist, slow-burn romance, near-future technology",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Long Read",
        "published_date": 2010,
        "thumbnail": "http://books.google.com/books/content?id=Kpj9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Colony War",
        "author": "Tarah Benner",
        "description": "From the author of Colony One comes an action-packed sequel to the near-future conspiracy. An army of bots is roaming the space station — hijacked by a terrorist inside BlumBot International. The bots share a hive mind that learns and adapts, making them the most deadly adversaries Jonah has ever faced. Jonah and Maggie are prepared to fight alongside the Space Force, but how can they defeat an army that never eats, never sleeps, and never grows tired? To protect the colony, they must join forces with Tripp Van de Graaf — the cocky young executive with dimples for days. Tripp makes no effort to hide his attraction toward Maggie, and Jonah hates him instantly. But Tripp’s company holds the key to defeating the bots: their human creator, Ziva Blum. When Maggie, Tripp, and Jonah learn that more humanoids are hibernating on Earth, they must race to stop a madman bent on destruction and save the world from a robot apocalypse. *** KEYWORDS: best science fiction, sci fi, adventure stories, space opera, military sci fi, space marine, military science fiction, space force, action and adventure, robots, AI, artificial intelligence evil robots, space station, space colony, colonization, free space opera, free military science fiction, free military sci fi, sci fi romance, spaceships, space travel, sci fi books that are free, read ebooks for free, stories to read online free, google books free to read, evil corporation, strong female lead, female protagonist, slow-burn romance, near-future technology",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Long Read",
        "published_date": 2023,
        "thumbnail": "http://books.google.com/books/content?id=2nn7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Eye of Truth",
        "author": "Lindsay Buroker",
        "description": "After ten years at war, Jev Dharrow looks forward to hanging up his sword, relaxing with a cool mug of ale, and forgetting that the love of his life married another man while he was gone. But when his ship sails into port, a beautiful woman wearing the garb of an inquisitor from one of the religious orders waits to arrest him. His crime? He’s accused of stealing an ancient artifact with the power to start another war. Jev would gladly hand over the artifact to stop more suffering, but he has no idea where it is or even what it looks like. The inquisitor woman definitely has the wrong person. Inquisitor Zenia Cham grew up with nothing, but she has distinguished herself as one of the most capable law enforcers in the city, and she’s next in line to become archmage of the temple. All she has to do is find the Eye of Truth, and her superiors are certain that Jev has it. He tries to charm her with his twinkling eyes and easy smile, but she’s not letting any man get between her and her dreams. Especially not a thief. If Jev can’t convince Zenia they’re on the same side, find the artifact, and clear his name, his homecoming will turn into a jail sentence. Or worse.",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Long Read",
        "published_date": 2002,
        "thumbnail": "http://books.google.com/books/content?id=gdIiEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Judas Unchained",
        "author": "Peter F. Hamilton",
        "description": "WALL STREET JOURNAL BESTSELLER • “An interstellar suspense thriller . . . sweeping in scope and emotional range.”—San Antonio Express-News In the star-spanning civilization known as the Intersolar Commonwealth, twenty-three planets have fallen victim to the Prime, a technologically advanced alien species genetically hardwired to exterminate all other forms of life. But the Prime is not the only threat. The Starflyer, an alien with mind-control abilities impossible to detect or resist, has secretly infiltrated the Commonwealth and is sabotaging the war effort. Is the Starflyer an ally of the Prime, or has it orchestrated a fight to the death between the two species for its own advantage? Caught between two deadly enemies, the fractious Commonwealth must unite as never before. This will be humanity’s finest hour—or its last gasp. Praise for Judas Unchained, the sequel to Pandora’s Star “Bristles with the energy of golden age SF, but the style and characterizations are polished and modern.”—SF Site “You’re in for quite a ride.”—The Santa Fe New Mexican “The reader is left breathless in amazement.”—SFRevu",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Long Read",
        "published_date": 2007,
        "thumbnail": "http://books.google.com/books/content?id=j1WZfzhwzaQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Hab 12",
        "author": "Mark Wayne McGinnis",
        "description": "\"Buckle up--this is another crazy ride!\" The Scrapyard Ship sci-fi \"cliff-hanger\" adventures continue with HAB 12, the second book in the series: Captain Jason Reynolds faces new challenges, not only on Earth but from the far side of the universe as well. The only way to stop the Craing this time will be to square off with them on their home turf. Jason's been informed that three powerful Craing warships, having similar technology as The Lilly, will soon be en route to Earth. The Alliance must destroy the Craing's wormhole means of distant space travel to avert Earth's total annihilation. Unfortunately, there's no way to reach the Craing worlds in time, at least not through conventional means. It's up to Jason and his hand-picked assault team to traverse, by advanced phase-shifting means, through the hazardous environment of HAB 12. This is an adventure fraught with carnivores of a Jurassic Age magnitude, and a terrain so deadly that turning back may be their only hope of survival. Note from the author: Don't be surprised by cliff-hanger endings. I'll do my best to keep Scrapyard Ship as well as the Tapped In series books coming so you wont have long to wait for the next book. Enjoy!",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Long Read",
        "published_date": 2010,
        "thumbnail": "http://books.google.com/books/content?id=DyfFoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Contract of Betrayal: Spectras Arise Trilogy, Book 2",
        "author": "Tammy Salyer",
        "description": "THE DEVIL YOU KNOW OR THE DEVIL YOU DON'T—SOMETIMES THEY'RE BOTH WORSE THAN YOU CAN IMAGINE. In a bid to free the settlers of Agate Beach from their dependence on picking at Admin scraps, Corps-deserter Aly Erikson's crew is willing to make a few deals, even with the devil. When Aly learns her friends have deceived her, she has to decide which is stronger: her sense of having been betrayed or her allegiance to the rebel cause. After an old ally offers her a convenient escape to a new life, the decision should be easy. But when the Corps threatens to wipe out everything that matters to her, the only course of action left is the same one she’s taken for as long as she can remember—fighting back. What people saying about the Spectras Arise Series “A fast-paced and fun sci-fi space adventure with a great protagonist… starts with a running gun fight and doesn't let up until the explosive conclusion.” “Top Notch SciFi Read!” “I'm torn between wanting to savor every exciting moment of this gorgeously written series or binge-read to find out what happens next.” “Thrilling, Roller-Coaster Ride of Military Sci-Fi Adventure” “Contains the kind of action that makes it hard to turn off the light and go to sleep.” Other books in the Spectras Arise Series Conviction: A Spectras Arise Prequel Novella Contract of Defiance: Spectras Arise Trilogy, Book 1 Contract of Betrayal: Spectras Arise Trilogy, Book 2 Contract of War: Spectras Arise Trilogy, Book 3 The Spectras Arise Series Omnibus, including all four books Fans of the following authors may also enjoy this science fiction series: Aaron Dembski Bowden, Adrian Tchaikovsky, Ann Leckie, Anna Hackett, Anthony J.Melchiorri, Arthur C Clarke, B. V. Larson, Carlos R. Tkacz, Craig A. Falconer, Craig Alanson, Craig Martelle, Dan Simmons, Dennis E. Taylor, Douglas E. Richards, Eric Vall, Ernest Cline, Evan Currie, G.S. Jennsen, Gav Thorpe, George Mann, Ian St Martin, Ian Watson, Isaac Asimov, Isaac Hooke, James Corey, Jay Allan, Jessie Mihalik, Joe Haldeman, John Conroe, John Ringo, Jonathan Yanez, Joseph Lallo, Josh Hayes, Josh Reynolds, Joshua Dalzelle, Kris Longknife, Larry Niven, Lindsay Buroker, Martin L. Shoemaker, Mike Resnick, Neil Clarke, Nicholas Sansbury Smith, Nick Webb, Ray Bradbury, Richard Heinlein, Rick Partlow, S. H. Jucha, Samuel Delany, Scott Moon, Vaughn Hepner, Vicky Peterwald Fans of the following books and series may also enjoy this science fiction series: A Call To Arms, A Call To Vengeance, A Rising Thunder, A Trick Of Light, Across The Galactic Pond, Agent To The Stars, Albion Lost, Alliance, Archangel One, Ashes Of Victory, At All Costs, Aurora Blazing, Aurora Renegades, Aurora Rising, Big Sigma, Broken Worlds, Chaos Space Marines, Children Of Time, Clone World, Come Tumbling Down, Count Zero, Cursed Stars, Cygnus Space Opera, Dark Age, Dark Space, Dropship, Earth Fall, Echoes Of Honor, Edge Of Valor, Extinction Shadow, Field Of Dishonor, Flag In Exile, Flight Of The Reaper, Forever Gate, Forever War, Foundation And Earth, Foundation's Edge, Fracture Spacers, Fractured Empire Complete Cadicle Series, Free Trader, Fuzzy Nation, Galactic Vanguard, Galactic War, Gateway To War, Genome, Ghost Fleet, Head On, Helsreach (Space Marine Battles), Hero Code, Honor Among Enemies, Honor Harrington Universe, Hyperion, Imperial Sunset, Imperial Twilight, In Enemy Hands, Infinity Born, Interdependency, Interstellar Warspike Chronicles, Iron Wolves, Judge Jury, Jumper, Kiss Of Eon, Land Of Wolves, Leviathan Wakes, Lock In, Lucky's Marines, Mission Critical, Mission Of Honor, Monster Hunter Guardian, Nemesis, New Frontiers, Odysseus Ascendant Spacers, Odysseus Awakening Spacers, Old Man's War, Omega Force, On Basilisk Station, Primaris Space Marines, Primordial Threat, Recon, Redshirts, Refuge Spacers, Renegade Atlas, Renegade Descent, Renegade Fleet, Renegade Lost, Renegade Moon, Renegade Rising, Renegade Star, Resonant Abyss, Resonant Son, Resurgence, River Of Night, Ruins of the Galaxy, Salvation, Salvation Lost, Shadow Of Freedom, Shadow Of Victory, Shield Of Terra, Ship Of Ruin, Shockwave, Shots Fired, Smoke Bitten, Solar War, Space Marine Conquests, Space Marine Legends, Spacers, Star Force, Star Kingdom, Star Trek Books, Star Forged, Starshine, Stranger In A Strange Land, Summer Frost, Superdreadnought, Terradox Quadrilogy, Terran Scout Fleet 1, The Android's Dream, The Caves Of Steel, The Collapsing Empire, The Consuming Fire, The End Of All Things, The Eon Series, The Expanding Universe, The Fifth Column, The Free Trader Of Planet Vii, The Free Trader Of Warren Deep, The Genesis Fleet, The Ghost Brigades, The Gordian Protocol, The Hidden Ship, The Honor Of The Queen, The Human Division, The Last Colony, The Last Dance, The Last Emperox, The Last Stand, The Lost Colony, The Lost Starship, The Orbs Series, The Originator Wars, The Robots Of Dawn, The Sagan Diary, The Short Victorious War, The Slaver Wars, The Star Cross, The Void Within, Though Hell Should Bar The Way, Through Fiery Trials, Tiamat's Wrath, To Clear Away The Shadows, Tomorrow Factory, Uncompromising Honor, Undying Mercenaries Series, Unlocked, Vanquish, Vigilance Spacers, War Of Honor, Wastelands, We Are Legion, Winds Of Wrath, Wings Of The Reaper, Winter World, Wrath Of The Reaper, Zoe's Tale, Zone War Keywords related to this science fiction series: Ace, Action Adventure, Action Adventure Books, Action Books, Adventure, Angry Robot, Baen, Daw, Del Rey, Essential Reads, Female Action Adventure, Female Adventure Books, Female Space Marines, Fleet, Futuristic Weapons, Galactic Empire, Galactic Liberation, Galactic Vanguard, Galactic War, Genetic Engineering, Heroine, Hugo, Hugo Award, Military Science Fiction, Military Science Fiction Action Adventure, Military Science Fiction Books, Military Science Fiction Series, Msf Books, Nebula, Nebula Award, New Wave Sf, Outcast Marines, Popular Series, Republic, Science Fiction, Science Fiction Action Adventure, Science Fiction Series, Smuggler, Soldier, Space Flight, Space Marine, Space Opera, Space Warfare, Spaceship, Starship, Strong Female Character, Subterranean Press, Top Rated Books, Tor Omnibus Set, Omnibus Collection, Omnibus Bundle, Science Fiction Omnibus, Science Fiction Bundle, Science Fiction Box Sets, Science Fiction Box Set, Collections & Anthologies, Boxed Set, Best Rated Science Fiction Omnibus",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Long Read",
        "published_date": 2003,
        "thumbnail": "http://books.google.com/books/content?id=zV74DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
]