[
    {
        "isbn": "9781000327946",
        "title": "Neoliberalism and Cyberpunk Science Fiction",
        "author": "Caroline Alphin",
        "description": "Caroline Alphin presents an original exploration of biopolitics by examining it through the lens of cyberpunk science fiction. Comprised of five chapters, Neoliberalism and Cyberpunk Science Fiction is guided by four central themes: biopolitics, intensification, resilience, and accelerationism. The first chapters examine the political possibilities of cyberpunk as a genre of science fiction and introduce one kind of neoliberal subject, the self-monitoring cyborg. These are individuals who join fitness/health tracking devices and applications to their body to \"self-cultivate\". Here, Alphin presents concrete examples of how fitness trackers are a strategy of neoliberal governmentality under the guise of self-cultivation. Moving away from Foucault’s biopolitics to themes of intensity and resilience, Alphin draws largely from William Gibson’s Neuromancer, Neal Stephenson’s Snow Crash, Richard K. Morgan’s Altered Carbon, along with the film Blade Runner to problematize notions of neoliberal resilience. Alphin returns to biopolitics, intensity, and resilience, connecting these themes to accelerationism as she engages with biohacker discourses. Here she argues that a biohacker is, in part, an intensification of the self-monitoring cyborg and accelerationism is in the end another form of resilience. Neoliberalism and Cyberpunk Science Fiction is an invaluable resource for those interested in security studies, political sociology, biopolitics, critical IR theory, political theory, cultural studies, and literary theory.",
        "category": "Cyberpunk",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2001,
        "thumbnail": "http://books.google.com/books/content?id=M2wNEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780446602334",
        "title": "Holo Men",
        "author": "Stephen Billias",
        "description": "When Joshua Victor discovers a team of permanent Net users who are intent on controlling the Net for their own purposes, he confronts them, but they turn on him to prevent him blowing the whistle.",
        "category": "Cyberpunk",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2022,
        "thumbnail": "http://books.google.com/books/content?id=QyIzSgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9780316134392",
        "title": "Equations of Life",
        "author": "Simon Morden",
        "description": "Winner of the 2012 Philip K. Dick Award Samuil Petrovitch is a survivor. He survived the nuclear fallout in St. Petersburg and hid in the London Metrozone -- the last city in England. He's lived this long because he's a man of rules and logic. For example, getting involved = a bad idea. But when he stumbles into a kidnapping in progress, he acts without even thinking. Before he can stop himself, he's saved the daughter of the most dangerous man in London. And clearly saving the girl = getting involved. Now, the equation of Petrovitch's life is looking increasingly complex. Russian mobsters + Yakuza + something called the New Machine Jihad = one dead Petrovitch. But Petrovitch has a plan -- he always has a plan -- he's just not sure it's a good one.",
        "category": "Cyberpunk",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2008,
        "thumbnail": "http://books.google.com/books/content?id=jKAjEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781596879881",
        "title": "The Demolished Man",
        "author": "Alfred Bester",
        "description": "﻿#4 in the Millennium SF Masterworks series, a library of the finest science fiction ever written. The first Hugo Award winner for best novel in 1953. “One of the all-time classics of science fiction.”—Isaac Asimov “Bester's two superb books have stood the test of time. For nearly sixty years they’ve held their place on everybody’s list of the ten greatest sf novels” —Robert Silverberg In a world policed by telepaths, Ben Reich plans to commit a crime that hasn’t been heard of in 70 years: murder. That’s the only option left for Reich, whose company is losing a 10-year death struggle with rival D’Courtney Enterprises. Terrorized in his dreams by The Man With No Face and driven to the edge after D’Courtney refuses a merger offer, Reich murders his rival and bribes a high-ranking telepath to help him cover his tracks. But while police prefect Lincoln Powell knows Reich is guilty, his telepath's knowledge is a far cry from admissible evidence. Alfred Bester was among the first important authors of contemporary science fiction. His passionate novels of worldly adventure, high intellect, and tremendous verve, The Stars My Destination and the Hugo Award winning The Demolished Man, established Bester as a s.f. grandmaster, a reputation that was ratified by the Science Fiction Writers of America shortly before his death. Bester also was an acclaimed journalist for Holiday magazine, a reviewer for the Magazine of Fantasy and Science Fiction and even a writer for Superman.",
        "category": "Cyberpunk",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2008,
        "thumbnail": "http://books.google.com/books/content?id=89SCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781937163099",
        "title": "Cyberpunk",
        "author": "Victoria",
        "description": "Cyberpunk has brought us films like Blade Runner, Tron, and The Matrix, and it has brought us now-classic novels like Snow Crash and Neuromancer. It continues to be a powerful theme in contemporary literature as writers imagine a gritty, dark, wild, and wicked future where body modification, seedy elements, omniscient corporations, and a few down-luck anti-heroes are always having it out. Inside the covers of this book, readers find stories by the best and the finest cyberpunk writers — from foundational authors like Bruce Sterling and William Gibson to new voices like Cory Doctorow — all of whom write with the fire and zeal that powers the best cyberpunk writing. Here are stories about society gone wrong and society saved, about soulless humans and soulful machines, about futures worth fighting for and futures that do nothing but kill. Welcome to your cyberpunk world. Welcome to your cyberpunk world.",
        "category": "Cyberpunk",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2016,
        "thumbnail": "http://books.google.com/books/content?id=yoLTDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781490330723",
        "title": "The Scorpion Game",
        "author": "Daniel Jeffries",
        "description": "In 2458, on a continent sized starship with its own atmosphere and an entire civilization churning inside, the poor live in rotting organic cities and the rich live in massive orbital mansions drifting in the clouds. When a hooker plunges from the sixty-sixth floor of an opulent nightclub and a senator is found dead in his room, the police call on Lieutenant Durante Hoskin to solve what swiftly becomes a string of murders of the rich and powerful. Now Hoskin must stop a vicious and brilliant sociopath, who's executing the elite and exposing their secrets to an angry public, before his society explodes in open class war.",
        "category": "Cyberpunk",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2008,
        "thumbnail": "http://books.google.com/books/content?id=yuhtngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9781941539507",
        "title": "Tribe",
        "author": "Jeremy Robinson",
        "description": "For Henry, a seventeen-year-old who feels no fear, the day starts like any other--homeless and alone on the streets of Boston. For Sarah, a twenty-year-old college dropout, it's an early morning serving donuts and coffee to commuters at North Station. Fate brings them together at the scene of a bank robbery, which they foil together, along with a mysterious and wealthy woman named Helen, who offers to reward them for their bravery. But before they can reach Helen's penthouse, they are assaulted by men and women from all walks of life, including police officers. Helen displays impressive fighting skills, fending off the attacks, allowing Henry and Sarah to make their escape--but they are spotted and pursued by the violent cult, out for Helen's blood...and now theirs. Racing through the streets of Boston, Sarah and Henry are propelled into a strange and ancient underworld where the impossible is real, where the old world still lives, and where the gods still walk among us. As the pair wages war against the killers hunting them, they discover the truth about who their deceased parents were, and that their lives could be far more exceptional than either believed possible...if they can survive the day. With TRIBE, New York Times bestselling author, Jeremy Robinson, brings mythology to the modern world, combining his trademarked fast-paced action and well developed characters, and taking them to new levels of craziness. It's 300, John Wick, and Wonder Woman rolled into a new kind of literary insanity.",
        "category": "Cyberpunk",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2002,
        "thumbnail": "http://books.google.com/books/content?id=WiLGywEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9780553447477",
        "title": "The Fold",
        "author": "Peter Clines",
        "description": "A page-turning science-fiction thriller from the author of Paradox Bound and the Ex-Heroes series. Step into the fold. It's perfectly safe. The folks in Mike Erikson's small New England town would say he's just your average, everyday guy. And that's exactly how Mike likes it. Sure, the life he's chosen isn’t much of a challenge to someone with his unique gifts, but he’s content with his quiet and peaceful existence. That is, until an old friend presents him with an irresistible mystery, one that Mike is uniquely qualified to solve: far out in the California desert, a team of DARPA scientists has invented a device they affectionately call the Albuquerque Door. Using a cryptic computer equation and magnetic fields to “fold” dimensions, it shrinks distances so that a traveler can travel hundreds of feet with a single step. The invention promises to make mankind’s dreams of teleportation a reality. And, the scientists insist, traveling through the Door is completely safe. Yet evidence is mounting that this miraculous machine isn’t quite what it seems—and that its creators are harboring a dangerous secret. As his investigations draw him deeper into the puzzle, Mike begins to fear there’s only one answer that makes sense. And if he’s right, it may only be a matter of time before the project destroys…everything. A cunningly inventive mystery featuring a hero worthy of Sherlock Holmes and a terrifying final twist you’ll never see coming, The Fold is that rarest of things: a genuinely page-turning science-fiction thriller.",
        "category": "Cyberpunk",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2009,
        "thumbnail": "http://books.google.com/books/content?id=PWraCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9789670750897",
        "title": "CYBERPUNK: MALAYSIA",
        "author": "Zen Cho",
        "description": "Cyberpunk as you've never seen it before… Science fiction is all about outrageous ideas. Nice Malay girls breaking the rules. Censorship. Brain drain. Moral policing. Migrant exploitation. All the stuff of fiction, obviously. But these 14 short stories take it one step further. The nice Malay girls are cyborgs. The spambots are people. The brains have drained into cyberspace, and the censorship is inside your head. Welcome to Cyberpunk: Malaysia. (Contents in this ebook are exactly the same as the print version, just with a different cover.) Line-Up: Underneath Her Tudung / Angeline Woon Codes / Anna Tan Personal / Sharmilla Ganesan Attack of The Spambots / Terence Toh ONE HUNDRED YEARS: Machine / Rafil Elyas What the Andromaid Reads at Night / Ted Mahsun KAKAK / William Tham Wai Liang The Wall That Wasn’t a Wall / Kris Williamson The Twins / Adiwijaya Iskandar October 11 / Chin Ai-May Undercover in Tanah Firdaus / Tina Isaacs Unusual Suspects / Tariq Kamal The White Mask / Zedeck Siew Extracts from DMZINE #13 (January 2115) / Foo Sek Han (Buku Fixi) (Fixi Novo)",
        "category": "Cyberpunk",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=_bndCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781736805305",
        "title": "CONSTELIS VOSS vol.1 — COLOUR THEORY",
        "author": "K. Leigh",
        "description": "The series opens on a dystopic planet-sized ship in the far future, where a very advanced android receives a personality file from the 90s. He is the only one of his kind. His name is Alex, and in his quest for understanding just how he got to be an android-and on the planet-sized ship known as CONSTELIS VOSS-he finds curiously familiar faces who help him color in the blanks. As the coincidences pile up-friends, objects, scenes, motifs, and tropes-they start to form a pattern. A pattern that's set against the backdrop of a dystopian, corrupt civilization, with a conveniently very-evil villain. A pattern that seems, in all its madness, to be directly linked to him. Something is pulling the strings, and figuring out the mystery is the only way to save himself, his friends, and the future of the very human race itself. But will he be able solve the mystery without losing himself-and his friends-in the process? The road to hell is paved with good intentions, after all. Welcome to Constelis Voss, the anime-inspired, psychological sci-fi trilogy nobody asked for, but everyone (probably) deserves.",
        "category": "Cyberpunk",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2022,
        "thumbnail": "http://books.google.com/books/content?id=T4cpEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781590216002",
        "title": "Trouble and Her Friends",
        "author": "Melissa Scott",
        "description": "Years from now, the forces of law and order crack down on the world of the internet. The noir adventurers who got by on wit, bravado, and drugs, who haunt the virtual worlds of cyberspace are up against the edges of civilization.",
        "category": "Cyberpunk",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=X8QlBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780786466535",
        "title": "Cyberpunk Women, Feminism and Science Fiction",
        "author": "Carlen Lavigne",
        "description": "This analysis of cyberpunk science fiction written between 1981 and 2003 positions women's cyberpunk in the larger cultural discussion of feminist issues. It traces the origins of the genre, reviews the critical reactions and outlines the ways in which women's cyberpunk advances points of view that are specifically feminist. Novels are examined within their cultural contexts; their content is compared to broader controversies within contemporary feminism, and their themes are revealed as reflections of feminist discourse around the turn of the 21st century. Chapters cover topics such as globalization, virtual reality, cyborg culture, environmentalism, religion, motherhood and queer rights. Interviews with feminist cyberpunk authors are provided, revealing both their motivations for writing and their experiences with fans. The study treats feminist cyberpunk as a unique vehicle for examining contemporary women's issues and analyzes feminist science fiction as a complex source of political ideas.",
        "category": "Cyberpunk",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=1gOPZ_AQl5gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780345526687",
        "title": "Great North Road",
        "author": "Peter F. Hamilton",
        "description": "NAMED ONE OF THE BEST BOOKS OF THE YEAR BY PUBLISHERS WEEKLY New York Times bestselling author Peter F. Hamilton’s riveting new thriller combines the nail-biting suspense of a serial-killer investigation with clear-eyed scientific and social extrapolation to create a future that seems not merely plausible but inevitable. A century from now, thanks to a technology allowing instantaneous travel across light-years, humanity has solved its energy shortages, cleaned up the environment, and created far-flung colony worlds. The keys to this empire belong to the powerful North family—composed of successive generations of clones. Yet these clones are not identical. For one thing, genetic errors have crept in with each generation. For another, the original three clone “brothers” have gone their separate ways, and the branches of the family are now friendly rivals more than allies. Or maybe not so friendly. At least that’s what the murder of a North clone in the English city of Newcastle suggests to Detective Sidney Hurst. Sid is a solid investigator who’d like nothing better than to hand off this hot potato of a case. The way he figures it, whether he solves the crime or not, he’ll make enough enemies to ruin his career. Yet Sid’s case is about to take an unexpected turn: because the circumstances of the murder bear an uncanny resemblance to a killing that took place years ago on the planet St. Libra, where a North clone and his entire household were slaughtered in cold blood. The convicted slayer, Angela Tramelo, has always claimed her innocence. And now it seems she may have been right. Because only the St. Libra killer could have committed the Newcastle crime. Problem is, Angela also claims that the murderer was an alien monster. Now Sid must navigate through a Byzantine minefield of competing interests within the police department and the world’s political and economic elite . . . all the while hunting down a brutal killer poised to strike again. And on St. Libra, Angela, newly released from prison, joins a mission to hunt down the elusive alien, only to learn that the line between hunter and hunted is a thin one. BONUS: This edition includes an excerpt from Peter F. Hamilton’s The Abyss Beyond Dreams. Praise for Great North Road “A mesmerizing page-turner.”—Publishers Weekly (starred review) “A gripping saga that blends wilderness survival, police procedural, political and social intrigue, and dynastic sf into a mammoth tale featuring believable characters and exceptionally skilled storytelling.”—Library Journal (starred review) “A perfect introduction to [Hamilton’s] gifts for character design, dialogue, and sheer, big-idea-driven storytelling.”—Booklist (starred review) “Compelling and original . . . an awesome novel [with] plenty of action.”—SFRevu “One very compelling and entertaining science fiction novel.”—SF Site “Simply brilliant . . . an astonishing achievement.”—Tor.com",
        "category": "Cyberpunk",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=HFJYRWxLXUMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780809316717",
        "title": "Science Fiction in the Real World",
        "author": "Norman Spinrad",
        "description": "Updates Lentz's previous work (which Library journal said was producers, screenwriters, cinematographers, special effects technicians, make-up artists, art directors. III: film index. IV: TV series index. V: alternate title index. Science fiction writer Spinrad presents 13 essays, some previously published, examining particular works in the genre, aspects of the industry, and how they influence each other. Topics include critical standards, the visual expression in comic books and movies, modes of content, politics, and profiles of individual authors. No bibliography. Paper edition (unseen), $14.95. Annotation copyrighted by Book News, Inc., Portland, OR",
        "category": "Cyberpunk",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2015,
        "thumbnail": "http://books.google.com/books/content?id=EvCsY3IEJ14C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780756412074",
        "title": "The Courier",
        "author": "Gerald Brandt",
        "description": "Scraping by as a cycle courier in a future world run by corporations, Kris witnesses a client's murder and finds herself targeted by dangerous adversaries before she is rescued by a member of an underground resistance group.",
        "category": "Cyberpunk",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2024,
        "thumbnail": "http://books.google.com/books/content?id=Zy-JEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781625671806",
        "title": "Deathstalker",
        "author": "Simon R. Green",
        "description": "Owen Deathstalker, last of the infamous warrior Clan, always considered himself more of a writer than a fighter, preferring his history books to making any actual history with a sword. But books won’t protect him from Her Imperial Majesty Lionstone XIV, who just Outlawed and condemned Owen to death, without any explanation, reason, or warning. No wonder she’s called the Iron Bitch. Now, on the run from Imperial starcruisers, shady mercenaries, and just about everyone else in the Empire, Owen’s options are limited. Though the name Deathstalker still commands respect in certain quarters, out on the Rim, Owen is lucky he can cobble together a makeshift team of castoffs, including an ex-pirate, a cyborg, and a bounty hunter. But allies won’t be enough to save him. If he’s to live, Owen can either run forever...or take down the corrupt Empire. To do that, he’ll need the fabled Darkvoid Device—an artifact dating back to the first Deathstalker and perhaps the only weapon powerful enough to help this ragtag rebellion win. The time has come for Owen to finally embrace his Deathstalker heritage...and all the blood and death that go along with it. Deathstalker is the first book in New York Times bestselling author Simon R. Green’s beloved space opera series.",
        "category": "Cyberpunk",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2022,
        "thumbnail": "http://books.google.com/books/content?id=9xoqDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780425276235",
        "title": "The Peripheral",
        "author": "William Gibson",
        "description": "Originally published by G.P. Putnam's Sons in 2014.",
        "category": "Cyberpunk",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2006,
        "thumbnail": "http://books.google.com/books/content?id=_9DaCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780375984631",
        "title": "The Eye of Minds (The Mortality Doctrine, Book One)",
        "author": "James Dashner",
        "description": "The world is virtual, but the danger is real in book one of the bestselling Mortality Doctrine series, the next phenomenon from the author of the Maze Runner series, James Dashner. Includes a sneak peek of The Fever Code, the highly-anticipated conclusion to the Maze Runner series—the novel that finally reveals how the maze was built! The VirtNet offers total mind and body immersion, and the more hacking skills you have, the more fun it is. Why bother following the rules when it’s so easy to break them? But some rules were made for a reason. Some technology is too dangerous to fool with. And one gamer has been doing exactly that, with murderous results. The government knows that to catch a hacker, you need a hacker. And they’ve been watching Michael. If he accepts their challenge, Michael will need to go off the VirtNet grid, to the back alleys and corners of the system human eyes have never seen—and it’s possible that the line between game and reality will be blurred forever. The author who brought you the #1 New York Times bestselling MAZE RUNNER series and two #1 movies—The Maze Runner and The Scorch Trials—now brings you an electrifying adventure trilogy an edge-of-your-seat adventure that takes you into a world of hyperadvanced technology, cyber terrorists, and gaming beyond your wildest dreams . . . and your worst nightmares. Praise for the Bestselling MORTALITY DOCTRINE series: “Dashner takes full advantage of the Matrix-esque potential for asking ‘what is real.’” —io9.com “Set in a world taken over by virtual reality gaming, the series perfectly capture[s] Dashner’s hallmarks for inventiveness, teen dialogue and an ability to add twists and turns like no other author.” —MTV.com “A brilliant, visceral, gamified mash-up of The Matrix and Inception, guaranteed to thrill even the non-gaming crowd.” —Christian Science Monitor",
        "category": "Cyberpunk",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2024,
        "thumbnail": "http://books.google.com/books/content?id=fSJVtggtBrAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781662904905",
        "title": "The Quantum Effect",
        "author": "Nicklois Leonard",
        "description": "Was the COVID-19 virus man-made, or naturally occurring? Was the virus accidentally or intentionally released? Does Area 51 really exist? Do you want to know the truth? The Quantum Effect \"Mission COVID -19\" suggests answers to these and other questions by taking the reader on a suspenseful thriller ride. Engaging the US government including the White House, the Department of Defense, the CIA, and the Navy SEALs, as well as the Chinese Ministry of Health, this action-adventure novel reveals how they are all caught in an intricate web of clandestine operations based on the discovery of a new highly advanced time-travel technology. The Quantum Effect \"Mission COVID-19\" explores the origin of the COVID-19 virus and how it was unleashed on society. Follow Commander Maxwell as he leads his team on a high-stakes game of cat and mouse deep inside Chinese territory, in cooperation with the CIA to learn the truth behind COVID-19 once and for all.",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2013,
        "thumbnail": "http://books.google.com/books/content?id=pS-yzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9780996937528",
        "title": "Dark Matters",
        "author": "Michael Dow",
        "description": "Take an epic journey to a not-so-distant future, controlled by a handful of the über-elite. Where wealth, science, and the human spirit get one last chance to determine humanity's ultimate end game. Rudolph \"Rudy\" Dersch is the newly minted CEO of the world's largest, multi-trillion dollar corporate conglomerate. But the job comes with an unexpected twist-an invitation to join the Consortium, a small, secretive group of global elites who effectively decide what's best for the rest of humanity. In a world struggling with overpopulation, dwindling resources, and extreme income inequality, can anyone break this group's iron grip on the status quo? The answer may rest on a renegade physicist, close to unraveling one of the universe's greatest mysteries. And a headstrong art curator, driven to find the meaning behind her increasingly compelling visions.Together, they might just have what it takes to break the Consortium's stranglehold.If they don't strangle each other first.",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2019,
        "thumbnail": "http://books.google.com/books/content?id=S-okjwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9781482643473",
        "title": "The Stone Man - a Science Fiction Horror Novel",
        "author": "Luke Smitherd",
        "description": "THE #1 AMAZON HORROR BESTSELLER! \"THE STONE MAN is a novel that intrigues, enthralls, horrifies, thrills, and hits the reader with an emotional resonance as only the best stories can.\"-Ain't It Cool News Nobody knew where it came from. Nobody knew why it came. Even so, for two-bit (and antisocial) reporter Andy Pointer, the appearance in his city of a man made of moving stone meant the scoop of a lifetime. He would soon learn that The Stone Man was much more - and much worse - than that. This is Andy's account of everything that came afterwards, and the people that were lost along the way; of the terrible price that he, and the rest of his country, had to pay.The destruction. The visions. The dying. PRAISE FOR 'THE STONE MAN': \"Once again believable characters and a mind blowing story, and when Luke Smitherd is recognised as the great writer he is he is bound to be compared to the likes of James Herbert and Stephen King.\"-Scrooby1, Amazon UK Review \"Tremendous. I was looking for something completely original and different, this nailed it spot on. Highly recommended.\"-Neil Novita, Amazon USA Review \"I have owned a Kindle for about 2 years and downloaded some excellent books for very little cost but Luke Smitherd's works beat the lot\"-Silversmith, Amazon UK Review \"This ebook was fantastic and totally different from any other sci-fi thriller I've ever read...I kept thinking 'What if...what if...'-Carl Law, Amazon US Review \"It was one of those books where you tell yourself you will read just one more page, then look at the clock and realise that it's 2 hours later , I would thoroughly recommend it\"-Elaine Hosegood, Amazon UK Review \"As soon as I started reading I was completely sucked in, which very rarely happens for me. I couldn't wait to get home and read it each night. I laughed. I cried. I did actual real life gasps of horror.\"-Katie, Amazon UK Review \"Fantastically written characters who make you care about them right from the off, an unfathomable villain who defies all understanding and a supporting cast that flesh out the story beautifully.\"-Andy Pettifer, Goodreads Review \"I spend a lot of time trawling through the kindle book store looking for cheap books, relying on reviews to make my purchases. I have come across some less than average books using this method, but also some real gems. This book definitely falls into the latter category. It had me gripped from page one right through to the Alternative Ending Synopsis at the end. The other reviews leave me little to say other than thanks Luke.\"-Steve Sut, Amazon UK Review \"So good the first thing I did after I put it down was to download his other two books.\"-Miss H. L. Smith, Amazon UK Review \"This book starts with a bang and doesn't let up. I read this in two sittings. Recommended.\"-Dickydavis, Goodreads review \"A very enjoyable read and cracking value at the price.Do not be put off by Science Fiction or Horror in the title if they are not your bag, this is an inteligent and thought provoking read. Highly recommended.\"-Dave Osborn, Amazon UK Review \"I literally found this hard to stop reading,I wanted to know the answers.I have been around a good while so have read all of Asimov, Heinlein, Bradbury etc. and I would genuinely put this author in the same class as these class acts.\"-K Murphy, Amazon UK Review \"...so my 5-star review? That's five stars in comparison to REAL books; not just the stuff you'll find self-published on Kindle. The Stone Man is the sort of book that, if I'd splashed ten quid on in an airport or train station, bookstore, I'd have considered it money well-spent.\" Militant Ginger, Amazon USA Review A full-length novel. 140,000 words. FROM THE AUTHOR OF 'THE PHYSICS OF THE DEAD' AND 'THE BLACK ROOM' SERIES, ALSO AVAILABLE ON THE KINDLE STORE.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=4DaangEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9781632060563",
        "title": "Super Extra Grande",
        "author": "Yoss",
        "description": "With playfulness and ingenuity in the tradition of Douglas Adams, the Cuban science fiction master Yoss delivers a space opera of intergalactic proportions withSuper Extra Grande, the winner of the 20th annual UPC Science Fiction Award in 2011.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2003,
        "thumbnail": "http://books.google.com/books/content?id=BPVEDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781250180261",
        "title": "Zero Sum Game",
        "author": "S. L. Huang",
        "description": "ZERO SUM GAME Best of Lists: * Best Books of the Month at The Verge, Book Riot, Unbound Worlds, SYFY, & Kirkus * The Mary Sue Book Club Pick * Library Journal Best Debuts of Fall and Winter A blockbuster, near-future science fiction thriller, S.L. Huang's Zero Sum Game introduces a math-genius mercenary who finds herself being manipulated by someone possessing unimaginable power... Cas Russell is good at math. Scary good. The vector calculus blazing through her head lets her smash through armed men twice her size and dodge every bullet in a gunfight, and she'll take any job for the right price. As far as Cas knows, she’s the only person around with a superpower...until she discovers someone with a power even more dangerous than her own. Someone who can reach directly into people’s minds and twist their brains into Moebius strips. Someone intent on becoming the world’s puppet master. Cas should run, like she usually does, but for once she's involved. There’s only one problem... She doesn’t know which of her thoughts are her own anymore. \"Fresh and exciting... a great start to an exciting series--and an exciting career.\" --Boing Boing At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2011,
        "thumbnail": "http://books.google.com/books/content?id=XyBGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781466884472",
        "title": "Modern Classic Short Novels Of Science Fiction",
        "author": "Gardner Dozois",
        "description": "The novella is, in the words of Gardner Dozois, \"a perfect length for a science fiction story: long enough to enable you to flesh out the details of a strange alien world or a bizarre future society...and yet, still short enough for the story to pack a real punch.\" The thirteen masterpieces assembled in Modern Classic Short Novels of Science Fiction travel to the farthest reaches of the imagination, through realms of immortality, along alternate paths of time and across vast galaxies to explore the best of all imaginable worlds.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2011,
        "thumbnail": "http://books.google.com/books/content?id=ub6FBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781429925341",
        "title": "The Automatic Detective",
        "author": "A. Lee Martinez",
        "description": "From the award-winning author of Gil's All Fright Diner comes a fantastic sci-fi mystery read The Automatic Detective Even in Empire City, a town where weird science is the hope for tomorrow, it's hard for a robot to make his way. It's even harder for a robot named Mack Megaton, a hulking machine designed to bring mankind to its knees. But Mack's not interested in world domination. He's just a bot trying to get by, trying to demonstrate that he isn't just an automated smashing machine, and to earn his citizenship in the process. It should be as easy as crushing a tank for Mack, but some bots just can't catch a break. When Mack's neighbors are kidnapped, Mack sets off on a journey through the dark alleys and gleaming skyscrapers of Empire City. Along the way, he runs afoul of a talking gorilla, a brainy dame, a mutant lowlife, a little green mob boss, and the secret conspiracy at the heart of Empire's founders---not to mention more trouble than he bargained for. What started out as one missing family becomes a battle for the future of Empire and every citizen that calls her home. At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2016,
        "thumbnail": "http://books.google.com/books/content?id=WlSAAk3BXlkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781944098063",
        "title": "Register Your Book",
        "author": "David Wogahn",
        "description": "***Updated 2020 Edition*** LEARN THE RIGHT WAY... ...to set your book up for long-term success, improve sales opportunities, and protect your investment, including: Everything you need to know about ISBNs, Barcodes, Copyright, & LCCNs. Make sure your book can be distributed by any distributor. Never have to abandon your hard-earned reader reviews. Ensure your book can be printed by any printer. Add your book to the major book industry databases. Prevent your advance reading copies from being re-sold. Avoid legal headaches and missed filing deadlines. “Straightforward and easy to digest, this is one how-to that every new author or publisher should have in their arsenal!\" —Brooke Warner, Publisher of She Writes Press and author of Green-Light Your Book: How Writers Can Succeed in the New Era of Publishing “An essential guide to publishing identifiers, their benefits and uses, and (most importantly) what NOT to do. Required reading for every new entrant into book publishing – and for those who have been here a while, it’s never too late to go back to the sound fundamentals that David Wogahn provides here.\" —Laura Dawson, Numerical Gurus “...proceed with confidence in spending your time and dollars to get it done right, the first time.” —Carla King, Self-Pub Boot Camp “…a thorough and deceptively simple guide for independent authors and publishers…”",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2009,
        "thumbnail": "http://books.google.com/books/content?id=SxIqDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781684423385",
        "title": "The Ables",
        "author": "Jeremy Scott",
        "description": "I did have fantastic hearing, mostly by virtue of being blind. But that couldn't actually mean that he's trying to tell me I have super powers, right? Because that would be ridiculous. It wasn't the \"sex talk\" he expected. Phillip Sallinger's dad has told him he's a custodian--a guardian--and his genetically inherited power is telekinesis. He'll learn to move objects with his mind. Excited to begin superhero high school until he discovers he's assigned to a \"special ed\" class for disabled empowered kids, he suddenly feels like an outsider. Bullied, threatened, and betrayed, Phillip struggles, even as he and his friends--calling themselves the Ables--find ways to maximize their powers to overcome their disabilities, and are the first to identify the growing evil threatening humanity. As vital custodians disappear and the custodian leadership is mired in indecision, a mysterious and powerful figure taunts Phillip, and the enemy is poised to strike. But what if the next \"one who does all,\" the multi-gifted custodian predicted to come, is one of the Ables?",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2017,
        "thumbnail": "http://books.google.com/books/content?id=8pHuEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781250031723",
        "title": "XOM-B",
        "author": "Jeremy Robinson",
        "description": "Freeman is a genius with an uncommon mixture of memory, intelligence and creativity. He lives in a worldwide utopia, but it was not always so. There was a time known as the Grind—when Freeman's people lived as slaves to another race referred to simply as \"Master.\" They were property. But a civil rights movement emerged. Change seemed near, but the Masters refused to bend. Instead, they declared war. And lost. Now, the freed world is threatened by a virus, spread through bites, sweeping through the population. Those infected are propelled to violence, driven to disperse the virus. Uniquely suited to respond to this new threat, Freeman searches for a cure, but instead finds the source—the Masters, intent on reclaiming the world. Freeman must fight for his life, for his friends and for the truth, which is far more complex and dangerous than he ever imagined. Robinson's lightning fast, cutting-edge novels have won over thriller, horror, science-fiction and action/adventure fans alike, and he has received high praise from peers like James Rollins, Jonathan Maberry, and Scott Sigler. XOM-B is a wildly inventive zombie novel with a high-tech twist that will keep readers guessing until the very last sentence.",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=DOhzAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781448214693",
        "title": "Blood Crazy",
        "author": "Simon Clark",
        "description": "It is a quiet, uneventful Saturday in Doncaster. Nick Aten, and his best friend Steve Price – troubled seventeen year olds – spend it as usual hanging around the sleepy town, eating fast food and planning their revenge on Tug Slatter, a local bully and their arch-enemy. But by Sunday, Tug Slatter becomes the last of their worries because somehow overnight civilization is in ruins. Adults have become murderously insane – literally. They're infected with an uncontrollable urge to kill the young. Including their own children. As Nick and Steve try to escape the deadly town covered with the mutilated bodies of kids, a group of blood-thirsty adults ambushes them. Just a day before they were caring parents and concerned teachers, today they are savages destroying the future generation. Will Nick and Steve manage to escape? Is their hope that outside the Doncaster borders the world is 'normal' just a childish dream? Blood Crazy, first published in 1995, is a gripping, apocalyptic horror from Simon Clark.",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2018,
        "thumbnail": "http://books.google.com/books/content?id=pwKrBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780615458564",
        "title": "The Disappeared",
        "author": "Kristine Kathryn Rusch",
        "description": "Three cases have collided for Miles Flint: a stolen spaceyacht filled with dead bodies, two kidnapped human children, and a human woman on the run, trying to Disappear to avoid alien prosecution. Flint must enforce the law, but how can he do the right thing in a universe where the right thing is very, very wrong?",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2012,
        "thumbnail": "http://books.google.com/books/content?id=4AQmuQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9781999328603",
        "title": "Colony One Mars: A SciFi Thriller",
        "author": "Gerald M. Kilby",
        "description": "How can a colony on Mars survive when the greatest danger on the planet is humanity itself? All contact is lost with the first human colony on Mars during a long and destructive sandstorm. Satellite imagery of the aftermath shows extensive damage to the facility, and the fifty-four colonists who called it home are presumed dead. Three years later, a new mission sets down on the planet surface to investigate what remains of the derelict site. But, it's not long before they realize the colony is not as lifeless as everyone thought. Someone is still alive -- hiding out somewhere. Yet, before they can find the elusive colonist a strange illness starts to affect the crew. Pressure now mounts on Biologist, Dr. Jann Malbec, to locate the source and find a way to fight it. However, as she investigates she begins to suspect a dark and deadly secret lurking within the facility. A secret that threatens not just the crew but the entire population of Earth. With limited resources and time running out, she must find some answers and find them fast. Because if she doesn't, none of them will be going home. About Colony One Mars: This is the first book in a Sci-Fi series set in a human colony on Mars. The science depicted is, for the most part, plausible. In other words, what's technically possible with either current technology or taking experimental research a step or two further. That said, you won't need a calculator or a slide-rule to enjoy the story.",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2014,
        "thumbnail": "http://books.google.com/books/content?id=w2d-vQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9780231550062",
        "title": "Big Fiction",
        "author": "Dan Sinykin",
        "description": "Shortlisted, 2024 SHARP Book History Book Prize, Society for the History of Authorship, Reading, and Publishing In the late 1950s, Random House editor Jason Epstein would talk jazz with Ralph Ellison or chat with Andy Warhol while pouring drinks in his office. By the 1970s, editors were poring over profit-and-loss statements. The electronics company RCA bought Random House in 1965, and then other large corporations purchased other formerly independent publishers. As multinational conglomerates consolidated the industry, the business of literature—and literature itself—transformed. Dan Sinykin explores how changes in the publishing industry have affected fiction, literary form, and what it means to be an author. Giving an inside look at the industry’s daily routines, personal dramas, and institutional crises, he reveals how conglomeration has shaped what kinds of books and writers are published. Sinykin examines four different sectors of the publishing industry: mass-market books by brand-name authors like Danielle Steel; trade publishers that encouraged genre elements in literary fiction; nonprofits such as Graywolf that aspired to protect literature from market pressures; and the distinctive niche of employee-owned W. W. Norton. He emphasizes how women and people of color navigated shifts in publishing, arguing that writers such as Toni Morrison allegorized their experiences in their fiction. Big Fiction features dazzling readings of a vast range of novelists—including E. L. Doctorow, Judith Krantz, Renata Adler, Stephen King, Joan Didion, Cormac McCarthy, Chuck Palahniuk, Patrick O’Brian, and Walter Mosley—as well as vivid portraits of industry figures. Written in gripping and lively prose, this deeply original book recasts the past six decades of American fiction.",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2019,
        "thumbnail": "http://books.google.com/books/content?id=DnDCEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780008445980",
        "title": "The Cottage",
        "author": "Lisa Stone",
        "description": "*Don't miss the gripping new psychological thriller from Lisa Stone, THE MURDER ROOM, available to order now!* The gripping thriller with a difference from internationally bestselling author Lisa Stone",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2009,
        "thumbnail": "http://books.google.com/books/content?id=PVgTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780765394866",
        "title": "Ender's Game",
        "author": "Orson Scott Card",
        "description": "This engaging, collectible, miniature hardcover of the Orson Scott Card classic and worldwide bestselling novel, Ender's Game, makes an excellent gift for anyone's science fiction library. \"Ender's Game is an affecting novel.\"--New York Times Book Review Once again, Earth is under attack. An alien species is poised for a final assault. The survival of humanity depends on a military genius who can defeat the aliens. But who? Ender Wiggin. Brilliant. Ruthless. Cunning. A tactical and strategic master. And a child. Recruited for military training by the world government, Ender's childhood ends the moment he enters his new home: Battle School. Among the elite recruits Ender proves himself to be a genius among geniuses. He excels in simulated war games. But is the pressure and loneliness taking its toll on Ender? Simulations are one thing. How will Ender perform in real combat conditions? After all, Battle School is just a game. Isn't it? THE ENDER UNIVERSE Ender series Ender's Game / Ender in Exile / Speaker for the Dead / Xenocide / Children of the Mind Ender's Shadow series Ender's Shadow / Shadow of the Hegemon / Shadow Puppets / Shadow of the Giant / Shadows in Flight Children of the Fleet The First Formic War (with Aaron Johnston) Earth Unaware / Earth Afire / Earth Awakens The Second Formic War (with Aaron Johnston) The Swarm /The Hive Ender novellas A War of Gifts /First Meetings",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2011,
        "thumbnail": "http://books.google.com/books/content?id=jaM7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781479442157",
        "title": "Planet Comics #1",
        "author": "Ken Jackson",
        "description": "Planet Comics launched in January, 1940 as a companion to the famous pulp magazine Planet Stories. Both features exciting tales of action-adventure in a \"space opera\" universe. This is the first issue of Planet Comics, reproduced from a surviving original copy of the comic book. .",
        "category": "Comics",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2024,
        "thumbnail": "http://books.google.com/books/content?id=E8yJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781643379470",
        "title": "The History of Science Fiction: A Graphic Novel Adventure",
        "author": "Xavier Dollo",
        "description": "Journey through time and space with this graphic novel history of the science fiction genre.",
        "category": "Comics",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2004,
        "thumbnail": "http://books.google.com/books/content?id=r1A-EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781735168623",
        "title": "The Rose Vol. 1 A Dystopian Science Fiction Thriller",
        "author": "Pd Alleva",
        "description": "Sandy Cox believed WW3 was over. But for those Alien Vampires, war has just begun. Forty-eight hours after a World War 3 treaty is signed Sandy Cox awakens in an underground compound unable to move. Tied to machines, she screams for help but no one answers. At least no one human. And they've taken her unborn child. Phil is a rebel freedom fighter who has had more than his share of Alien Vampires. Armed with The Blades, a sacred alien martial arts weapon, he enters the compound on a mission to find Sandy. But as he battles through the compound, Phil discovers Sandy has her own agenda. Finding her stolen child is all that matters. But the Vampires have their own plan and Sandy's baby is at the heart of their diabolical plot. Joined by a crew of rogue soldiers, they must navigate the underground compound, combating genetically mutated humans, aliens, and monsters. When battling Alien Vampires, one thing is certain...Get Ready To Bleed! Fans of The Hunger Games, Blake Crouch, VE Schwab, Star Wars, and Ancient Aliens will be fascinated by this high-powered, edge-of-your-seat dystopian science fiction thriller.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2022,
        "thumbnail": "http://books.google.com/books/content?id=ECrWzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9781984820662",
        "title": "The Paradox Hotel",
        "author": "Rob Hart",
        "description": "“Time travel, murder, corruption, restless baby dinosaurs, and a snarky robot named Ruby collide in this excellent, noir-inflected, humor-infused, science-fiction thriller.”—The Boston Globe An impossible crime. A detective on the edge of madness. The future of time travel at stake. From the author of The Warehouse . . . FINALIST FOR THE LAMBDA LITERARY AWARD • ONE OF THE BEST BOOKS OF THE YEAR: NPR, Kirkus Reviews January Cole’s job just got a whole lot harder. Not that running security at the Paradox was ever really easy. Nothing’s simple at a hotel where the ultra-wealthy tourists arrive costumed for a dozen different time periods, all eagerly waiting to catch their “flights” to the past. Or where proximity to the timeport makes the clocks run backward on occasion—and, rumor has it, allows ghosts to stroll the halls. None of that compares to the corpse in room 526. The one that seems to be both there and not there. The one that somehow only January can see. On top of that, some very important new guests have just checked in. Because the U.S. government is about to privatize time-travel technology—and the world’s most powerful people are on hand to stake their claims. January is sure the timing isn’t a coincidence. Neither are those “accidents” that start stalking their bidders. There’s a reason January can glimpse what others can’t. A reason why she’s the only one who can catch a killer who’s operating invisibly and in plain sight, all at once. But her ability is also destroying her grip on reality—and as her past, present, and future collide, she finds herself confronting not just the hotel’s dark secrets but her own. At once a dazzlingly time-twisting murder mystery and a story about grief, memory, and what it means to—literally—come face-to-face with our ghosts, The Paradox Hotel is another unforgettable speculative thrill ride from acclaimed author Rob Hart.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=h86UEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781504039574",
        "title": "Forever Free",
        "author": "Joe Haldeman",
        "description": "Civilian life in space yields epic challenges for two married ex-soldiers in this visionary science fiction adventure sequel—now with a bonus story. Ranked at the top of virtually every list of the greatest military science fiction adventures ever written is Joe Haldeman’s Hugo and Nebula Award–winning classic, The Forever War, now celebrating its 50th anniversary. In Forever Free, the Science Fiction Writers of America Grand Master and author of the acclaimed Worlds series returns to that same volatile universe where human soldiers once engaged the alien Taurans in never-ending battle. While loyal soldier William Mandella was fighting for the survival of the human race in a distant galaxy, thousands of years were passing on his home planet, Earth. Then, with the end of the hostilities came the shocking realization that humanity had evolved into something he did not recognize. Offered the choice of retaining his individuality or becoming part of the genetically modified shared Human hive-mind, Mandella chose exile, joining other veterans of the Forever War seeking a new life on a wasteland world they called Middle Finger. Making a home for themselves in this half-frozen hell, Mandella and his life partner, Marygay, have survived into middle age, raising a son and a daughter in the process. Now, the dark truth about the colonists’ ultimate role in the continuation of the Human group mind will force Mandella and Marygay to take desperate action as they hijack an interstellar vessel and set off on a frantic escape across space and time. But what awaits them upon their return is a mystery far beyond all human—or Human—comprehension . . . In Forever Free, Joe Haldeman’s stunning vision of humankind’s far future reaches its enthralling conclusion in a masterwork of speculation from the mind and heart of one of the undisputed champions of hard science fiction. And in the bonus story included in this volume, “A Separate War,” Marygay, reassigned and separated from her lover, Mandella, continues fighting in military engagements across the stars—all the while planning how she and Mandella can reunite despite the time and space between them.",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2008,
        "thumbnail": "http://books.google.com/books/content?id=0RS4DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781529069082",
        "title": "Classic Science Fiction Stories",
        "author": "Adam Roberts",
        "description": "An entertaining and wide-ranging collection of science-fiction short stories featuring space aliens, spectacular inventions, futuristic technologies and vividly imagined worlds. Part of the Macmillan Collector’s Library; a series of stunning, cloth-bound, pocket-sized classics with gold foiled edges and ribbon markers. These beautiful books make perfect gifts or a treat for any book lover. Classic Science Fiction Stories is selected and introduced by academic and science-fiction writer Adam Roberts. Classic Science Fiction Stories highlights not only famous writers such as Edgar Allan Poe, H. G. Wells and H. P. Lovecraft, but also gives voice to lesser known but equally inventive writers such as Florence McLandburgh and Ambrose Bierce. Spanning the 1750s to the early twentieth century, these mesmerizing and expertly crafted stories are by turns intriguing, terrifying and, at times, downright comic. Together they show how science fiction took root to develop into the global phenomenon it is today.",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2012,
        "thumbnail": "http://books.google.com/books/content?id=ruJMEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781452135274",
        "title": "Super Graphic",
        "author": "Tim Leong",
        "description": "The comic book universe is adventurous, mystifying, and filled with heroes, villains, and cosplaying Comic-Con attendees. This book by one of Wired magazine's art directors traverses the graphic world through a collection of pie charts, bar graphs, timelines, scatter plots, and more. Super Graphic offers readers a unique look at the intricate and sometimes contradictory storylines that weave their way through comic books, and shares advice for navigating the pages of some of the most popular, longest-running, and best-loved comics and graphic novels out there. From a colorful breakdown of the DC Comics reader demographic to a witty Venn diagram of superhero comic tropes and a Chris Ware sadness scale, this book charts the most arbitrary and monumental characters, moments, and equipment of the wide world of comics. Plus, this is the fixed format version, which includes high-resolution images.",
        "category": "Comics",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=fdlOAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781952203428",
        "title": "Sentient",
        "author": "Jeff Lemire",
        "description": "TKO Studios presents \"Sentient\" by Eisner Award-winners Jeff Lemire (Black Hammer) and Gabriel Walta (The Vision) From Eisner Award-winners Jeff Lemire (Black Hammer) and Gabriel Walta (The Vision). When an attack kills the adults on a colony ship, the on-board A.I. VALARIE must help the ship’s children survive the perils of space. Can Valarie rise to the task?",
        "category": "Comics",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2022,
        "thumbnail": "http://books.google.com/books/content?id=WyxcEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781101870839",
        "title": "Imagine Wanting Only This",
        "author": "Kristen Radtke",
        "description": "A gorgeous graphic memoir about loss, love, and confronting grief. • “What ultimately emerges is a portrait of a powerful mind grappling with alienation and loneliness.” —The New York Times Book Review When Kristen Radtke was in college, the sudden death of a beloved uncle and the sight of an abandoned mining town after his funeral marked the beginning moments of a lifelong fascination with ruins and with people and places left behind. Over time, this fascination deepened until it triggered a journey around the world in search of ruined places. Now, in this genre-smashing graphic memoir, she leads us through deserted cities in the American Midwest, an Icelandic town buried in volcanic ash, islands in the Philippines, New York City, and the delicate passageways of the human heart. Along the way, we learn about her family and a rare genetic heart disease that has been passed down through generations, and revisit tragic events in America’s past. A narrative that is at once narrative and factual, historical and personal, Radtke’s stunning illustrations and piercing text never shy away from the big questions: Why are we here, and what will we leave behind? (With black-and-white illustrations throughout; part of the Pantheon Graphic Novel series)",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2004,
        "thumbnail": "http://books.google.com/books/content?id=7gBmDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781449474560",
        "title": "Big Nate: Welcome to My World",
        "author": "Lincoln Peirce",
        "description": "Nate Wright’s life is just like his locker--it’s full of surprises. The monstrous Mrs. Godfrey springs a pop quiz on Nate AND his grandparents. His horoscope predicts bad news for Nate’s soccer career. And worst of all, he’s forced to cut back on his beloved Cheez Doodles. It’s enough to drive any kid crazy. Luckily, Nate’s not just any kid. He’s the ultimate sixth-grade survivor. When everything’s falling apart, he finds a way to hold it together … but nobody said it would be easy. Welcome to the world of Big Nate!",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2006,
        "thumbnail": "http://books.google.com/books/content?id=xbHMCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780823059782",
        "title": "Zap!",
        "author": "Bryan Baugh",
        "description": "Star Wars, Star Trek, Alien, Predator, The Matrix - part of the appeal of great science fiction is its distinctive look. Now, withZap! How to Draw Fantastic Sci-Fi Comics,artists everywhere can learn to create their own sci-fi realities and to draw space heroes and heroines, intergalactic villains, robots, spaceships, blasting rockets, slimy aliens, and much more. A history of science-fiction comics is followed by an overview of the genre illustrated by the masters, including Alex Raymond (creator of Flash Gordon), Wally Wood (who shaped the look of 1950s sci-fi), and Basil Wolverton (whose bizarre art launched a thousand mid-century sci-fi stories). Then readers turn to Bryan Baugh’s clear, detailed step-by-step instruction on how to draw dynamic cosmic action figures plus all the futuristic technology they can dream up. Perfect for artists, fans, even writers,Zap! How to Draw Fantastic Sci-Fi Comicslets the art of the future spring from the art of the past.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2024,
        "thumbnail": "http://books.google.com/books/content?id=0l4UID9J1uEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781606996089",
        "title": "The Comics Journal Library",
        "author": "Gary Groth",
        "description": "The Comics Journal Library series is the most comprehensive series of lavishly illustrated interviews conducted with cartoonists ever published. To celebrate our republication of the legendary EC line, we proudly present the first of a two-volume set of interviews with the artists and writers (and publisher!) who made EC great. Included in the first volume: career-spanning conversations with EC legends Will Elder, John Severin, Harvey Kurtzman, and Al Feldstein, as well as short interviews with EC short-timers Frank Frazetta and Joe Kubert. Also: EC Publisher William Gaines on his infamous Senate subcommittee testimony, and probing conversations between Silver Age cartoonist Gil Kane and Harvey Kurtzman, as well as contemporary alternative cartoonist Sam Henderson and MAD great Al Jaffee. Part of what made EC the best publisher in the history of mainstream comics was some of the most beautiful drawing ever published in comic books, and every interview is profusely illustrated by pertinent examples of the work under discussion.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2000,
        "thumbnail": "http://books.google.com/books/content?id=msB7DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780226453835",
        "title": "Mutants and Mystics",
        "author": "Jeffrey J. Kripal",
        "description": "\"Account of how comic book heroes have helped their creators and fans alike explore and express a wealth of paranormal experiences ignored by mainstream science. Delving deeply into the work of major figures in the field - from Jack Kirby's cosmic superhero sagas and Philip K. Dick's futuristic head-trips to Alan Moore's sex magic and Whitley Strieber's communion with visitors - Kripal shows how creators turned to science fiction to convey the reality of the inexplicable and the paranormal they experienced in their lives. Expanded consciousness found its language in the metaphors of sci-fi - incredible powers, unprecedented mutations, time-loops and vast intergalactic intelligences - and the deeper influences of mythology and religion that these in turn drew from ; the wildly creative work that followed caught the imaginations of millions. Moving deftly from Cold War science and Fredric Wertham's anticomics crusade to gnostic revelation and alien abduction, Kripal spins out a hidden history of American culture, rich with mythical themes and shot through with an awareness that there are other realities far beyond our everyday understanding.\"--Jacket.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2019,
        "thumbnail": "http://books.google.com/books/content?id=8kNjcn8KsuUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780873499934",
        "title": "Standard Catalog of Comic Books",
        "author": "John Miller",
        "description": "This reference features more than 5,000 new issues and more than 50,000 new facts about comic books published in North America in the last 70 vears.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2017,
        "thumbnail": "http://books.google.com/books/content?id=auUpAAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9781779511737",
        "title": "V for Vendetta Book & Mask Set",
        "author": "ALAN. MOORE",
        "description": "In a world without political freedom, personal freedom and precious little faith in anything comes a mysterious man in a white porcelain mask who fights political oppressors through terrorism and seemingly absurd acts. It's a gripping tale of the blurred lines between ideological good and evil. The inspiration for the hit 2005 movie starring Natalie Portman and Hugo Weaving, this amazing graphic novel is packaged with a collectable reproduction of the iconic V mask.",
        "category": "Comics",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2014,
        "thumbnail": "http://books.google.com/books/content?id=_teQEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9781888669206",
        "title": "ComicBook Babylon",
        "author": "Clifford Meth",
        "description": "Digital version of Clifford Meth's ComicBook Babylon",
        "category": "Comics",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=31DBAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781934331415",
        "title": "Wally Wood",
        "author": "Wallace Wood",
        "description": "\"Strange Worlds of Science Fiction is the most extensive collection to-date, of sci-fi comics by Hall of Fame creator Wallace Wood.\"--P. [4] of cover.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2014,
        "thumbnail": "http://books.google.com/books/content?id=B3Q0SgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9781781381434",
        "title": "Surrealism, Science Fiction and Comics",
        "author": "Gavin Parkinson",
        "description": "The first book to look at the relationship either between Surrealism and Science Fiction or between Surrealism and comics.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=ySI9DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781839644801",
        "title": "Black Sci-Fi Short Stories",
        "author": "Tia Ross",
        "description": "\"With topics ranging from slavery to space travel, the impressive breadth of this anthology makes for a well-rounded survey. Readers, writers, and scholars alike will find great value here.\" — Publishers Weekly Starred Review A deluxe edition of new writing and neglected perspectives. Dystopia, apocalypse, gene-splicing, cloning and colonization are explored here by new authors and combined with proto-sci-fi and speculative writing of an older tradition (by W.E.B. Du Bois, Martin R. Delany, Sutton E. Griggs, Pauline Hopkins and Edward Johnson) whose first-hand experience of slavery and denial created their living dystopia. With a foreword by Alex Award-winning novelist Temi Oh, an introduction by Dr. Sandra M. Grayson, author of Visions of the Third Millennium: Black Science Fiction Novelists Write the Future (2003), and invaluable promotion and editorial support from Tia Ross and the Black Writers Collective and more, this latest offering in the Flame Tree Gothic fantasy series focuses on an area of science fiction which has not received the attention it deserves. Many of the themes in Sci-fi reveal the world as it is to others, show us how to improve it, and give voice to the many different expressions of a future for humankind. The Flame Tree Gothic Fantasy, Classic Stories and Epic Tales collections bring together the entire range of myth, folklore and modern short fiction. Highlighting the roots of suspense, supernatural, science fiction and mystery stories, the books in Flame Tree Collections series are beautifully presented, perfect as a gift and offer a lifetime of reading pleasure. Table of Contents: An Empty, Hollow Interview by James Beamon The Comet by W.E.B. Du Bois Élan Vital by K. Tempest Bradford The Orb by Tara Campbell Blake, or The Huts of America by Martin R. Delany The Floating City of Pengimbang by Michelle F. Goddard The New Colossuses by Harambee K. Grey-Sun Imperium in Imperio by Sutton E. Griggs Seven Thieves by Emmalia Harrington Of One Blood: Or, The Hidden Self by Pauline Hopkins Space Traitors by Walidah Imarisha The Line of Demarcation by Patty Nicole Johnson Light Ahead for the Negro by Edward Johnson e-race by Russell Nichols Giant Steps by Russell Nichols Almost Too Good to Be True by Temi Oh You May Run On by Megan Pindling Suffering Inside, But Still I Soar by Sylvie Soul The Pox Party by Lyle Stiles The Regression Test by Wole Talabi",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2005,
        "thumbnail": "http://books.google.com/books/content?id=BGWczQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9781786182999",
        "title": "Firewalkers",
        "author": "Adrian Tchaikovsky",
        "description": "FIREWALKERS ARE BRAVE FIREWALKERS ARE RESOURCEFUL FIREWALKERS ARE EXPENDABLE The Earth is burning. Nothing can survive at the Anchor; not without water and power. But the ultra-rich, waiting for their ride off the dying Earth? They can buy water. And thanks to their investment, the sun can provide power. But someone has to repair the solar panels when they fail, down in the deserts below. Kids like Mao, and Lupé, and Hotep; kids with brains and guts but no hope. The Firewalkers. “This is a must-read for fans of dystopian and climate change fiction.” - Publishers Weekly, Starred Review",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2005,
        "thumbnail": "http://books.google.com/books/content?id=ndrQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780553573916",
        "title": "The Icarus Hunt",
        "author": "Timothy Zahn",
        "description": "From Timothy Zahn, Hugo Award winner and New York Times bestselling author of two landmark Star Wars® series, comes an original new tale featuring a renegade space pilot, his unusual alien partner, and an unknown cargo that can change the course of galactic history. Jordan McKell has a problem with authority. Unfortunately for him, the iron-fisted authority of the powerful Patthaaunutth controls virtually every aspect of galactic shipping. In order to survive, Jordan ekes out a living dabbling in interstellar smuggling for outlaw concerns that represent the last vestiges of free trade in the galaxy. So when Jordan and his partner, Ixil--an alien with two ferret-like \"outhunters\" linked to his neural system--are hired by a mysterious gentleman to fly a ship and its special cargo to Earth, they jump at the job. Caution has never been one of Jordan's strong suits. But this time he may have taken on more than even he can handle. The ship, Icarus, turns out to be a ramshackle hulk, the ragtag crew literally picked up off the street, and the cargo so secret, it's sealed in a special container that takes up most of the cramped and ill-designed ship. As if that weren't bad enough, it looks like the authorities already suspect something is afoot, there's a saboteur aboard, and the Icarus appears to be shaking apart at the seams. It doesn't seem as if things could get any worse. That is, until a beautiful crew member helps McKell uncover the true nature of the cargo he's carrying. With his enemies closing in on the lumbering Icarus, the unknown saboteur still aboard, and authorities on Earth pressured to turn them in, McKell and Ixil become fugitives. Their only chance is to stay one step ahead of their pursuers as they try to make it home. A bold and epic novel filled with unrelenting action and a good dose of humor, The Icarus Hunt is a wild hyperspace romp through the galaxy.",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=XACUbfTZCgcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780307819246",
        "title": "The Mirror of Her Dreams",
        "author": "Stephen R. Donaldson",
        "description": "With The Chronicles of Thomas Covenant, Stephen R. Donaldson changed the face of fantasy fiction forever. In The Mirror of Her Dreams, the astonishing first novel in the two-volume Mordant’s Need series, Donaldson shows us a world of wondrous beauty and seductive illusion, where mirrors hold the deadliest of magics and nothing is what it seems. . . . The daughter of rich but neglectful parents, Terisa Morgan lives alone in a New York City apartment, a young woman who has grown to doubt her own existence. Surrounded by the flat reassurance of mirrors, she leads an unfulfilled life—until the night a strange man named Geraden comes crashing through one of her mirrors, on a quest to find a champion to save his kingdom of Mordant from a pervasive evil that threatens the land. Terisa is no champion. She wields neither magic nor power. And yet, much to her own surprise, when Geraden begs her to come back with him, she agrees. Now, in a culture where women are little more than the playthings of powerful men, in a castle honeycombed with secret passages and clever traps, in a kingdom threatened from without and within by enemies able to appear and vanish out of thin air, Terisa must become more than the pale reflection of a person. For the way back to Earth is closed to her. And the enemies of Mordant will stop at nothing to see her dead.",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2005,
        "thumbnail": "http://books.google.com/books/content?id=zUVwAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781849015356",
        "title": "The Mammoth Book of Extreme Science Fiction",
        "author": "Mike Ashley",
        "description": "Here are 25 stories of science fiction that push the envelope, by the biggest names in an emerging new crop of high-tech futuristic SF - including Charles Stross, Robert Reed, Alastair Reynolds, Peter Hamilton and Neal Asher. High-tech SF has made a significant comeback in the last decade, as bestselling authors successfully blend the super-science of 'hard science fiction' with real characters in an understandable scenario. It is perhaps a reflection of how technologically controlled our world is that readers increasingly look for science fiction that considers the fates of mankind as a result of increasing scientific domination. This anthology brings together the most extreme examples of the new high-tech, far-future science fiction, pushing the limits way beyond normal boundaries. The stories include: \"A Perpetual War Fought Within a Cosmic String\", \"A Weapon That Could Destroy the Universe\", \"A Machine That Detects Alternate Worlds and Creates a Choice of Christs\", \"An Immortal Dead Man Sent To The End of the Universe\", \"Murder in Virtual Reality\", \"A Spaceship So Large That There is An Entire Planetary System Within It\", and \"An Analytical Engine At The End of Time\", and \"Encountering the Untouchable.\"",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2020,
        "thumbnail": "http://books.google.com/books/content?id=_mHBBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781728248455",
        "title": "Widowland",
        "author": "C. J. Carey",
        "description": "2023 Philip K. Dick Award Nominee \"A compulsive, terrifying read.\"—Kate Quinn, New York Times bestselling author of The Rose Code For readers of Margaret Atwood's The Handmaid's Tale comes a thrilling feminist dystopian novel set in an alternative history that terrifyingly imagines what a British alliance with Germany would look like if the Nazis had won WWII. To control the past, they edited history. To control the future, they edited literature. LONDON, 1953. Thirteen years have passed since England surrendered to the Nazis and formed a Grand Alliance with Germany. It was forced to adopt many of its oppressive ideologies, one of which was the strict classification of women into hierarchical groups based on the perceived value they brought to society. Rose Ransom, a member of the privileged Geli class, remembers life from before the war but knows better than to let it show. She works for the Ministry of Culture, rewriting the classics of English literature to ensure there are no subversive thoughts that will give women any ideas. Outbreaks of insurgency have been seen across the country with graffiti made up of seditious lines from forbidden works by women painted on public buildings. Suspicion has fallen on Widowland, the run-down slums where childless women over fifty have been banished. Rose is given the dangerous task of infiltrating Widowland to find the source of the rebellion before the Leader arrives in England for the Coronation ceremony of King Edward VIII and Queen Wallis. Will Rose follow her instructions and uncover the criminals? Or will she fight for what she knows in her heart is right? Praise for Widowland: \"A mind-bender of a novel about the power of literature to change minds. I loved it!\" —Mark Sullivan, bestselling author of The Last Green Valley and Beneath a Scarlet Sky \"I rarely come across a book I can't put down but I devoured this one.\" —Rhys Bowen, New York Times bestselling author of two historical mystery series as well as several internationally bestselling historical novels \"An electrifying, Orwellian dystopia with a thrilling feminist twist.\" —Lara Prescott, New York Times bestselling author of The Secrets We Kept \"Tense, thought-provoking, and terrifying.\" —Natalie Jenner, international bestselling author of The Jane Austen Society and Bloomsbury Girls",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=gGpMEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781612100289",
        "title": "Four Miles Within",
        "author": "Anthony Gilmore",
        "description": "Far down into the earth goes a gleaming metal sphere whose passengers are deadly enemies.",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2022,
        "thumbnail": "http://books.google.com/books/content?id=Eybbg3VCx1EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781611099690",
        "title": "Brilliance",
        "author": "Marcus Sakey",
        "description": "Federal agent Nick Cooper draws on his supernatural ability to eliminate terrorists to hunt down a dangerous man who committed a horrific massacre on Wall Street that left hundreds dead and injured.",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2007,
        "thumbnail": "http://books.google.com/books/content?id=JkzVlAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9780441478125",
        "title": "The Left Hand of Darkness",
        "author": "Ursula K. Le Guin",
        "description": "50TH ANNIVERSARY EDITION—WITH A NEW INTRODUCTION BY DAVID MITCHELL AND A NEW AFTERWORD BY CHARLIE JANE ANDERS Ursula K. Le Guin’s groundbreaking work of science fiction—winner of the Hugo and Nebula Awards. A lone human ambassador is sent to the icebound planet of Winter, a world without sexual prejudice, where the inhabitants’ gender is fluid. His goal is to facilitate Winter’s inclusion in a growing intergalactic civilization. But to do so he must bridge the gulf between his own views and those of the strange, intriguing culture he encounters... Embracing the aspects of psychology, society, and human emotion on an alien world, The Left Hand of Darkness stands as a landmark achievement in the annals of intellectual science fiction.",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2002,
        "thumbnail": "http://books.google.com/books/content?id=gD9gDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780547824086",
        "title": "The Trap",
        "author": "Steven Arntson",
        "description": "In 1963, when twins Henry and Helen and their best friends Alan and Nicki try to find Alan's missing brother Carl, they stumble into the knowledge of their \"subtle forms\" that can separate from their physical bodies, and into a criminal's plot to make himself immortal--at any expense.",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=t610BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780425181119",
        "title": "Strangers",
        "author": "Dean Koontz",
        "description": "“The plot twists ingeniously...an engaging, often chilling book.”—The New York Times Book Review A writer in California. A doctor in Boston. A motel owner and his employee in Nevada. A priest in Chicago. A robber in New York. A little girl in Las Vegas. They’re a handful of people from across the country, living through eerie variations of the same nightmare. A dark memory is calling out to them. And soon they will be drawn together, deep in the heart of a sprawling desert, where the terrifying truth awaits...",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2013,
        "thumbnail": "http://books.google.com/books/content?id=CUAWZvJy2EoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780316134675",
        "title": "Leviathan Wakes",
        "author": "James S. A. Corey",
        "description": "From a New York Times bestselling and Hugo award-winning author comes a modern masterwork of science fiction, introducing a captain, his crew, and a detective as they unravel a horrifying solar system wide conspiracy that begins with a single missing girl. Now a Prime Original series. Humanity has colonized the solar system—Mars, the Moon, the Asteroid Belt and beyond—but the stars are still out of our reach. Jim Holden is XO of an ice miner making runs from the rings of Saturn to the mining stations of the Belt. When he and his crew stumble upon a derelict ship, the Scopuli, they find themselves in possession of a secret they never wanted. A secret that someone is willing to kill for—and kill on a scale unfathomable to Jim and his crew. War is brewing in the system unless he can find out who left the ship and why. Detective Miller is looking for a girl. One girl in a system of billions, but her parents have money and money talks. When the trail leads him to the Scopuli and rebel sympathizer Holden, he realizes that this girl may be the key to everything. Holden and Miller must thread the needle between the Earth government, the Outer Planet revolutionaries, and secretive corporations—and the odds are against them. But out in the Belt, the rules are different, and one small ship can change the fate of the universe. \"Interplanetary adventure the way it ought to be written.\" —George R. R. Martin The Expanse Leviathan Wakes Caliban's War Abaddon's Gate Cibola Burn Nemesis Games Babylon's Ashes Persepolis Rising Tiamat's Wrath ​Leviathan Falls Memory's Legion The Expanse Short Fiction Drive The Butcher of Anderson Station Gods of Risk The Churn The Vital Abyss Strange Dogs Auberon The Sins of Our Fathers",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2005,
        "thumbnail": "http://books.google.com/books/content?id=yud-foXqGUEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780316389662",
        "title": "Six Wakes",
        "author": "Mur Lafferty",
        "description": "In this Hugo nominated science fiction thriller by Mur Lafferty, a crew of clones awakens aboard a space ship to find they're being hunted-and any one of them could be the killer. Maria Arena awakens in a cloning vat streaked with drying blood. She has no memory of how she died. This is new; before, when she had awakened as a new clone, her first memory was of how she died. Maria's vat is one of seven, each one holding the clone of a crew member of the starship Dormire, each clone waiting for its previous incarnation to die so it can awaken. And Maria isn't the only one to die recently. . . Unlock the bold new science fiction thriller that Corey Doctorow calls Mur's \"breakout book\".",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2012,
        "thumbnail": "http://books.google.com/books/content?id=QDWnCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780593332030",
        "title": "Writer's Market 100th Edition",
        "author": "Robert Lee Brewer",
        "description": "The most trusted guide to getting published, fully revised and updated Want to get published and paid for your writing? Let Writer's Market, 100th edition guide you through the process. It's the ultimate reference with thousands of publishing opportunities for writers, listings for book publishers, consumer and trade magazines, contests and awards, and literary agents—as well as new playwriting and screenwriting sections, along with contact and submission information. Beyond the listings, you'll find articles devoted to the business and promotion of writing. Discover 20 literary agents actively seeking writers and their writing, how to develop an author brand, and overlooked funds for writers. This 100th edition also includes the ever-popular pay-rate chart and book publisher subject index. You'll gain access to: Thousands of updated listings for book publishers, magazines, contests, and literary agents Articles devoted to the business and promotion of writing A newly revised \"How Much Should I Charge?\" pay rate chart Sample query letters for fiction and nonfiction Lists of professional writing organizations",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=PTBGEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780575090798",
        "title": "Eversion",
        "author": "Alastair Reynolds",
        "description": "Eversion is a superb, original Gothic SF novel. A small group of intrepid explorers are in search of a remote and mysterious artefact. It's a well-funded expedition, well organised, which is lucky as they're sailing north of Bergen on the schooner Demeter, searching for a narrow inlet which will lead them to a vast uncharted lake - and their goal-- Until disaster strikes. Doctor Silas Coade wakes from disturbing dreams, on the steamship Demeter, in pursuit of an extraordinary find almost too incredible and too strange to believe, secreted within a lagoon in the icy inlets of Patagonia. But as they come in sight of their prize he and the crew see they are not the first to come so far: there is a wreck ahead, and whatever ruined it may threaten them as well-- Shaking off his nightmares, Doctor Silas Coade joins his fellow exploders on the deck of the zeppelin Demeter and realises something has already gone dangerously wrong with their mission. If any of them are to survive, then he will have to take the exploration - and their lives - into his own hands . . .",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2018,
        "thumbnail": "http://books.google.com/books/content?id=S0tUEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9781789543223",
        "title": "Winter World",
        "author": "A. G. Riddle",
        "description": "'Apocalyptic sci-fi at its best... The action is anything but frozen' DAILY MAIL. WITHIN THREE MONTHS, ICE WILL COVER THE EARTH, AND LIFE AS WE KNOW IT WILL END. It was the last thing we expected, but the world is freezing. A new ice age has dawned and humanity has been forced to confront its own extinction. Billions have fled the glaciers, crowding out the world's last habitable zones. They can run from the ice, but they can't escape human nature: a cataclysmic war is coming. In orbit, a group of scientists is running the Winter Experiments, a last-ditch attempt to understand why the planet is cooling. None of the climate models they build makes sense. But then they discover an anomaly, an unexplained variation in solar radiation... and something else. Close to the burning edge of the sun, they catch a fleeting glimpse of something that shouldn't be there... Suddenly humanity must face the possibility it is not alone in the universe. And the terrifying possibility that whatever is out there may be trying to exterminate us. 'A complex, multi-stranded narrative spanning 700 pages that reads like a superior collaboration between Dan Brown and Michael Crichton' THE GUARDIAN.",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2005,
        "thumbnail": "http://books.google.com/books/content?id=1xLsEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9781477830789",
        "title": "Poor Man's Fight",
        "author": "Elliott Kay",
        "description": "High school senior Tanner Malone has bombed the Test, a high-stakes exam that establishes how much he owes for his corporate-funded education. Burdened by a crushing debt that rules out college, Tanner enlists in the navy of Archangel, a star system with four terraformed worlds. But he hasn't factored in the space pirates. Just as Tanner begins basic training, the government ramps up its forces to confront a band of rowdy raiders who are wreaking havoc in the void. Led by complex and charismatic Captain Casey, the outlaws love a little murder and mayhem, but they are also democratic, egalitarian, and devoted to freeing each new recruit from debt and corporate oppression. Assigned to the front lines, Tanner soon finds himself caught in the crossfire between ruthless foes, cruel comrades, and unforgiving space. Can he do his duty when good and evil look so much alike?",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 1998,
        "thumbnail": "http://books.google.com/books/content?id=iUM4rgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9780312552459",
        "title": "SecondWorld",
        "author": "Jeremy Robinson",
        "description": "The high adventure of James Rollins meets the gripping suspense of Matthew Reilly in Robinson's explosive new thriller about an ex-Navy SEAL turned NCIS Special Agent sent to the world's only sub-oceanic research facility located off the Florida Keys.",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2022,
        "thumbnail": "http://books.google.com/books/content?id=1JR8rfcRRI4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780061802706",
        "title": "Gold",
        "author": "Isaac Asimov",
        "description": "The final collection of fiction and essays by the most celebrated science fiction author of all time—including the Hugo Award–winning story “Gold.” Isaac Asimov is widely considered both the inventor of science fiction as well as the genre’s greatest practitioner. This wide-ranging collection is the final and crowning achievement of his fifty-year career as a writer. It includes an introduction by the renowned science fiction author Orson Scott Card. The first section contains stories that range from the humorous to the profound, at the heart of which is the title story, “Gold,” a moving and revealing drama about a writer who gambles everything on a chance at immortality: a gamble Asimov himself made—and won. The second section contains the grand master’s ruminations on the SF genre itself. And the final section is comprised of Asimov’s thoughts on the craft and writing of science fiction.",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2010,
        "thumbnail": "http://books.google.com/books/content?id=E3WNSY_UgVsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780593197899",
        "title": "Killer Content",
        "author": "Olivia Blacke",
        "description": "It's murder most viral in this debut mystery by Olivia Blacke. Bayou transplant Odessa Dean has a lot to learn about life in Brooklyn. So far she's scored a rent free apartment in one of the nicest neighborhoods around by cat-sitting, and has a new job working at Untapped Books & Café. Hand-selling books and craft beers is easy for Odessa, but making new friends and learning how to ride the subway? Well, that might take her a little extra time. But things turn more sour than an IPA when the death of a fellow waitress goes viral, caught on camera in the background of a couple's flash-mob proposal video. Nothing about Bethany's death feels right to Odessa--neither her sudden departure mid-shift nor the clues that only Odessa seems to catch. As an up-and-coming YouTube star, Bethany had more than one viewer waiting for her to fall from grace. Determined to prove there's a killer on the loose, Odessa takes matters into her own hands. But can she pin down Bethany's killer before they take Odessa offline for good?",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2001,
        "thumbnail": "http://books.google.com/books/content?id=wwbhDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781592123421",
        "title": "Battlefield Earth",
        "author": "L. Ron Hubbard",
        "description": "Sadistic Aliens... ...Man is an endangered species. Is it the end of the world or the rebirth of a new one? In the year A.D. 3000, Earth is a dystopian wasteland. The great cities stand crumbling as a brutal reminder of what we once were. When the Psychlos invaded, all the world’s armies mustered little resistance against the advanced alien weapons. Now, the man animals serve one purpose. Do the Psychlos’ bidding or face extinction. One man, Jonnie Goodboy Tyler, has a plan. They must learn about the Psychlos and their weapons. He needs the other humans to follow him. And that may not be enough. Can he outwit his Psychlo captor, Terl? The fate of the Galaxy lies on the Battlefield of Earth. Get it now. “Pulse-pounding mile-a-minute sci-fi action-adventure that does not stop. It is a masterpiece of popular adventure science fiction.” —Brandon Sanderson “Battlefield Earth is like a 12-hour ‘Indiana Jones’ marathon. Non-stop and fast-paced. Every chapter has a big bang-up adventure.” —Kevin J. Anderson (co-author of the Dune Sagas) “Over 1,000 pages of thrills, spills, vicious aliens and noble humans. I found Battlefield Earth un-put-downable.” —Neil Gaiman",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2008,
        "thumbnail": "http://books.google.com/books/content?id=zh57CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781960332325",
        "title": "Timberwolf",
        "author": "Tom Julian",
        "description": "Once a top black ops agent, Timberwolf Velez's world shatters when he encounters Kizik, a malevolent psychic alien spider that leaves a lasting mark on his psyche. Haunted by his past, Timberwolf now faces an ominous threat as a religious fanatic unearths a hidden cache of unimaginably destructive weapons. Will Timberwolf rise above his shattered mind and prevent the galaxy from descending into irreversible chaos? With an ensemble of captivating characters and exhilarating twists at every turn, TIMBERWOLF: Book One in the Spy-Fi ‘Timberwolf’ Series will keep you on the edge of your seat. Brace yourself for a heart-pounding, action-packed page-turner that refuses to release its grip.",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2019,
        "thumbnail": "http://books.google.com/books/content?id=Kz4PEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781250778550",
        "title": "Dead Silence",
        "author": "S.A. Barnes",
        "description": "A Best Book of 2022 by the New York Public Library • One of the Best SFF Books of 2022 (Gizmodo) • One of the Best SF Mysteries of 2022 (CrimeReads) • A GoodReads Choice Award finalist for Best Science Fiction! Titanic meets Event Horizon in this SF horror novel in which a woman and her crew board a decades-lost luxury cruiser and find the wreckage of a nightmare that hasn't yet ended. Claire Kovalik is days away from being unemployed—made obsolete—when her beacon repair crew picks up a strange distress signal. With nothing to lose and no desire to return to Earth, Claire and her team decide to investigate. What they find is shocking: the Aurora, a famous luxury spaceliner that vanished on its maiden tour of the solar system more than twenty years ago. A salvage claim like this could set Claire and her crew up for life. But a quick search of the ship reveals something isn’t right. Whispers in the dark. Flickers of movement. Messages scrawled in blood. Claire must fight to hold on to her sanity and find out what really happened on the Aurora before she and her crew meet the same ghastly fate. \"Truly un-put-downable in its purest sense.” Chloe Gong, #1 New York Times bestselling author of These Violent Delights At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=Y9IuEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780063204225",
        "title": "The Measure",
        "author": "Nikki Erlick",
        "description": "INSTANT NEW YORK TIMES BESTSELLER - The Read With Jenna Today Show Book Club Pick! \"A story of love and hope as interweaving characters display: how all moments, big and small, can measure a life. If you want joy, love, romance, and hope—read with us.\" —Jenna Bush Hager A luminous, spirit-lifting blockbuster that asks: would you choose to find out the length of your life? Eight ordinary people. One extraordinary choice. It seems like any other day. You wake up, drink a cup of coffee, and head out. But today, when you open your front door, waiting for you is a small wooden box. The contents of this mysterious box tells you the exact number of years you will live. From suburban doorsteps to desert tents, every person on every continent receives the same box. In an instant, the world is thrust into a collective frenzy. Where did these boxes come from? What do they mean? Is there truth to what they promise? As society comes together and pulls apart, everyone faces the same shocking choice: Do they wish to know how long they’ll live? And, if so, what will they do with that knowledge? The Measure charts the dawn of this new world through an unforgettable cast of characters whose decisions and fates interweave with one another: best friends whose dreams are forever entwined, pen pals finding refuge in the unknown, a couple who thought they didn’t have to rush, a doctor who cannot save himself, and a politician whose box becomes the powder keg that ultimately changes everything. Enchanting and deeply uplifting, The Measure is an ambitious, invigorating story about family, friendship, hope, and destiny that encourages us to live life to the fullest.",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2002,
        "thumbnail": "http://books.google.com/books/content?id=vjQ_EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780989193672",
        "title": "The Maker War",
        "author": "D. M. C. Shaw",
        "description": "What if you lived in a world where you could 3D print anything you wanted-in an instant? And what if you could, just as quickly, rip apart any object and break it down into the dust of the universe? In the not-to-distant future, this earth-shattering technology is the reality. Matter, not money, has become the key to power.Young Zavier Vik follows his war-hero sister into the Global Maker Corps to make the world safer. But, while Makers use their OzTech printers to create and build, their enemies-the Rippers-seek to destroy and take away what people have.The Maker Corps recruits cadets with conditions like ADHD, anxiety, bipolar, and dyslexia, knowing these are strengths that feed \"fluid thinking\" in battle. Zavier and his squad members must work together, think quickly, and hold back the Ripper threat.Action-packed, entertaining, and surprising, The Maker War dares you to imagine what could be, if you could create whatever you imagine.",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2002,
        "thumbnail": "http://books.google.com/books/content?id=DUAjzAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9780991081301",
        "title": "Aegis Rising",
        "author": "S. S. Segran",
        "description": "A Plane Crash... A Hidden Valley... An Ancient Prophecy... A Cataclysmic Scheme... Mariah, Aari, Kody, Jag and Tegan have been lifelong friends. Surviving the crash of their small plane in northern Canada, the five awaken to find themselves in Dema-Ki, an uncharted valley inhabited by a mysterious people. Nursed back to health, the teenagers are soon cast into a life-altering adventure when a strange affliction wreaks havoc in this remote sanctuary. The Elders of the village believe that the five newcomers hold the key to the salvation of not only Dema-Ki, but that of all humanity as foretold in their prophecy. Skeptical at first, the five eventually grow to accept the possibilities of the prophecy after experiencing a series of baffling events. Unbeknownst to them, a renegade group of youths, zealously opposed to the initiation of the 'outsiders', soon begin their maneuvers to rid the village of the newcomers. As the dark forces around them accelerate, the five friends are compelled to discover faith in themselves and in the powers ascribed to them by the ancient prophecy. If they survive the perils in this valley, can they then garner the courage and conviction needed to face an ominous cloud gathering in the world outside?",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2015,
        "thumbnail": "http://books.google.com/books/content?id=7GYnngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9781618090058",
        "title": "How to Write Action Adventure Novels",
        "author": "Michael Newton",
        "description": "Fast-paced plots, white-knuckle moments, heart-stopping adventure. Learn how to pack your pages with action, from beginnings that grab to endings that leave your readers begging for more from the author of more than 180 novels. \"A vital book for authors wishing to add impact to their fiction. ...a very good analysis of the genre markets, a deft guide to the craft of modern fiction writing, & a glimpse into the life of the best-selling novelist-not the gazillionaires like King or Koontz of Mailer or whoever, but the scrivener who just makes a nice living at cranking out entertainment for the rest of us. Newton shows you many passages that don't quite make the grade (but went to press anyway, because that's often how it works) & chunks that he feels are golden. He berates you to make it all larger-than-life-that's the market!-but also stops you short of falling to mawkish self-parody. This is certainly a vital book for the mystery writer & those who do war stories, but I wouldn't hesitate to recommend it as a tonic before writing Western, Gothic, space adventure, or quest fantasy. It's worth ten bucks, & certainly a fiver, even though the world has changed so much since 1989.\" -Anthony D. Ravenscroft, Amazon.com reviewer",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2017,
        "thumbnail": "http://books.google.com/books/content?id=g5N6MwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "isbn": "9781466822832",
        "title": "West of Eden",
        "author": "Harry Harrison",
        "description": "From a Science Fiction Hall of Fame inductee, “intelligent reptiles battle stone age humans for control of an alternate Earth” (Kirkus Reviews). Sixty-five million years ago, a disastrous cataclysm eliminated three quarters of all life on Earth. Overnight, the age of dinosaurs ended. The age of mammals had begun. But what if history had happened differently? What if the reptiles had survived to evolve intelligent life? In West of Eden, bestselling author Harry Harrison has created a rich, dramatic saga of a world where the descendants of the dinosaurs struggled with a clan of humans in a battle for survival. Here is the story of Kerrick, a young hunter who grows to manhood among the dinosaurs, escaping at last to rejoin his own kind. His knowledge of their strange customs makes him the humans’ leader . . . and the dinosaurs’ greatest enemy. West of Eden is a monumental epic of love and savagery, bravery and hope. “A perfectly grand storyteller.” —David Brin, Hugo and Nebula Award–winning author of Star Tide Rising “Few commercial writers are more deserving of their popularity than Harrison, a fine writer who occasionally reaches brilliant heights.” —Publishers Weekly",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2014,
        "thumbnail": "http://books.google.com/books/content?id=47ftTsq76eMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781501138850",
        "title": "To Lose the Earth",
        "author": "Kirsten Beyer",
        "description": "The long-awaited follow-up to Voyager: Architects of Infinity from the New York Times bestselling author and cocreator of Star Trek: Picard! As the crew of the Full Circle fleet works to determine the fate of their lost ship, the Galen, a struggle for survival begins at the far edge of the galaxy. New revelations about Species 001, the race that built the biodomes that first drew the fleet to investigate planet DK-1116, force Admiral Kathryn Janeway to risk everything to learn the truth.",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2020,
        "thumbnail": "http://books.google.com/books/content?id=EHeNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780857661937",
        "title": "Empire State",
        "author": "Adam Christopher",
        "description": "THE EMPIRE STATE IS THE OTHER NEW YORK. A parallel-universe, Prohibition-era world of mooks and shamuses that is the twisted magic mirror to our bustling Big Apple, a place where sinister characters lurk around every corner while the great superheroes that once kept the streets safe have fallen into dysfunctional rivalries and feuds. Not that its colourful residents know anything about the real New York… until detective Rad Bradley makes a discovery that will change the lives of all its inhabitants. Playing on the classic Gotham conventions of the Batman comics and HBO’s Boardwalk Empire, debut author Adam Christopher has spun this smart and fast-paced superhero-noir adventure, the sort of souped-up thrill ride that will excite genre fans and general readers alike. File Under: Science Fiction [ Pocket Universe | Heroes or Villains | Speak Easy | Loyalties Divided ] e-book ISBN: 978-0-85766-194-4",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=bbNDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780765356611",
        "title": "The Long Man",
        "author": "Steve Englehart",
        "description": "Max August, an ageless man, and Dr. Pamela Blackwell attempt to prevent genocide by learning some real-world magick.",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=FRiS00A-KuwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781407180885",
        "title": "Sci-Fi Junior High",
        "author": "Scott Seegert",
        "description": "At Sci-Fi Junior High, everyone knows Kelvin Klosmo's scientist parents are geniuses, but Kelvin's own geniusness hasn't exactly ... kicked in yet. Can he keep his secret hidden, even when an evil scientist takes the form of a stuffed bunny and tries to conquer the universe? A hilarious illustrated story that's out of this world!",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=dLA3DgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780307822420",
        "title": "Conquerors' Heritage",
        "author": "Timothy Zahn",
        "description": "In Conquerors' Pride, Timothy Zahn, Hugo Award-winning author of the New York Times bestselling Star Wars(r) trilogy, unfurled an epic tale of drama and courage as the interstallar Commonwealth faced savage invasion by alien starships of unknown origin. Now he probes deeply into the world of the invaders themselves in one of the most powerful evocations of an alien society ever created. The Zhirrzh have won a temporary respite in their war with the barbarians. But the Human captive Pheylan Cavanaugh has escaped, and for that Thrr-gilag, the young Searcher, finds himself disgraced, his bond-engagement to a female of a rival clan imperilled. Soon he becomes a target of hidden and powerful forces seeking to remake Zhirrzh society in their own merciless image. His only hope is to prove that the overclan authorities are wrong: that it was not the Humans who started the war. But time is short. The forces of the Zhirrzh are overextended and face swift retaliation. The Zhirrzh have learned to conquer death itself -- but even that awesome power will be no match for the devastating might of the Human Conqueror armadas. Thrr-gilag soon comes to realize that his people face a two-fold threat: destruction by Human technology. . . or destruction from within.",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2015,
        "thumbnail": "http://books.google.com/books/content?id=AXOTGijuUEYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781429915113",
        "title": "The Peace War",
        "author": "Vernor Vinge",
        "description": "First in a quintessential hard-science fiction adventure, Hugo Award-winning author Vernor Vinge's The Peace War follows a scientist determined to put an end to the militarization of his greatest invention--and of the government behind it. The Peace Authority conquered the world with a weapon that never should have been a weapon--the \"bobble,\" a spherical force-field impenetrable by any force known to mankind. Encasing governmental installations and military bases in bobbles, the Authority becomes virtually omnipotent. But they've never caught Paul Hoehler, the maverick who invented the technology, and who has been working quietly for decades to develop a way to defeat the Authority. With the help of an underground network of determined, independent scientists and a teenager who may be the apprentice genius he's needed for so long, he will shake the world. At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2014,
        "thumbnail": "http://books.google.com/books/content?id=w9bQdmO4abcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780062306739",
        "title": "Last Day on Mars",
        "author": "Kevin Emerson",
        "description": "“Last Day on Mars is thrillingly ambitious and imaginative. Like a lovechild of Gravity and The Martian, it's a rousing space opera for any age, meticulously researched and relentlessly paced, that balances action, science, humor, and most importantly, two compelling main characters in Liam and Phoebe. A fantastic start to an epic new series.” —Soman Chainani, New York Times bestselling author of the School for Good and Evil series “Emerson's writing explodes off the page in this irresistible space adventure, filled with startling plot twists, diabolical aliens, and (my favorite!) courageous young heroes faced with an impossible task.” —Lisa McMann, New York Times bestselling author of the Unwanteds series It is Earth year 2213—but, of course, there is no Earth anymore. Not since it was burned to a cinder by the sun, which has mysteriously begun the process of going supernova. The human race has fled to Mars, but this was only a temporary solution while we have prepared for a second trip: a one-hundred-fifty-year journey to a distant star, our best guess at where we might find a new home. Liam Saunders-Chang is one of the last humans left on Mars. The son of two scientists who have been racing against time to create technology vital to humanity’s survival, Liam, along with his friend Phoebe, will be on the last starliner to depart before Mars, like Earth before it, is destroyed. Or so he thinks. Because before this day is over, Liam and Phoebe will make a series of profound discoveries about the nature of time and space and find out that the human race is just one of many in our universe locked in a dangerous struggle for survival.",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=MHQ1DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9781473619777",
        "title": "The Long Way to a Small, Angry Planet",
        "author": "Becky Chambers",
        "description": "LONGLISTED FOR THE BAILEY'S WOMEN'S PRIZE FOR FICTION 'A quietly profound, humane tour de force' Guardian The beloved debut novel that will restore your faith in humanity #SmallAngryPlanet When Rosemary Harper joins the crew of the Wayfarer, she isn't expecting much. The ship, which has seen better days, offers her everything she could possibly want: a small, quiet spot to call home for a while, adventure in far-off corners of the galaxy, and distance from her troubled past. But Rosemary gets more than she bargained for with the Wayfarer. The crew is a mishmash of species and personalities, from Sissix, the friendly reptillian pilot, to Kizzy and Jenks, the constantly sparring engineers who keep the ship running. Life on board is chaotic, but more or less peaceful - exactly what Rosemary wants. Until the crew are offered the job of a lifetime: the chance to build a hyperspace tunnel to a distant planet. They'll earn enough money to live comfortably for years... if they survive the long trip through war-torn interstellar space without endangering any of the fragile alliances that keep the galaxy peaceful. But Rosemary isn't the only person on board with secrets to hide, and the crew will soon discover that space may be vast, but spaceships are very small indeed. PRAISE FOR THE WAYFARERS 'Never less than deeply involving' DAILY MAIL 'Explores the quieter side of sci-fi while still wowing us with daring leaps of imagination' iBOOKS 'So much fun to read' HEAT 'Chambers is simply an exceptional talent, quietly and beautifully redefining the space opera' TOR.COM 'The most fun that I've had with a novel in a long, long time' iO9",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2024,
        "thumbnail": "http://books.google.com/books/content?id=dgFxCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780345490711",
        "title": "Judas Unchained",
        "author": "Peter F. Hamilton",
        "description": "WALL STREET JOURNAL BESTSELLER • “An interstellar suspense thriller . . . sweeping in scope and emotional range.”—San Antonio Express-News In the star-spanning civilization known as the Intersolar Commonwealth, twenty-three planets have fallen victim to the Prime, a technologically advanced alien species genetically hardwired to exterminate all other forms of life. But the Prime is not the only threat. The Starflyer, an alien with mind-control abilities impossible to detect or resist, has secretly infiltrated the Commonwealth and is sabotaging the war effort. Is the Starflyer an ally of the Prime, or has it orchestrated a fight to the death between the two species for its own advantage? Caught between two deadly enemies, the fractious Commonwealth must unite as never before. This will be humanity’s finest hour—or its last gasp. Praise for Judas Unchained, the sequel to Pandora’s Star “Bristles with the energy of golden age SF, but the style and characterizations are polished and modern.”—SF Site “You’re in for quite a ride.”—The Santa Fe New Mexican “The reader is left breathless in amazement.”—SFRevu",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2009,
        "thumbnail": "http://books.google.com/books/content?id=j1WZfzhwzaQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "isbn": "9780062431677",
        "title": "Departure",
        "author": "A. G. Riddle",
        "description": "From the author of the #1 bestselling The Atlantis Gene comes a new novel in which the world’s past and future rests in the hands of five unwitting strangers in this definitive edition of A. G. Riddle's time-traveling, mind-bending speculative thriller. En route to London from New York, Flight 305 suddenly loses power and crash-lands in the English countryside, plunging a group of strangers into a mysterious adventure that will have repercussions for all of humankind. Struggling to stay alive, the survivors soon realize that the world they’ve crashed in is very different from the one they left. But where are they? Why are they here? And how will they get back home? Five passengers seem to hold clues about what’s really going on: writer Harper Lane, venture capitalist Nick Stone, German genetic researcher Sabrina Schröder, computer scientist Yul Tan, and Grayson Shaw, the son of a billionaire philanthropist. As more facts about the crash emerge, it becomes clear that some in this group know more than they’re letting on—answers that will lead Harper and Nick to uncover a far-reaching conspiracy involving their own lives. As they begin to piece together the truth, they discover they have the power to change the future and the past—to save our world . . . or end it. A wildly inventive and propulsive adventure full of hairpin twists, Departure is a thrilling tale that weaves together power, ambition, fate, memory, and love, from a bold and visionary talent.",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2013,
        "thumbnail": "http://books.google.com/books/content?id=rqHgBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
]