[
    {
        "title": "Ascent (The Invasion Chronicles—Book Three): A Science Fiction Thriller",
        "author": "Morgan Rice",
        "description": "“TRANSMISSION is riveting, unexpected, and firmly rooted in strong psychological profiles backed with thriller and sci-fi elements: what more could readers wish for? (Just the quick publication of Book Two, Arrival.)” --Midwest Book Review From #1 worldwide bestselling fantasy author Morgan Rice comes book #3 in a long-anticipated science fiction series. With planet Earth destroyed, what will become of 13 year old Kevin and Chloe in the mother ship? Will the aliens enslave them? What do they want? Is there any hope of escape? And will Kevin and Chloe ever return to Earth again? “Action-packed …. Rice’s writing is solid and the premise intriguing.” –Publishers Weekly, re A Quest of Heroes “A superior fantasy… A recommended winner for any who enjoy epic fantasy writing fueled by powerful, believable young adult protagonists.” –Midwest Book Review, re Rise of the Dragons “An action packed fantasy sure to please fans of Morgan Rice’s previous novels, along with fans of works such as THE INHERITANCE CYCLE by Christopher Paolini…. Fans of Young Adult Fiction will devour this latest work by Rice and beg for more.” –The Wanderer, A Literary Journal (regarding Rise of the Dragons) Book #4 in the series is also now available! Also available are Morgan Rice’s many series in the fantasy genre, including A QUEST OF HEROES (BOOK #1 IN THE SORCERER’S RING), a free download with over 1,300 five star reviews!",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=pfxmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Return (The Invasion Chronicles—Book Four): A Science Fiction Thriller",
        "author": "Morgan Rice",
        "description": "“TRANSMISSION is riveting, unexpected, and firmly rooted in strong psychological profiles backed with thriller and sci-fi elements: what more could readers wish for? (Just the quick publication of Book Two, Arrival.)” --Midwest Book Review From #1 worldwide bestselling fantasy author Morgan Rice comes RETURN, book #4 in a long-anticipated science fiction series. Can Kevin and Chloe survive alone in outer space? Can Luna, alone on planet Earth, avoid capture? All hope seems lost for Kevin and Chloe as their escape pod hurtles into nothingness, as they run out of rations and supplies. All hope seems lost for Luna as the aliens outnumber and encircle her. If there any hope left for humanity? “Action-packed …. Rice’s writing is solid and the premise intriguing.” –Publishers Weekly, re A Quest of Heroes “A superior fantasy… A recommended winner for any who enjoy epic fantasy writing fueled by powerful, believable young adult protagonists.” –Midwest Book Review, re Rise of the Dragons “An action packed fantasy sure to please fans of Morgan Rice’s previous novels, along with fans of works such as THE INHERITANCE CYCLE by Christopher Paolini…. Fans of Young Adult Fiction will devour this latest work by Rice and beg for more.” –The Wanderer, A Literary Journal (regarding Rise of the Dragons) Also available are Morgan Rice’s many series in the fantasy genre, including A QUEST OF HEROES (BOOK #1 IN THE SORCERER’S RING), a free download with over 1,300 five star reviews!",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 1998,
        "thumbnail": "http://books.google.com/books/content?id=Vo5yDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Alien Mate",
        "author": "Cara Bristol",
        "description": "Falsely convicted of a crime, I'm sentenced to life as a mail-order bride to an alien. I'm Starr Elizabeth Conner. Earth's government falsely convicted me of a crime, packed me on a ship with other female felons, and sent us to Dakon, a primitive, frozen wasteland of a planet. But I'm no barbarian’s 'mail order bride,' even if he is super tall, muscular, and the chief of his tribe. He doesn’t want a BBW blonde, either--it's written all over his chiseled face. He'll be truly angry if he ever learns what my 'crime' was. I am Torg. I have waited 34 rotations for a mate of my own. With this shipment, I was sure to get a fine, sturdy mate who'll bear me many daughters. Instead, I receive a small, curvy, pale-haired female who looks at me with anger and fear. It is only when we 'kiss' that I believe things may work out between us. But I'm hearing rumors that Starr and her shipmates are law-breakers. To survive, Dakonians must obey all laws … or be exiled into the frozen wasteland. Just when I have found her, will I have to banish my mate?",
        "category": "Romance",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2024,
        "thumbnail": "http://books.google.com/books/content?id=8FkqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Trinity",
        "author": "Anna Lewis",
        "description": "Scifi Alien Romance Eliana Russet lives an ordinary life with an ordinary job and an ordinary best friend. But her whole world is twisted upside down when she finds out that she’s pregnant…which is virtually impossible considering she’s been celibate for the last six months. Zander Olgarian, an impossibly attractive man, reveals himself as the father of her child and Eliana’s world comes crashing down. Not only is Zander her child’s father, but he is also an alien prince, sent down to Earth to create his heir. Eliana has to fight through secret government groups trying to hunt her, loud-mouthed best friends, and hot-headed women on her quest to protect her child and figure out exactly what she’s gotten herself into. With every new turn, she doesn’t know who to trust. She’s becoming lost in a world unknown to her and she’s struggling to keep a hold on her sanity. But she’s a fighter, and she’ll be damned if she lets anyone hurt her baby. Standalone Romance Short Story With No Cliffhanger! ---- SEARCH TERMS: Pregnancy romance, secret baby romance, baby romance, pregnancy romance, alpha male alien romance, alpha male romance, scifi alien romance, alien abduction romance, alpha male aliens, alien fantasy books, alien romance, aliens, scifi romance, Space opera romance, science fiction romance, steamy science fiction romance, hot aliens, fantasy alien romance, paranormal romance, military science fiction books, paranormal with sex, fantasy fiction, psychic romance, steamy paranormal romance, sci fi romance, sci-fi romance, Fated mates, alien mate, new adult, genetic engineering, alien contact, alpha male, alpha female, supernatural, alien invasion romance",
        "category": "Romance",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2004,
        "thumbnail": "http://books.google.com/books/content?id=D0baDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Deathstalker",
        "author": "Simon R. Green",
        "description": "Owen Deathstalker, last of the infamous warrior Clan, always considered himself more of a writer than a fighter, preferring his history books to making any actual history with a sword. But books won’t protect him from Her Imperial Majesty Lionstone XIV, who just Outlawed and condemned Owen to death, without any explanation, reason, or warning. No wonder she’s called the Iron Bitch. Now, on the run from Imperial starcruisers, shady mercenaries, and just about everyone else in the Empire, Owen’s options are limited. Though the name Deathstalker still commands respect in certain quarters, out on the Rim, Owen is lucky he can cobble together a makeshift team of castoffs, including an ex-pirate, a cyborg, and a bounty hunter. But allies won’t be enough to save him. If he’s to live, Owen can either run forever...or take down the corrupt Empire. To do that, he’ll need the fabled Darkvoid Device—an artifact dating back to the first Deathstalker and perhaps the only weapon powerful enough to help this ragtag rebellion win. The time has come for Owen to finally embrace his Deathstalker heritage...and all the blood and death that go along with it. Deathstalker is the first book in New York Times bestselling author Simon R. Green’s beloved space opera series.",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2022,
        "thumbnail": "http://books.google.com/books/content?id=9xoqDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Halcyon: An Alien Scifi Romance",
        "author": "Demelza Carlton",
        "description": "Start reading this free steamy alien scifi romance book now! Catch a siren. Stop the storm. Whatever the cost. Allie, sick of war and grief, signed up as a lowly maintenance worker for the Colony in the hope of securing a lasting peace between the Titans and Humans. However, the girl has her own secrets, not least of which is her assignment from the New Hope government to monitor the Colony for signs of a suspected saboteur. Galen, the only survivor of the Poseidon shipwreck, didn't join the Colony for peace. He wants vengeance on the siren Halcyon, the mysterious Mer whose terrorist tactics single-handedly killed more Humans than any other Titan. His sources say that Halcyon is on New Hope, and he'll happily kill every Mer in the Colony until his parents' murderer is dead. Can they catch the terrorist before the Colony is destroyed? Fans of the following authors will enjoy reading this alien scifi romance series: Starr Huntress Nancey Cummings Grace Goodwin Kate Rudolph Ruby Dixon Ice Planet Barbarians Sonia Nova Honey Phillips Michele Mills Regine Abel Zoe Chant Eve Langlais Anna Hackett Lindsay Buroker Ruby Lionsdrake Erin Tate Aurelia Skye Skye MacKinnon Shea Malloy Cara Bristol ﻿James SA Corey The Expanse Keywords: romance books free, free ebooks, free romance books full novel, free romance, free romance books full novel standalone, free romance books to read and download, romantic novels, free books to read and download, free audiobooks, free romantic audiobooks, science fiction books free, free alien romance, free scifi romance, free science fiction romance novel, free alien romance",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2020,
        "thumbnail": "http://books.google.com/books/content?id=RkgCEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Disappeared",
        "author": "Kristine Kathryn Rusch",
        "description": "Three cases have collided for Miles Flint: a stolen spaceyacht filled with dead bodies, two kidnapped human children, and a human woman on the run, trying to Disappear to avoid alien prosecution. Flint must enforce the law, but how can he do the right thing in a universe where the right thing is very, very wrong?",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2005,
        "thumbnail": "http://books.google.com/books/content?id=4AQmuQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Body Memory",
        "author": "M. L. Buchman",
        "description": "He remembers her. Her touch, her scent, the way her glance could make his heart race. His very body remembers her though she is long gone. Until his job began to grind it away, one small memory at a time.",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2004,
        "thumbnail": "http://books.google.com/books/content?id=qv7wEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Loving Hope",
        "author": "Ann Gimpel",
        "description": "Hope’s had her eye on Charlie for a long time, for all the good it’s done her. He’s not even aware of her existence—other than as a fellow agent working Black Ops for the CIA. Her friends, Glory, Honor, and Charity, found men to love, so Hope knows it’s possible. But the odds aren’t in her favor. Not in a world of normal humans where she’s a genetically modified aberration. Hell, even she refers to her kind as freaks. What man in his right mind would want one of those in his bed? Charlie swore off women after his last marriage went down in drama-tipped flames fifteen years ago. His first mistress is danger. He fell in love with the adrenaline rush when he signed on as a Navy Seal right out of college, and he never got over the thrill of pitting himself against the impossible. Hope caught his eye the night she escaped her compound, but years of ignoring anything resembling a feeling made it easy to ignore the attraction—until they’re paired on a mission. Her intelligence and resourcefulness impress the hell out of him, but her half-naked body, exposed after an animal attack, forces him to face feelings he was certain he’d buried for good.",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2003,
        "thumbnail": "http://books.google.com/books/content?id=uqwNDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Cowboys and Aliens: An Alien Scifi Romance",
        "author": "Demelza Carlton",
        "description": "Start reading this free steamy alien scifi romance book now! When her boss saddles her with the task of planning a suitable celebration for the Colony's one-year anniversary, Rana settles for an ancient American tradition: Thanksgiving. There's just one problem…what's a turkey, and where can she get one? Byron fled Earth in the wake of tragedy. Now, he will do anything to protect his new farm in space – including fight aliens. No matter how attractive they might be. Can a cowboy and an alien set aside their differences, celebrate Thanksgiving, AND find love? Fans of the following authors will enjoy reading this complete alien scifi romance series: Starr Huntress Nancey Cummings Grace Goodwin Kate Rudolph Ruby Dixon Ice Planet Barbarians Sonia Nova Honey Phillips Michele Mills Regine Abel Zoe Chant Eve Langlais Anna Hackett Lindsay Buroker Ruby Lionsdrake Erin Tate Aurelia Skye Skye MacKinnon Shea Malloy Cara Bristol James SA Corey The Expanse Keywords: romance books free, free ebooks, free romance books full novel, free romance, free romance books full novel standalone, free romance books to read and download, romantic novels, free books to read and download, free audiobooks, free romantic audiobooks, science fiction books free, free alien romance, free scifi romance, free science fiction romance novel, free alien romance",
        "category": "Romance",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 1987,
        "thumbnail": "http://books.google.com/books/content?id=LkgCEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Science Fiction Hall of Fame, Volume Two A",
        "author": "Robert Silverberg",
        "description": "The mysteries and marvels of the science fiction world are brought to life in this compilation of stories representing the work of major authors in this field.",
        "category": "Romance",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2010,
        "thumbnail": "http://books.google.com/books/content?id=-SbXIGmLkbwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Oxford Book of Science Fiction Stories",
        "author": "Tom Shippey",
        "description": "A collection of classic science fiction short stories features tales by H. G. Wells, Arthur C. Clark, Frederik Pohl, Clifford Simak, Brian Aldiss, Ursala K. LeGuin, and many others. Edited by the author of The Road to Middle-Earth. 20,000 first printing.",
        "category": "Romance",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=hVqYPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Synnr's Saint",
        "author": "Kate Rudolph",
        "description": "Taken from Earth and used like a lab rat… Emily was a normal law student until she was abducted by aliens. Forced to perform death defying feats by night and undergoing medical tests by day, she doesn’t know how much longer she can take it. When one alien takes particular interest in her she’s afraid things have gone from bad to worse. He’s got wings and fangs, and he makes her heart pound. But she can’t want an alien like that… can she? He doesn’t have time to rescue a human… Oz is on Kilrym for a reason, and it’s not to rescue the ethereal performer who captivates him by night. But covert ops are impossible when his mind is on the human who could be his fated mate. War is on the horizon, but what if the only way to save his people is to sacrifice Emily? Despite the fact that they were born light years apart, they are a perfect match. But Oz is keeping secrets, and when Emily finds out the truth she may never be able to forgive him, no matter how much she needs him to survive and escape the planet alive. Synnr’s Saint kicks off the Zulir Warrior Mates action/adventure science fiction romance series. The heroines were abducted from Earth, but they’re ready to fight back alongside their alien warrior mates. The Zulir Warrior Mates series brings you feisty women, alpha aliens, fated mates, and relationships hot enough to steam up your screen. This book is great for readers of paranormal romance and sci fi romance who love to read in their free time! alien romance books, alien romance audiobooks, fated mates, alien abduction romance, soulmates, alien human romance, best alien romance, alien romance series, science fiction romance, sci-fi romance, sfr, paranormal romance, science fiction romance novels, space opera romance",
        "category": "Romance",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 1982,
        "thumbnail": "http://books.google.com/books/content?id=OVfjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Crashed",
        "author": "Kate Rudolph",
        "description": "A malfunctioning escape vessel, a deserted planet, and an angry warrior… Sarah’s vacation isn’t turning out like she planned. When a false alarm and a faulty life boat send her plummeting to an empty planet with an alien stranger, she knows the trouble has only just begun. Nyxant is an enigma, silent and commanding. And while he makes her heart pound with heated glances and stolen touches, their differences may prove stronger than the pull between them. The planet may be devoid of intelligent life, but the sinister jungle beckons. A trek through the trees and vines will be dangerous, but it may be the only chance either Sarah or Nyxant has for survival. Soon Sarah finds that unforgiving terrain may be the least of her worries. Nyxant is full of secrets. His silence may risk their lives while his touch ignites her soul. She is left with one certainty. The only way to survive is to work together before the planet eats them alive.",
        "category": "Romance",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2019,
        "thumbnail": "http://books.google.com/books/content?id=zfQCDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "To Keep a Wife",
        "author": "K. C. Klein",
        "description": "Lake has gotten the life she never dared dreamed of-a safe haven, and the love of a good man, her husband, Hudson Land. But Lake's hard-won happiness doesn't last long when powerful Elders lay siege on Black Creek Manor in retaliation for her past defiance. As Lake watches everything she loves go up in flames, she sacrifices herself to keep her family alive, never imagining it's not her life that is endanger, but the heart and soul of who she is. Hudson wakes from a head wound to find his whole world is reduced to ashes. With no memory of why he's sacrificed everything for a woman whose name is tattooed on his chest, Hudson is determined to make his heart match the emptiness of his mind, wiping out everything except the hatred for those who are to blame-the Elders and the wife he sought to protect. As evil and fear spread across a war-torn land, can Hudson and Lake forgive each other's betrayals and grab at their one chance at saving not only their lives... but their love as well?",
        "category": "Romance",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2001,
        "thumbnail": "http://books.google.com/books/content?id=AetnjgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Varkan Rise",
        "author": "Tracy Cooper-Posey",
        "description": "Has Bedivere become what humans fear most? The Federation no longer exists and sentient computers, the Varkan, are awakening. Bedivere X helps where he can, so when one lonely and scared computer, Jovanka, suicides and destroys half a planet, Bedivere takes the news hard. Then his close human friend Kemp is murdered and Bedivere disappears. Catherine and her friends must figure out what happened the night Kemp died, while trying to follow Bedivere’s trail of devastation and inexplicable acts across the known worlds. Has Bedivere really gone mad? Has he become one of the creatures that humans fear the most? Cat faces tough questions about the man she loves, while unravelling the mystery he has left behind. This book is part of the Interspace Origins science fiction romance series: 1.0: Faring Soul 2.0: Varkan Rise 3.0: Cat and Company 3.5: Interspace Origins (Series boxed set) A Science Fiction Romance Novel. ___ Praise for Varkan Rise: Smashwords Bestseller, Science Fiction Romance I resented having to stop reading to do my necessary chores ( ie. work ). I just love Bedivere and Catherine, and the love they have for each other, and it shows throughout the book. Varkan Rise had me worried and sad through much of the first half, because I was so concerned about the characters, what they were going through, and how in the heck they were going to get out of it. You come away from reading this book wishing it were real so that you could be traveling amongst the stars yourself. This is a fabulously dark story that keeps you guessing up until the very end. Loved it . The first book in this new series was so good it won an SFR Galaxy Award and this one is just as great Bedivere and Catherine are the cutest. Their devotion and love for each other shines through this novel. The world building is spot on, and the different worlds described are so vivid and lush, it's like you're right there. Another amazing chapter in this refreshing and captivating sci-fi series. Like all of this authors books you can't go wrong, Amazing Author, Amazing Read For five minutes there, my heart stopped and I cried a few tears. Yeah! I won't give it away but I was so sad. Before I knew I was at the end. Without putting the book down once. Like its predecessor, Faring Soul, I really enjoyed this book – I read it continuously, and finished it in a couple of days. Wow! What a story!!!! Bravo, on a riveting story with so much going on you have a hard time finding your feet! I fell a little in love with Bedivere and Catherine in the first book. I fell all the way in this one. The moment you start reading, you get sucked into the story and will not be able to put the book away that easily. I'm not a huge sci fi fan but how Tracy Cooper - Posey might have just turned me on to this genre. I especially love the twist at the end The logic of Bedivere is awesome!!",
        "category": "Romance",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=Ee9lDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Mammoth Book of Futuristic Romance",
        "author": "Trisha Telep",
        "description": "Love will find a way - 19 fantastic future-set romances. The good news is, in the future there will be no shortage of romance. On space ships, on newly-colonized planets or on a barely recognizable Earth, life forms, whether human, alien or something in between, will find their way to love. As giant corporations grasp new opportunities for profit and future armies clash, both in deep space and 'dirtside', former romantic partners try to put the past behind them and time-travelling rebels set out to romance the past. These science fiction stories of future love and lust - by Marcella Burnard, Bianca d'Arc, Jess Granger, Linnea Sinclair, C. L. Wilson and many more - are brimming with passion and humour. So, even though in space no one can hear you scream, they might just be able to hear you laugh.",
        "category": "Romance",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2018,
        "thumbnail": "http://books.google.com/books/content?id=wTqeBAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Awaken",
        "author": "Lori Lind",
        "description": "Awaken is a full-length sci-fi romance novel featuring some serious enemies-to-lovers heat and a story of redemption. This book is packed full of aliens living among us and their control over our planet through a secret society. If you're a fan of dangerous and emotionally scarred heroes, a heroine who is trying to figure out her identity, and a plot to save the universe which began over a thousand years ago, then you should definitely read Awaken, the debut book in Lori Lind's sci-fi romantic All is Fair in Love and Galactic War series.Finnian fell in love with Elara before he knew she was the girl he'd been hunting for years to kill. Elara doesn't know who or what she is. Her entire life had been nothing more than a fabrication until the day of her eighteenth birthday when her true destiny was revealed. Now she has to learn fast or end up dead.",
        "category": "Romance",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2008,
        "thumbnail": "http://books.google.com/books/content?id=UTC9zwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Pregnant to an Alien King",
        "author": "Gloria Martin",
        "description": "A Standalone Short Story with No Cliffhanger! Jesper, newly crowned king of planet Abalon, was celebrating. He’d finally ascended the throne and the entire capital city was celebrating with him. Rockwell, Jasper’s close friend and High General suggested that they should have one last wild night and do something they wouldn’t normally. Something out of their world…of course this leads two tipsy Abalonians to Earth. When Jesper sees Clarice and has to have her. They spend one fateful night together and Jesper returns to Abalon the next day with nothing but a sweet memory. Or so he thinks. Several months later, when it’s discovered that an Abalonian child was born to a human, everything changes for King Jesper, as well as Clarice who finds herself whisked away to an entirely different planet. --- TAGS: Pregnancy romance, baby romance, pregnancy romance, alpha male alien romance, alpha male romance, scifi alien romance, alien abduction romance, alpha male aliens, alien fantasy books, alien romance, aliens, scifi romance, Space opera romance, science fiction romance, steamy science fiction romance, hot aliens, fantasy alien romance, paranormal romance, military science fiction books, paranormal with sex, fantasy fiction, psychic romance, steamy paranormal romance, sci fi romance, sci-fi romance, Fated mates, alien mate, new adult, genetic engineering, alien contact, alpha male, alpha female, supernatural, alien invasion romance",
        "category": "Romance",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2006,
        "thumbnail": "http://books.google.com/books/content?id=oELaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "A Matter of Matter",
        "author": "L. Ron Hubbard",
        "description": "Chuck Lambert toils for 11 grueling years to scrape together enough money to finally buy a planet of his own. Rather than purchase on legally from the Interior Department of the Outer Galactic Control, he succumbs to the flashy advertising of a galactic swindler named Madman Murphy.",
        "category": "Romance",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2024,
        "thumbnail": "http://books.google.com/books/content?id=lyrm5fJSrSkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Outer Spheres",
        "author": "Andrew Wallace",
        "description": "How can such a bright future be so full of darkness? Beautiful young Charity Freestone has it all: the love of a good man, the revelation of her remarkable identity, and her family reunited after their spectacular battle with the Sons of the Crystal Mind. However, at her moment of triumph Charity is tricked into joining the mysterious New Form Enterprise, whose harsh regime seems designed to break her. Before she can learn their strange purpose, a shocking betrayal brings unique and terrifying freedom. Cut off from its advanced technology, Charity is hunted through war-torn, subterranean Diamond City by an enemy who is always closer than she thinks. As she struggles to make sense of her inhumanly ruthless pursuers, Charity must confront her own complicity in the nightmare that engulfs her. And when she does, she discovers there are far worse places than the dreaded Outer Spheres. Book Two of Andrew Wallace’s viscerally thrilling Diamond Roads science fiction series, The Outer Spheres takes extraordinary heroine Charity Freestone into even stranger and more disturbing territory. The novel threads bleeding-edge science through a fearsomely-wrought war story to explore the unimaginable outcomes of our most terrifying decisions. Blending the vast and eerie scale of Peter F Hamilton’s The Reality Dysfunction with the originality and political insight of Anne Leckie’s Ancilliary Justice, The Outer Spheres forges a unique vision of fear and wonder. Diamond Roads is fast becoming a whole new mythology, exploring the way things are against a wildly-imagined backdrop of how they might turn out. To see if Charity survives, and whether she can be truly free of her pursuers and her own demons, buy the book now. Praise for Diamond Roads: Andrew Wallace shows a real talent for world building in this well-written, fast-paced debut novel. From the first page, Diamond Roads is packed with sci-fi smarts. I’m looking forward to reading more from this author – Anne Charnock, winner of the Clarke Award for Dreams Before the Start of Time & the BSFA Award for The Enclave Fast-paced, clever and beautifully written, Diamond Roads is a richly imagined dystopian thriller that introduces the latest in a long line of cool, kick-ass SF heroines. Charity Freestone combines the strength of Ripley with the wiles of Katniss and the vulnerability of Halo Jones. If you liked Wool, you'll love this – Mark Edwards, bestselling author of The Magpies & Follow You Home I loved this smart, continually surprising thriller set in a richly drawn world – Simon Guerrier, author of Doctor Who: The Pirate Loop; Primeval: Fire & Water & Being Human: The Road",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2006,
        "thumbnail": "http://books.google.com/books/content?id=d4vmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Ambush",
        "author": "Dean M. Cole",
        "description": "**Bestselling Author of Solitude: Dimension Space Book One** Humans rule the galaxy...Today! The Milkyway's predominant species discovers a lost colony of their ancestors--humans--populating today's Earth. Then our genetic link draws the attention and enmity of their galactic rivals. When a plan to elevate present-day Earth leads to an alien invasion, a small, multinational military task force is all that stands between humanity and certain annihilation. If you like action-packed, page-turning novels, then you'll love the electrifying action in this apocalyptic military thriller. Grab Book One Today! Independence Day meets The X-Files when Air Force fighter pilots Jake Giard and Sandra Fitzpatrick join a decades-old secret project to integrate today's Earth into a galactic government. But when a galactic civil war spills onto our shores, plunging the planet into an otherworldly post-apocalyptic hell, can Jake and Sandy save humanity from extinction? A Little More About Ambush... As unknown aliens with a dark secret continue to raid the planet, Jake fights through a post-apocalyptic hell, struggling to comprehend the enigmatic aftermath of the first attack. On the West Coast, Sandra's squadron smashes against the invading aliens. Thrown to ground, Sandy wades through blazing infernos and demented looters in a desperate attempt to save her family. Finally, with the fate of the world in the balance, both captains must take the battle to the enemy--humanity's very survival hanging on their success. What the Critics are Saying KirkusReviews \"Cole tackles the first-contact scenario with bombastic flair. [He] delivers the high-resolution imagery of a Hollywood blockbuster ... A technologically riveting dream for sci-fi action fans.\" AudiobookReviewer \"SECTOR 64: Ambush was a highly imaginative action-packed apocalyptic assault on your mind.\" IndieReader \"SECTOR 64: AMBUSH is an engaging book from the very first page to the final words of the Epilogue.\" Audiobook-Heaven \"His descriptions of aerial battle and military procedure are accurately detailed and his knowledge of the aircraft themselves fascinated me ... Sector 64: Ambush is a great read.\" Scroll up and grab a copy today.",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2020,
        "thumbnail": "http://books.google.com/books/content?id=aU89zQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Ender's Game",
        "author": "Orson Scott Card",
        "description": "\"The classic of modern science fiction\"--Front cover.",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2016,
        "thumbnail": "http://books.google.com/books/content?id=jaM7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Eternal Wall",
        "author": "Raymond Gallun",
        "description": "A scream of brakes, the splash into icy waters, a long descent into alkaline depths ... it was death. But Ned Vince lived again--a million years later!Excerpt \"See you in half an hour, Betty,\" said Ned Vince over the party telephone. \"We'll be out at the Silver Basket before ten-thirty....\"Ned Vince was eager for the company of the girl he loved. That was why he was in a hurry to get to the neighboring town of Hurley, where she lived. His old car rattled and roared as he swung it recklessly around Pit Bend.There was where Death tapped him on the shoulder. Another car leaped suddenly into view, its lights glaring blindingly past a high, up-jutting mass of Jurassic rock at the turn of the road.Dazzled, and befuddled by his own rash speed, Ned Vince had only swift young reflexes to rely on to avoid a fearful, telescoping collision. He flicked his wheel smoothly to the right; but the County Highway Commission hadn't yet tarred the traffic-loosened gravel at the Bend.Ned could scarcely have chosen a worse place to start sliding and spinning. His car hit the white-painted wooden rail sideways, crashed through, tumbled down a steep slope, struck a huge boulder, bounced up a little, and arced outward, falling as gracefully as a swan-diver toward the inky waters of the Pit, fifty feet beneath....Ned Vince was still dimly conscious when that black, quiet pool geysered around him in a mighty splash. He had only a dazing welt on his forehead, and a gag of terror in his throat.Movement was slower now, as he began to sink, trapped inside his wrecked car. Nothing that he could imagine could mean doom more certainly than this. The Pit was a tremendously deep pocket in the ground, spring-fed. The edges of that almost bottomless pool were caked with a rim of white--for the water, on which dead birds so often floated, was surcharged with alkali. As that heavy, natronous liquid rushed up through the openings and cracks beneath his feet, Ned Vince knew that his friends and his family would never see his body again, lost beyond recovery in this abyss.The car was deeply submerged. The light had blinked out on the dash-panel, leaving Ned in absolute darkness. A flood rushed in at the shattered window. He clawed at the door, trying to open it, but it was jammed in the crash-bent frame, and he couldn't fight against the force of that incoming water. The welt, left by the blow he had received on his forehead, put a thickening mist over his brain, so that he could not think clearly. Presently, when he could no longer hold his breath, bitter liquid was sucked into his lungs.His last thoughts were those of a drowning man. The machine-shop he and his dad had had in Harwich. Betty Moore, with the smiling Irish eyes--like in the song. Betty and he had planned to go to the State University this Fall. They'd planned to be married sometime.... Goodbye, Betty ...The ripples that had ruffled the surface waters in the Pit, quieted again to glassy smoothness. The eternal stars shone calmly. The geologic Dakota hills, which might have seen the dinosaurs, still bulked along the highway. Time, the Brother of Death, and the Father of Change, seemed to wait....",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2013,
        "thumbnail": "http://books.google.com/books/content?id=uRAmjlIhIn4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Entanglement",
        "author": "Gerald M. Kilby",
        "description": "The discovery of a long lost spaceship transporting an experimental quantum device, ignites a system-wide power struggle. Fast paced old-school SciFi.",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2011,
        "thumbnail": "http://books.google.com/books/content?id=xNAVvgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "People of Dust",
        "author": "Marcus Martin",
        "description": "The Lunar Inspector is dead. Luke Remini must urgently find the killer. But he's a wanted man himself... Nuclear fuel from Lunar Three has brought Earth's two superpowers to the table. For the first time in thirty years, peace is within reach. But rumors of a new bioweapon could spark war. The Moon has become the covert battle ground for a conflict bigger than anyone could possibly know... \"Action-packed, with humor throughout, it had me from the first page\" - Marie Thorpe From international bestselling author Marcus Martin, People of Change is a thrilling near-future sci-fi series. Bursting with twists, action, and dark humor, you'll be racing to the next page. The People of Change books can be read independently and in any order. The series contains strong language, adult themes, and gripping characters. You're welcome.",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=QxAuEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Paradox Hotel",
        "author": "Rob Hart",
        "description": "“Time travel, murder, corruption, restless baby dinosaurs, and a snarky robot named Ruby collide in this excellent, noir-inflected, humor-infused, science-fiction thriller.”—The Boston Globe An impossible crime. A detective on the edge of madness. The future of time travel at stake. From the author of The Warehouse . . . ONE OF THE BEST BOOKS OF THE YEAR: NPR, Kirkus Reviews January Cole’s job just got a whole lot harder. Not that running security at the Paradox was ever really easy. Nothing’s simple at a hotel where the ultra-wealthy tourists arrive costumed for a dozen different time periods, all eagerly waiting to catch their “flights” to the past. Or where proximity to the timeport makes the clocks run backward on occasion—and, rumor has it, allows ghosts to stroll the halls. None of that compares to the corpse in room 526. The one that seems to be both there and not there. The one that somehow only January can see. On top of that, some very important new guests have just checked in. Because the U.S. government is about to privatize time-travel technology—and the world’s most powerful people are on hand to stake their claims. January is sure the timing isn’t a coincidence. Neither are those “accidents” that start stalking their bidders. There’s a reason January can glimpse what others can’t. A reason why she’s the only one who can catch a killer who’s operating invisibly and in plain sight, all at once. But her ability is also destroying her grip on reality—and as her past, present, and future collide, she finds herself confronting not just the hotel’s dark secrets but her own. At once a dazzlingly time-twisting murder mystery and a story about grief, memory, and what it means to—literally—come face-to-face with our ghosts, The Paradox Hotel is another unforgettable speculative thrill ride from acclaimed author Rob Hart.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2010,
        "thumbnail": "http://books.google.com/books/content?id=h86UEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Zero Sum Game",
        "author": "S. L. Huang",
        "description": "ZERO SUM GAME Best of Lists: * Best Books of the Month at The Verge, Book Riot, Unbound Worlds, SYFY, & Kirkus * The Mary Sue Book Club Pick * Library Journal Best Debuts of Fall and Winter A blockbuster, near-future science fiction thriller, S.L. Huang's Zero Sum Game introduces a math-genius mercenary who finds herself being manipulated by someone possessing unimaginable power... Cas Russell is good at math. Scary good. The vector calculus blazing through her head lets her smash through armed men twice her size and dodge every bullet in a gunfight, and she'll take any job for the right price. As far as Cas knows, she’s the only person around with a superpower...until she discovers someone with a power even more dangerous than her own. Someone who can reach directly into people’s minds and twist their brains into Moebius strips. Someone intent on becoming the world’s puppet master. Cas should run, like she usually does, but for once she's involved. There’s only one problem... She doesn’t know which of her thoughts are her own anymore. \"Fresh and exciting... a great start to an exciting series--and an exciting career.\" --Boing Boing At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2024,
        "thumbnail": "http://books.google.com/books/content?id=XyBGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Invisible Man",
        "author": "H. G. Wells",
        "description": "One dark and stormy night, a stranger arrives in West Sussex at a village inn. He is heavily clad in an overcoat and his face is wrapped in bandages. He takes a room at the inn, but refuses to socialize with anyone. He stays cooped up in his room all day and night, working with strange chemicals and apparatus. Suddenly, strange events begin to happen in the village. Mysterious burglaries and fires break out, culminating in a destructive rampage across the peaceful countryside. The stranger is the keeper of a terrible secret... The Invisible Man: A Grotesque Romance (to give the book its full title) by HG Wells was published in 1897. Written in novella form, this bizarre science fiction tale was first published in Pearson's Weekly as a serial and later compiled into a single book. Based on scientific theories of optics and physics, this story instantly caught the imagination of readers and has been regularly adapted to film, television and radio since it first made its appearance more than a hundred years ago. Herbert George Wells' writing career owes itself to an accident suffered in childhood. As an eight year old boy, he was once confined to bed with a broken leg. His father, a professional cricketer and failed businessman, regularly brought him books from the local library so that he could pass the time. His father's financial troubles compelled his mother to go to work as a lady's maid in a local mansion, while the children were put to work as apprentices with various local tradesmen. For Wells, this was one of the most unhappy, yet also the most profitable times in his life. The mansion where his mother worked had an enormous library where the child continued to read and educate himself. At eighteen, he went to work as a teacher in a residential school. His career flourished after that, and he won a scholarship to work under the great biologist, Thomas Huxley in London. He began writing science fiction stories in 1895 with the publication of The Time Machine, where he proposed the concept of selective time travel. Several other extremely popular Sci-Fi novels and short stories followed, interspersed with romantic stories, novels, ghost stories, film scripts, articles, satirical novels, historical and political treatises and non-fiction papers. Wells was an extremely prolific writer and continues to inspire generations of writers even today. The Invisible Man is a book that evokes great interest among readers of all ages and is an important landmark in the history of Sci-Fi writing. One dark and stormy night, a stranger arrives in West Sussex at a village inn. He is heavily clad in an overcoat and his face is wrapped in bandages. He takes a room at the inn, but refuses to socialize with anyone. He stays cooped up in his room all day and night, working with strange chemicals and apparatus. Suddenly, strange events begin to happen in the village. Mysterious burglaries and fires break out, culminating in a destructive rampage across the peaceful countryside. The stranger is the keeper of a terrible secret... The Invisible Man: A Grotesque Romance (to give the book its full title) by HG Wells was published in 1897. Written in novella form, this bizarre science fiction tale was first published in Pearson's Weekly as a serial and later compiled into a single book. Based on scientific theories of optics and physics, this story instantly caught the imagination of readers and has been regularly adapted to film, television and radio since it first made its appearance more than a hundred years ago.",
        "category": "Comics",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2014,
        "thumbnail": "http://books.google.com/books/content?id=_2WLtAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "The Invisible Man Illustrated",
        "author": "H. G. Wells",
        "description": "The Invisible Man is a science fiction novel by H. G. Wells. Originally serialized in Pearson's Weekly in 1897, it was published as a novel the same year. The Invisible Man of the title is Griffin, a scientist who has devoted himself to research into optics and invents a way to change a body's refractive index to that of air so that it neither absorbs nor reflects light and thus becomes invisible. He successfully carries out this procedure on himself, but fails in his attempt to reverse it. An enthusiast of random and irresponsible violence, Griffin has become an iconic character in horror fiction.This is a classic science-fiction book with over 100 pages of pure excitement and wonder. The Invisible Man may start out slowly, but once you pay close attention, the book becomes a spine-tingling thriller that will leave you breathless. It all starts when a mysterious stranger comes into the town of Iping, all wrapped up in bandages. He never takes off his glasses, bandages, or coat, and brings all sorts of strange chemicals in little bottles with him. He sits in his hotel room all day, working with the chemicals. No one knows what he's doing, but eventually, people get suspicious. Who is this disguised man? Is he a criminal in hiding? Or maybe he's horribly disfigured! All the same, they want to get a glimpse of this strange man's face. Just imagine their surprise when they find out that this man is invisible! I would definitely inspire anyone who likes a good hard read and science-fiction to read this fantastic novel",
        "category": "Comics",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 1980,
        "thumbnail": "http://books.google.com/books/content?id=_d0UzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Solitude",
        "author": "Dean M. Cole",
        "description": "Months after the apocalypse, Earth's last man discovers the last woman is stranded on the International Space Station, barely alive-so begins a race against time. If you like action-packed, page-turning novels, you'll love the electrifying action in this award-winning, apocalyptic thriller.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2017,
        "thumbnail": "http://books.google.com/books/content?id=29ZBzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Gold",
        "author": "Isaac Asimov",
        "description": "Gold is the final and crowning achievement of the fifty-year career of science fiction's transcendent genius, the world-famous author who defined the field of science fiction for its practitioners, its millions of readers, and the world at large. The first section contains stories that range from the humorous to the profound, at the heart of which is the title story, \"Gold,\" a moving and revealing drama about a writer who gambles everything on a chance at immortality: a gamble Asimov himself made -- and won. The second section contains the grand master's ruminations on the SF genre itself. And the final section is comprised of Asimov's thoughts on the craft and writing of science fiction.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 1970,
        "thumbnail": "http://books.google.com/books/content?id=E3WNSY_UgVsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Long Man",
        "author": "Steve Englehart",
        "description": "Max August, an ageless man, and Dr. Pamela Blackwell attempt to prevent genocide by learning some real-world magick.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2018,
        "thumbnail": "http://books.google.com/books/content?id=FRiS00A-KuwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Dark Matter",
        "author": "Blake Crouch",
        "description": "NEW YORK TIMES BESTSELLER • COMING SOON TO APPLE TV+ • A “mind-blowing” (Entertainment Weekly) speculative thriller about an ordinary man who awakens in a world inexplicably different from the reality he thought he knew—from the author of Upgrade, Recursion, and the Wayward Pines trilogy “Are you happy with your life?” Those are the last words Jason Dessen hears before the kidnapper knocks him unconscious. Before he awakens to find himself strapped to a gurney, surrounded by strangers in hazmat suits. Before a man he’s never met smiles down at him and says, “Welcome back, my friend.” In this world he’s woken up to, Jason’s life is not the one he knows. His wife is not his wife. His son was never born. And Jason is not an ordinary college professor but a celebrated genius who has achieved something remarkable. Something impossible. Is it this life or the other that’s the dream? And even if the home he remembers is real, how will Jason make it back to the family he loves? From the bestselling author Blake Crouch, Dark Matter is a mind-bending thriller about choices, paths not taken, and how far we’ll go to claim the lives we dream of.",
        "category": "Thriller",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 1976,
        "thumbnail": "http://books.google.com/books/content?id=85nrCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Blood Crazy",
        "author": "Simon Clark",
        "description": "It is a quiet, uneventful Saturday in Doncaster. Nick Aten, and his best friend Steve Price – troubled seventeen year olds – spend it as usual hanging around the sleepy town, eating fast food and planning their revenge on Tug Slatter, a local bully and their arch-enemy. But by Sunday, Tug Slatter becomes the last of their worries because somehow overnight civilization is in ruins. Adults have become murderously insane – literally. They're infected with an uncontrollable urge to kill the young. Including their own children. As Nick and Steve try to escape the deadly town covered with the mutilated bodies of kids, a group of blood-thirsty adults ambushes them. Just a day before they were caring parents and concerned teachers, today they are savages destroying the future generation. Will Nick and Steve manage to escape? Is their hope that outside the Doncaster borders the world is 'normal' just a childish dream? Blood Crazy, first published in 1995, is a gripping, apocalyptic horror from Simon Clark.",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2018,
        "thumbnail": "http://books.google.com/books/content?id=pwKrBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Judas Unchained",
        "author": "Peter F. Hamilton",
        "description": "WALL STREET JOURNAL BESTSELLER • “An interstellar suspense thriller . . . sweeping in scope and emotional range.”—San Antonio Express-News In the star-spanning civilization known as the Intersolar Commonwealth, twenty-three planets have fallen victim to the Prime, a technologically advanced alien species genetically hardwired to exterminate all other forms of life. But the Prime is not the only threat. The Starflyer, an alien with mind-control abilities impossible to detect or resist, has secretly infiltrated the Commonwealth and is sabotaging the war effort. Is the Starflyer an ally of the Prime, or has it orchestrated a fight to the death between the two species for its own advantage? Caught between two deadly enemies, the fractious Commonwealth must unite as never before. This will be humanity’s finest hour—or its last gasp. Praise for Judas Unchained, the sequel to Pandora’s Star “Bristles with the energy of golden age SF, but the style and characterizations are polished and modern.”—SF Site “You’re in for quite a ride.”—The Santa Fe New Mexican “The reader is left breathless in amazement.”—SFRevu",
        "category": "Thriller",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2015,
        "thumbnail": "http://books.google.com/books/content?id=j1WZfzhwzaQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Transmission (The Invasion Chronicles—Book One): A Science Fiction Thriller",
        "author": "Morgan Rice",
        "description": "“TRANSMISSION is riveting, unexpected, and firmly rooted in strong psychological profiles backed with thriller and sci-fi elements: what more could readers wish for? (Just the quick publication of Book Two, Arrival.)” --Midwest Book Review From #1 worldwide bestselling fantasy author Morgan Rice comes a long-anticipated science fiction series debut. When SETI finally receives a signal from an alien civilization, what will happen next? A 13 year old boy, dying of a rare brain disease, is the only one able to hear and decode signals from outer space. SETI confirms it is a real signal. What is the message? How will the world react? And most of all: are the aliens coming? “Action-packed …. Rice’s writing is solid and the premise intriguing.” –Publishers Weekly, re A Quest of Heroes “A superior fantasy… A recommended winner for any who enjoy epic fantasy writing fueled by powerful, believable young adult protagonists.” –Midwest Book Review, re Rise of the Dragons “An action packed fantasy sure to please fans of Morgan Rice’s previous novels, along with fans of works such as THE INHERITANCE CYCLE by Christopher Paolini…. Fans of Young Adult Fiction will devour this latest work by Rice and beg for more.” –The Wanderer, A Literary Journal (regarding Rise of the Dragons) Book #2 in the series—ARRIVAL—is also available! Also available are Morgan Rice’s many series in the fantasy genre, including A QUEST OF HEROES (BOOK #1 IN THE SORCERER’S RING), a free download with over 1,300 five star reviews!",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2008,
        "thumbnail": "http://books.google.com/books/content?id=EBBbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Seeker",
        "author": "Douglas E. Richards",
        "description": "When an interstellar probe lands in the heart of the Amazon Jungle, powerful nations around the world will stop at nothing to retrieve it. Because the unoccupied alien craft is sure to contain revolutionary technology. Technology that will allow the country that controls it to dominate the globe. With the probe hidden within the densest rainforest on Earth, traditional military power is useless. So the US chooses to send in a single operative, a man who's been enhanced to the limits of current technology. He'll be greatly outnumbered, and with so much on the line, not even the closest of allies can be trusted. m But the true stakes are higher than anyone could possibly know. Because all is not what it seems. And the alien spacecraft has plans of its own ...-Back of book.",
        "category": "Thriller",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2008,
        "thumbnail": "http://books.google.com/books/content?id=m7mWuAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Nightwise",
        "author": "R. S. Belcher",
        "description": "R.S. Belcher, the acclaimed author of The Six-Gun Tarot and The Shotgun Arcana launches a gritty new urban fantasy series set in today's seedy occult underworld in Nightwise. In the more shadowy corners of the world, frequented by angels and demons and everything in-between, Laytham Ballard is a legend. It's said he raised the dead at the age of ten, stole the Philosopher's Stone in Vegas back in 1999, and survived the bloodsucking kiss of the Mosquito Queen. Wise in the hidden ways of the night, he's also a cynical bastard who stopped thinking of himself as the good guy a long time ago. Now a promise to a dying friend has Ballard on the trail of an escaped Serbian war criminal with friends in both high and low places—and a sinister history of blood sacrifices. Ballard is hell-bent on making Dusan Slorzack pay for his numerous atrocities, but Slorzack seems to have literally dropped off the face of the Earth, beyond the reach of his enemies, the Illuminati, and maybe even the Devil himself. To find Slorzack, Ballard must follow a winding, treacherous path that stretches from Wall Street and Washington, D.C. to backwoods hollows and truckstops, while risking what's left of his very soul . . . .",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2024,
        "thumbnail": "http://books.google.com/books/content?id=06snCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The War of the Worlds",
        "author": "H. G. Wells",
        "description": "An adaptation of H.G. Wells' classic science fiction tale in which, as life on Mars becomes impossible, Martians and their terrifying machines invade Earth.",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=rWT5iHTmtEwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The White Invaders (Sci-Fi Classic)",
        "author": "Ray Cummings",
        "description": "Out of their unknown fourth dimensional realm materializes a horde of White Invaders with power invincible. Ray Cummings is an American author of science fiction literature and comic books. Cummings is identified as one of the \"founding fathers\" of the science fiction genre. His most highly regarded fictional work was the novel The Girl in the Golden Atom, which was a consolidation of a short story by the same name. For this novel Cummings combined the idea of Fitz James O'Brien's The Diamond Lens with H. G. Wells's The Time Machine. During the 1940s, Cummings anonymously scripted comic book stories for Timely Comics, the predecessor to Marvel Comics. He recycled the plot of The Girl in the Golden Atom for a two-part Captain America tale, Princess of the Atom (Captain America #25 & 26).",
        "category": "Comics",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=KBFiEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Sci-Fi San Francisco",
        "author": "Emma Dudley",
        "description": "San Francisco is weird. That's why it's a perfect setting for science fiction stories. Sci-Fi San Francisco collects speculative comics from more than two dozen creators, featuring dimension-hopping realtors, biotech shenanigans, hyper-evolved cats, and visions of the future both optimistic and apocalyptic.",
        "category": "Comics",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2019,
        "thumbnail": "http://books.google.com/books/content?id=n6gLtAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Imagine Wanting Only This",
        "author": "Kristen Radtke",
        "description": "ONE OF THE BEST BOOKS OF THE YEAR: Forbes • Lit Hub • Electric Lit A gorgeous graphic memoir about loss, love, and confronting grief When Kristen Radtke was in college, the sudden death of a beloved uncle and the sight of an abandoned mining town after his funeral marked the beginning moments of a lifelong fascination with ruins and with people and places left behind. Over time, this fascination deepened until it triggered a journey around the world in search of ruined places. Now, in this genre-smashing graphic memoir, she leads us through deserted cities in the American Midwest, an Icelandic town buried in volcanic ash, islands in the Philippines, New York City, and the delicate passageways of the human heart. Along the way, we learn about her family and a rare genetic heart disease that has been passed down through generations, and revisit tragic events in America’s past. A narrative that is at once narrative and factual, historical and personal, Radtke’s stunning illustrations and piercing text never shy away from the big questions: Why are we here, and what will we leave behind? (With black-and-white illustrations throughout; part of the Pantheon Graphic Novel series)",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2015,
        "thumbnail": "http://books.google.com/books/content?id=7gBmDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Logan's Run: Last Day #1",
        "author": "William F. Nolan",
        "description": "Logan has been trained to kill, born and bred from conception to be the best of the best, but his time is short. He’s nearing the end of his life. Age 21, when every citizen reports for Deep Sleep. But before his life ends he’s got one final mission: find and destroy Sanctuary, a fabled haven for those that chose to defy the system. William F. Nolan’s masterpiece of dystopian future once again races into the 23rd Century with this all-new comic book adaptation of LOGAN’S RUN. When Last Day comes, will you lie down and die... or run!",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 1989,
        "thumbnail": "http://books.google.com/books/content?id=HqSNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Zap!",
        "author": "Bryan Baugh",
        "description": "Star Wars, Star Trek, Alien, Predator, The Matrix - part of the appeal of great science fiction is its distinctive look. Now, withZap! How to Draw Fantastic Sci-Fi Comics,artists everywhere can learn to create their own sci-fi realities and to draw space heroes and heroines, intergalactic villains, robots, spaceships, blasting rockets, slimy aliens, and much more. A history of science-fiction comics is followed by an overview of the genre illustrated by the masters, including Alex Raymond (creator of Flash Gordon), Wally Wood (who shaped the look of 1950s sci-fi), and Basil Wolverton (whose bizarre art launched a thousand mid-century sci-fi stories). Then readers turn to Bryan Baugh’s clear, detailed step-by-step instruction on how to draw dynamic cosmic action figures plus all the futuristic technology they can dream up. Perfect for artists, fans, even writers,Zap! How to Draw Fantastic Sci-Fi Comicslets the art of the future spring from the art of the past.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 1994,
        "thumbnail": "http://books.google.com/books/content?id=0l4UID9J1uEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Radiant Red #1 (Of 5)",
        "author": "Cherish Chen",
        "description": "Fan-favourite creative team CHERISH CHEN, DAVID LAFUENTE & MIQUEL MUERTO return for a FIVE-ISSUE MINISERIES telling the next unmissable story from the world of RADIANT BLACK! To her students, Satomi Shen is a diligent middle school teacher. To her fiancé and parents, she’s the rock of their family. To the world, she’s RADIANT RED, a criminal turned matter-absorbing superhero. But with a mysterious stranger in her classroom, a nosy reporter on her doorstep, and $2.5 million hidden in the air vents of her house, she’s going to have to decide who she is, and quickly—before the world chooses for her.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2024,
        "thumbnail": "http://books.google.com/books/content?id=0WBhEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Paragon",
        "author": "Autumn Kalquist",
        "description": "Tadeo Raines knows what they say about him. It’s all lies. But lies are better than the truth. He broke the rules once and swore he’d never do it again. Now traitors plot against the fleet, and he's tasked with hunting them down and stopping them. Permanently. Tadeo was born to command, born to lead the last remnants of humanity to a new Earth. He knows there’s a better world out there: Daylight at the end of humanity's long night. And he's willing to do whatever it takes to get the fleet there. Even if it means walking the line between loyalty and treason. And breaking the rules... Again. Legacy Code is a suspenseful and dark genetic engineering science fiction series that has earned five star reviews from fans of some of the best sci-fi and fantasy books like Hunger Games, Divergent, and Red Rising, and has been compared favorably to Wool, 1984, and the new Battlestar Galactica. What readers are saying: If you like mysteries and/or sci-fi you will love this book!!! \"This is a very good story that has your heart pounding as you turn the pages. Intrigue, nefarious plots, twists and turns around every corner - great series, even if you're not a fan of science fiction.\" \"From the moment I read the first paragraph of Paragon, up until the last sentence, I was enthralled. Non-stop, on edge, exciting action. I honestly couldn't put a fault on this one, I loved all of it, including the song! The Fractured Era series is still up there amongst my favourite novels of the year.\" \"Full of questions, traitors galore, secrets & suspicions. You can't even trust your own family in this world!\" Phenomenal...that's the best word to describe it. Autumn Kalquist manages to weave a tale that is jam packed with suspense and whodunit plots. Just loved it with it many twists and turns that keeps you on your toes. The characters were great and you just didn't know who to trust in the conspiracy that was going on. ...Highly recommended series and anxious to read the next book. I love all of this author's books. I have read many post-apocalyptic and dystopian tales and this is different from all the rest. She always keeps me guessing. My only complaint is she doesn’t write them fast enough!! I believe this is the first 5 star rating I've ever given. LOVED IT! Such a great follow up to Legacy Code (which ended up on my Top Ten 2014 list) I love Autumn's writing style, she is so talented and takes you right there alongside the characters. This is a beautiful and unique story and I can't wait to read more!! \"In a story where I fell in love with the characters, it is easy to have your heart broken, have a smile on your face, or cry over a simple scene in the book. This is one series I would never stop reading, and admittedly, have read on more than one occasion!\" \"This series has me intrigued, it feels realistic, real and frightening at the same time. Humanity is alone in space in their fleet of ships and they have nowhere to go, they try to find a better earth, a new home. I want to know if they ever find it.\" keywords: science fiction best sellers, top sci-fi books, top science fiction books, best sci-fi fantasy books, genetic engineering science fiction series, best science fiction novels, genetic engineering, space colony, space colonization, space opera, apocalypse, post-apocalyptic, generation ship, end of the world, space battle, space explorer",
        "category": "Comics",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2010,
        "thumbnail": "http://books.google.com/books/content?id=c_DmCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Invisible Kingdom Library Edition",
        "author": "G. Willow Wilson",
        "description": "The sweeping, multi-Eisner-Award winning and Hugo nominated sci-fi epic is collected in an oversized hardcover edition! This special library edition features every cover, extensive process art section, and the original pitch of this thrilling tour-de-force! In a distant galaxy, acolyte Vess and hardened freighter pilot Grix join forces to expose an inconceivable conspiracy between the most dominant religion and an all-powerful mega-corporation. Suddenly prey in an interstellar chase through the dreaded Junk Rings to The Point of No Return, this unexpected pair is faced with a grave decision: reveal the truth or plunge the world into anarchy. And when the valiant crew of the Sundog is captured by the dangerous Siblings of Rebirth, Vess and Grix must fight to save not only the universe, but also their newfound love—against all odds. Praise for Invisible Kingdom: \"Sharp, funny, and utterly breathtaking, Wilson and Ward's Invisible Kingdom is a world you won't want to leave.\"—Kelly Sue DeConnick (Pretty Deadly, Captain Marvel) \"Invisible Kingdom is the comic I didn't know I wanted and now can't live without. It's a vitamin boost for the eyes and mind, full of great vistas of ideas. Two master creators doing a barrel roll just outside our atmosphere. You want this book.\"—Gail Simone (Birds of Prey, Batgirl) \"G. Willow Wilson and Christian Ward are two of contemporary comics most visionary creators, and in Invisible Kingdom they are working together at the height of their powers to tell a stunningly relevant story with rip-roaring wisdom and mind-bending visuals. Highly recommended.\"—Saladin Ahmed (Ms Marvel, Black Bolt) \"Invisible Kingdom isn't just for science fiction fans; it's for readers who enjoy a fast-paced narrative that also pushes boundaries. Simultaneously up close and personal yet vast in scope. It's my kind of space opera.\"—Nnedi Okorafor (LaGuardia, The Binti Trilogy, Who Fears Death) \"A smart pop-art feminist Star Wars. Fans of science fiction epics... will want to strap in for the longer ride.\"—Publishers Weekly \"One of the most unique sci-fi comics since Saga& resonates in the present day.\"—Bleeding Cool \"A stunning and immersive world.\"—Sequential Planet \"Invisible Kingdom delivers spiritual sci-fi with spectacular visual style.\"—The A.V. Club",
        "category": "Comics",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2019,
        "thumbnail": "http://books.google.com/books/content?id=BANjEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Mutants and Mystics",
        "author": "Jeffrey J. Kripal",
        "description": "\"Account of how comic book heroes have helped their creators and fans alike explore and express a wealth of paranormal experiences ignored by mainstream science. Delving deeply into the work of major figures in the field - from Jack Kirby's cosmic superhero sagas and Philip K. Dick's futuristic head-trips to Alan Moore's sex magic and Whitley Strieber's communion with visitors - Kripal shows how creators turned to science fiction to convey the reality of the inexplicable and the paranormal they experienced in their lives. Expanded consciousness found its language in the metaphors of sci-fi - incredible powers, unprecedented mutations, time-loops and vast intergalactic intelligences - and the deeper influences of mythology and religion that these in turn drew from ; the wildly creative work that followed caught the imaginations of millions. Moving deftly from Cold War science and Fredric Wertham's anticomics crusade to gnostic revelation and alien abduction, Kripal spins out a hidden history of American culture, rich with mythical themes and shot through with an awareness that there are other realities far beyond our everyday understanding.\"--Jacket.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2004,
        "thumbnail": "http://books.google.com/books/content?id=8kNjcn8KsuUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Wally Wood",
        "author": "Wallace Wood",
        "description": "\"Strange Worlds of Science Fiction is the most extensive collection to-date, of sci-fi comics by Hall of Fame creator Wallace Wood.\"--P. [4] of cover.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 1993,
        "thumbnail": "http://books.google.com/books/content?id=B3Q0SgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "The War of the Worlds by H. G. Wells",
        "author": "H G Wells",
        "description": "The War of the Worlds (1898), by H. G. Wells, is an early science fiction novel which describes an invasion of England by aliens from Mars. It is one of the earliest and best-known depictions of an alien invasion of Earth, and has influenced many others, as well as spawning several films, radio dramas, comic book adaptations, and a television series based on the story.",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=D-cJzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "L. Ron Hubbard Presents Writers of the Future Volume 39",
        "author": "L. Ron Hubbard",
        "description": "In the world of speculative fiction… Your favorite authors… Have selected best new voices of the year. 24 Award-winning Authors and Illustrators 3 Bonus Short Stories by Kevin J. Anderson • L. Ron Hubbard • S. M. Stirling Art and Writing Tips by Lazarus Chernik • L. Ron Hubbard • Kristine Kathryn Rusch Edited by Dean Wesley Smith • Jody Lynn Nye 16-page color gallery of artwork • Cover art by Tom Wood Check out the stories Brandon Sanderson, Orson Scott Card, Nnedi Okorafor, Robert J. Sawyer, Kevin J. Anderson, Jody Lynn Nye and others chose as the best of the best. Be amazed. Be amused. Be transported … by stories that take you by surprise and take you further and deeper into new worlds and new ideas than you’ve ever gone before…. Twelve captivating tales from the most exciting new voices in science fiction and fantasy accompanied by three from masters of the genre. A miracle? An omen? Or something else? One day, they arrived in droves—the foxes of the desert, the field, the imagination….—“Kitsune” by Devon Bohm When a vampire, a dragon and a shape-shifting Chihuahua meet on a beach in Key West, fireworks go off! But that’s just the background.—“Moonlight and Funk” by Marianne Xenos The Grim Reaper, trapped in an IRS agent’s dying body, must regain his powers before he dies and faces judgment for his original sin.—“Death and the Taxman” by David Hankins In a metaverse future, a woman who exposes falseness in others must decide what is real to her—the love she lost or the love she may have found.—“Under My Cypresses” by Jason Palmatier Vic Harden wasn’t lured by glory on a daring mission into the reaches of outer space—he was ordered out there by his editor.—“The Unwilling Hero” by L. Ron Hubbard Dangerous opportunities present themselves when an alien ship arrives in the solar system seeking repairs.—“White Elephant” by David K. Henrickson With her spaceship at the wrong end of a pirate’s guns, a former war hero must face down her enemies and demons to save Earth’s last best chance for peace.—“Piracy for Beginners” by J. R. Johnson Dan Shamble, Zombie P.I., faces one of his funniest and most perplexing cases ever—an enlightened ogre, a salamander with low self-esteem, and a raging fire dragon terrorizing the Unnatural Quarter!—“Fire in the Hole” by Kevin J. Anderson Years after the Second Holocaust, the last surviving Jews on earth attempt to rewrite the past.—“A Trickle in History” by Elaine Midcoh When I said I’d do anything to pay off my debts and get back home to Earth, I didn’t mean survey a derelict spaceship at the edge of the solar system—but here I am.—“The Withering Sky” by Arthur H. Manner High-powered telescopes bring galactic life to our TVs, and network tuner Hank Enos figures he’s seen everything—until the day an alien boy stares back.—“The Fall of Crodendra M.” by T. J. Knight Knights, damsels and dragons, curses and fates foretold—the stuff of legends and stories, but unexpectedly perverse.—“Constant Never” by S. M. Stirling Determined to save his wife, Tumelo takes an unlikely client through South Africa’s ruins to the heart of the Desolation—a journey that will cost or save everything.—“The Children of Desolation” by Spencer Sekulin When a terrorist smuggles a nuclear weapon into London, a team regresses in time to AD 1093 to assassinate a knight on the battlefield, thereby eliminating the terrorist a millennia before his birth.—“Timelines and Bloodlines” by L. H. Davis The Grand Exam, a gateway to power for one, likely death for all others—its entrants include ambitious nobles, desperate peasants, and Quiet Gate, an old woman with nothing left to lose.—“The Last History” by Samuel Parr You will love this collection of the best new voices in science fiction and fantasy because, as Locus magazine puts it, “Not only is the writing excellent...it is also extremely varied. There’s a lot of hot new talent.” Get it now.",
        "category": "Comics",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 1970,
        "thumbnail": "http://books.google.com/books/content?id=agGoEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "ODY-C Volume 1: Off to Far Ithicaa",
        "author": "Matt Fraction",
        "description": "An eye-searing, mind-bending, gender-shattering epic science fiction retelling of Homer's Odyssey starting with the end of a great war in the stars and the beginning of a very long journey home for Odyssia and her crew of warriors. The journey to Ithicaa begins HERE, by Matt Fraction (Sex Criminals) and Christian Ward (Infinite Vacation, Olympus).",
        "category": "Comics",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2006,
        "thumbnail": "http://books.google.com/books/content?id=j1oCrgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "V for Vendetta Book & Mask Set",
        "author": "ALAN. MOORE",
        "description": "In a world without political freedom, personal freedom and precious little faith in anything comes a mysterious man in a white porcelain mask who fights political oppressors through terrorism and seemingly absurd acts. It's a gripping tale of the blurred lines between ideological good and evil. The inspiration for the hit 2005 movie starring Natalie Portman and Hugo Weaving, this amazing graphic novel is packaged with a collectable reproduction of the iconic V mask.",
        "category": "Comics",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2022,
        "thumbnail": "http://books.google.com/books/content?id=_teQEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Legacy Code",
        "author": "Autumn Kalquist",
        "description": "A brutal conspiracy threatens humanity's survival. Three hundred years ago, the Earth died, and the last humans fled. Beaten. Broken in more ways than one. But there was something they couldn't leave behind: The Legacy Code—mangled genes that force them to abort half their unborn children. When Era and Dritan Corinth get placements on the safest ship in the fleet and win a chance to have a child, they feel lucky. Until the day Era's supposed to find out if her baby has the Defect, and the ship suffers a hull breach. An investigation uncovers new threats: Dangerous secrets. Lies. Treason. Era begins to question everything she’s been taught about the fleet, their search for a new Earth, and the Defect. But the answers she seeks were never meant to be found... Legacy Code is a suspenseful and dark genetic engineering science fiction series that has earned five star reviews from fans of some of the best sci-fi and fantasy books like Hunger Games, Divergent, and Red Rising, and has been compared favorably to Wool, 1984, and the new Battlestar Galactica. \"Addictive sci-fi series. I haven't been this hooked on an author since Anne McCaffery's Killashandra series.\" ~ Marie Hall, New York Times and USA Today Bestselling Author What Readers are Saying: “One of the best books I've ever read, I can't wait to read the rest of the series.” “Space, spaceships, planets, wormholes, dystopian, pregnancy, oh my! I thoroughly enjoyed Legacy Code. It was a quick read for me, as I found it hard to put down. After the first few chapters I was hooked & couldn't get enough… A great mix of SciFi & Dystopian! One of my top favourite reads for 2014.” “Compelling post-apocalyptic novel about survival: Wow. That was... astounding. I really enjoyed reading this… Living in space inside space ships? Holograms? Post-apocalypse? Heck, yeah!” “I cannot get enough of the Fractured Era series. It's the best sci-fi series I've read since The Post-Human series by David Simpson.” “…An uncertain future has the colonists on edge, leading to acts of terrorism and assassination attempts on government officials… There are several intriguing elements at play, most significantly, the mystery of the Legacy Code and whether it holds the key to humanity's survival…I'm looking forward to continuing the series to see where it goes from here.” “A couple of chapters in and I was already hooked! I ended up staying up til midnight (as a mother of a toddler this is a rare occasion) in order to finish it.” “I just finished this book...at 6:00 AM. This society crafted by Autumn Kalquist is fascinating. I can't even imagine how much time she spent carefully plotting every detail. Their existence feels so real and so frighteningly possible.” “It kind of had an initial feel of Battlestar Galactica -- a civilization that has to abandon their planet and go in search of a new one. …It had mystery, a bit of a thriller like aspect, humor, and a taste of romance.\" “I both love and hate this book...but in a good way! Instantly I fell in love with the characters and storyline that Kalquist spun together…This story is based in the future (almost a space opera / dystopian) where the populations of earth escaped to space to find a better world. ...we arrive in a distant future where civilization exists on space ships and they have to take decades before making jumps across space -similar in a way to what I imagine Stargate” “It pulled me in faster than most books I have read and kept me on the edge of my seat through the end. I read it all in just a few hours.\" keywords: free science fiction books, free sci fi books, free science fiction, free sci fi, free space books, free space opera books, free ebooks, fiction books free, sci fi books free, science fiction books free, free mystery books, genetic engineering, space colony, space colonization, space opera, apocalypse, post-apocalyptic, generation ship, end of the world, space battle, space explorer",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2022,
        "thumbnail": "http://books.google.com/books/content?id=RS7OAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Blue Shift",
        "author": "Delia Strange",
        "description": "One novella, seven short stories and a duo of flash fiction SECOND LIFE: Brenda has lived in Dungoora for as long as she can remember, just like everyone else in the tiny outback town. She lives with an old man that could be her grandfather and with a young girl that could be her daughter. Except they're not. The secret that bonds the small community is both comforting and claustrophobic. Even in a town full of secrets, it's difficult to keep any of your own. FORTUNE: If you could see the future, would you look? AIR FIRE WATER EARTH: A four part story told in reverse. MECCA: A 'Femme' novel prequel. THE SONG: A tale from the depths of the Brisbane River. ...and many more tales of science fiction and speculation.",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2008,
        "thumbnail": "http://books.google.com/books/content?id=OVrMrQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "The Science Fiction Universe and Beyond",
        "author": "Michael Mallory",
        "description": "Travel where no man has gone before with this decade-by-decade progression of science-fiction classics. From the classic, low-budget space exploration Flash Gordon tales of the Saturday matinee serials, to the slick CGI-realized world of The Matrix, science-fiction films have long been pushing the boundaries of the visually and dramatically fantastic—turning the known world on its head, playing with the laws of physics, and all the while holding their audience spellbound. The Science Fiction Universe . . . and Beyond offers a breadth of knowledge, insight, and passion to a century of close encounters, black holes, time travel, distant planets, impossible quests, nuclear war, futuristic technology, inexplicable forces, spaceships, extraordinary monsters, and subterranean societies. Arranged chronologically, showing the progression of sci-fi over the decades, and delving into interesting back stories and trivia, this volume includes a variety of classic films and television shows, such as The Day the Earth Stood Still (1951), Invasion of the Body Snatchers (1956), The Twilight Zone (1959–1964), Doctor Who (1963–1989), 2001: A Space Odyssey (1968), A Clockwork Orange (1971), Star Wars, Episode IV—A New Hope (1977), Alien (1979), E.T.: The Extra-Terrestrial (1982), Star Trek: The Next Generation (1987–1994), Terminator 2: Judgment Day (1991), Stargate SG-1 (1997–2007), Battlestar Galactica (2004–2009), and many others.",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2018,
        "thumbnail": "http://books.google.com/books/content?id=72CwoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Motel of the Mysteries",
        "author": "David Macaulay",
        "description": "It is the year 4022; all of the ancient country of Usa has been buried under many feet of detritus from a catastrophe that occurred back in 1985. Imagine, then, the excitement that Howard Carson, an amateur archeologist at best, experienced when in crossing the perimeter of an abandoned excavation site he felt the ground give way beneath him and found himself at the bottom of a shaft, which, judging from the DO NOT DISTURB sign hanging from an archaic doorknob, was clearly the entrance to a still-sealed burial chamber. Carson's incredible discoveries, including the remains of two bodies, one of then on a ceremonial bed facing an altar that appeared to be a means of communicating with the Gods and the other lying in a porcelain sarcophagus in the Inner Chamber, permitted him to piece together the whole fabric of that extraordinary civilization.",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2024,
        "thumbnail": "http://books.google.com/books/content?id=aiDKBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Body Double",
        "author": "Emily Beyda",
        "description": "A dark, glittering debut novel echoing Hitchcock's Vertigo, The Body Double is the suspenseful story of a young woman who is recruited by a stranger to give up her old life and identity to impersonate a reclusive Hollywood star. A strange man discovers our nameless narrator selling popcorn at a decrepit small-town movie theater and offers her an odd and lucrative position: she will forget her job, her acquaintances, even her name, and move to Los Angeles, where she will become the body double of the famous and troubled celebrity Rosanna Feld. A nervous breakdown has forced Rosanna out of the public eye, and she needs a look-alike to take her place in the tabloid media circus of Hollywood. Overseen by Max, who hired her for the job, our narrator spends her days locked up in a small apartment in the hills watching hidden camera footage of Rosanna, wearing Rosanna's clothes, eating the food Rosanna likes, practicing her mannerisms, learning to become Rosanna in every way. But as she makes her public debut as Rosanna, alarming questions begin to arise. What really caused Rosanna's mental collapse? Will she ever return? And is Max truly her ally, or something more sinister?",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2002,
        "thumbnail": "http://books.google.com/books/content?id=oigvEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Robert Kirkman's The Walking Dead: Typhoon",
        "author": "Wesley Chu",
        "description": "In this riveting, “gory, and action-packed” (Jonathan Maberry) survival thriller, set in the expansive world of Robert Kirkman’s The Walking Dead series, three people from different walks of life in China must join forces against the typhoon of undead as chaos sweeps over Asia. In the aftermath of the zombie virus outbreak, what remains of the Chinese government has estimated that one billion walkers (called jiangshi) are currently roaming through the country. Across this dramatic landscape, large groups of survivors have clustered together for safety in villages and towns that have been built vertically as a means of protection against the unceasing wave of jiangshi. Before this devastation, Zhu was one of the millions of poor farmers who left their rural roots for the promise of consistent employment in one of China’s booming factory towns. Elena was an American teaching English in China while on a gap year before beginning law school. Hengyen was a grizzled military officer of some renown, and a passionate believer in his nation’s ability to surmount any obstacle. But with the settlement’s 3,000 mouths to feed and the scavengers having to travel further and further in search of food, Zhu ends up at his home village, where he is shocked to find survivors. Does he force them to join the settlement or keep their existence a secret? Meanwhile, Hengyen is tasked with the impossible: fortifying the Beacon against a 100,000-strong “typhoon” of walkers header their way. Even though he realizes that the Beacon hardly stands a chance, Hengyen is a believer and will stand with his compatriots to the very last, bringing him into conflict with Zhu, who intends to flee the path of the typhoon and make for the safety of China’s dramatic mountain ranges before it’s too late. Given “two decaying thumbs up,” (Jonathan Mayberry, author of Rot & Ruin), this book is sure to get your heart racing and leave you wanting more!",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2019,
        "thumbnail": "http://books.google.com/books/content?id=IeT7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Killer Content",
        "author": "Olivia Blacke",
        "description": "It's murder most viral in this debut mystery by Olivia Blacke. Bayou transplant Odessa Dean has a lot to learn about life in Brooklyn. So far she's scored a rent free apartment in one of the nicest neighborhoods around by cat-sitting, and has a new job working at Untapped Books & Café. Hand-selling books and craft beers is easy for Odessa, but making new friends and learning how to ride the subway? Well, that might take her a little extra time. But things turn more sour than an IPA when the death of a fellow waitress goes viral, caught on camera in the background of a couple's flash-mob proposal video. Nothing about Bethany's death feels right to Odessa--neither her sudden departure mid-shift nor the clues that only Odessa seems to catch. As an up-and-coming YouTube star, Bethany had more than one viewer waiting for her to fall from grace. Determined to prove there's a killer on the loose, Odessa takes matters into her own hands. But can she pin down Bethany's killer before they take Odessa offline for good?",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 1975,
        "thumbnail": "http://books.google.com/books/content?id=Sn0lEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Avram Davidson Science Fiction & Fantasy MEGAPACK®",
        "author": "Avram Davidson",
        "description": "Avram Davidson (1923-1993) was an American writer of fantasy fiction, science fiction, and crime fiction, as well as the author of many stories that do not fit into a genre niche. He won a Hugo Award and three World Fantasy Awards in the science fiction and fantasy genre, a World Fantasy Life Achievement award, plus an Ellery Queen's Mystery Magazine short story award and an Edgar Award in the mystery genre. This volume assembled 20 of his classic works. Included: WHAT STRANGE STARS AND SKIES THE UNKNOWN LAW THE TEETH OF DESPAIR THE SINGULAR EVENTS WHICH OCCURRED IN THE HOVEL ON THE ALLEY OFF OF EYE STREET THE LINEAMENTS OF GRATIFIED DESIRE THE GOLEM THE COST OF KENT CASTWELL THE BOUNTY HUNTER PRESENT FOR LONA NOW LET US SLEEP NOW LET US SLEEP MR. STILWELL'S STAGE MISS BUTTERMOUTH LOVE CALLED THIS THING JURY-RIG I DID NOT HEAR YOU, SIR FAIR TRADE FAED-OUT DEATH OF A DAMNED GOOD MAN WHERE DO YOU LIVE, QUEEN ESTHER? ADVENTURES IN UNHISTORY: WHO FIRED THE PHOENIX? If you enjoy this ebook, don't forget to search your favorite ebook store for \"Wildside Press Megapack\" to see more of the 290+ volumes in this series, covering adventure, historical fiction, mysteries, westerns, ghost stories, science fiction -- and much, much more!",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=_uzTCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Prophet of Bones",
        "author": "Ted Kosmatka",
        "description": "A dazzling young scientist runs for his life and searches for answers after being chased away by paramilitaries from an archeological dig where bones belonging to a puzzling, new species were discovered.",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2008,
        "thumbnail": "http://books.google.com/books/content?id=tohcwJQcXvkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "After Atlas",
        "author": "Emma Newman",
        "description": "Acclaimed author Emma Newman returns to the captivating universe she created in Planetfall with a stunning science fiction mystery where one man’s murder is much more than it seems—an Arthur C. Clarke Award Nominee. Gov-corp detective Carlos Moreno was only a baby when Atlas left Earth to seek truth among the stars. But in that moment, the course of Carlos’s entire life changed. Atlas is what took his mother away; what made his father lose hope; what led Alejandro Casales, leader of the religious cult known as the Circle, to his door. And now, on the eve of the fortieth anniversary of Atlas’s departure, it’s got something to do why Casales was found dead in his hotel room—and why Carlos is the man in charge of the investigation. To figure out who killed one of the most powerful men on Earth, Carlos is supposed to put aside his personal history. But the deeper he delves into the case, the more he realizes that escaping the past is not so easy. There’s more to Casales’s death than meets the eye, and something much more sinister to the legacy of Atlas than anyone realizes...",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2022,
        "thumbnail": "http://books.google.com/books/content?id=2ZuTCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Clash of Flesh and Metal",
        "author": "Alicia Ellis",
        "description": "She must obey a stranger's orders, or the androids will attack again… Despite Lena's fears about the dangers of the Model One androids, CyberCorp has shipped them to customers. They work perfectly—except around Lena. When an android attacks one of her best friends, she insists the robots are fatally flawed. Desperate to keep this situation from spiraling out of control, like it did last time, Lena casts suspicion on everyone she knows. This time, she won't trust anyone. When she gets a threatening note from someone claiming to be controlling the androids, she'll obey—but only to stall for time. Can she find whoever's responsible, before someone else she loves dies?",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=IwnfEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Science Fiction Crime Megapack®: 26 Criminally Futuristic Stories!",
        "author": "Mack Reynolds",
        "description": "Science fiction and crime go hand-in-tentacle, if you’ll pardon the expression. Many of the science fiction field’s greatest writers also wrote mysteries...and vice versa. And sometimes the science fiction stories were mysteries. Our latest MEGAPACK® contains nothing but those blended SF-and-Mystery stories, by some of the greatest writers in the field. Included are: ORIGINS OF GALACTIC LAW, by Edward Wellen DragNeuroNet, by John Gregory Betancourt DON'T GET TECHNATAL, by Ron Reynolds THE CEREBRAL LIBRARY, by David H. Keller, M.D. THE FIVE WAY SECRET AGENT, by Mack Reynolds LICENSE TO STEAL, by Louis Newman DELAYED ACTION, by Charles V. De Vet THE MAGIC OF JOE WILKS, by Robert Moore Williams LIFE GOES ON, by Nelson Bond MURDER FROM MARS, by Richard Wilson WOBBLIES IN THE MOON, by Frank Belknap Long THE FREELANCER, by Robert Zacks NO ESCAPE FROM DESTINY, by Arthur Leo Zagat SWEET DREAMS, by Edward Wellen THE LOCUS FOCUS, by Richard Wilson TRACK OF THE BEAST, by Charles V. De Vet THE VOICES, by Edward Wellen THE TOWER, by Kristine Kathryn Rusch THE MIRACLE OF KICKER MCGUIRE, by Robert Moore Williams OSCAR, DETECTIVE OF MARS, by James Norman OSCAR SAVES THE UNION, by James Norman DEATH WALKS IN WASHINGTON, by James Norman OSCAR AND THE TALKING TOTEMS, by James Norman DOUBLE TROUBLE FOR OSCAR, by James Norman THE THIEF OF THOTH, by Lin Carter If you enjoy this ebook, don't forget to search your favorite ebook store for \"Wildside Press Megapack\" to see more of the 300+ volumes in this series, covering adventure, historical fiction, mysteries, westerns, ghost stories, science fiction -- and much, much more!",
        "category": "Mystery",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2003,
        "thumbnail": "http://books.google.com/books/content?id=E0-lDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Brilliance",
        "author": "Marcus Sakey",
        "description": "Federal agent Nick Cooper draws on his supernatural ability to eliminate terrorists to hunt down a dangerous man who committed a horrific massacre on Wall Street that left hundreds dead and injured.",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2016,
        "thumbnail": "http://books.google.com/books/content?id=JkzVlAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Colony One Mars: A SciFi Thriller",
        "author": "Gerald M. Kilby",
        "description": "How can a colony on Mars survive when the greatest danger on the planet is humanity itself? All contact is lost with the first human colony on Mars during a long and destructive sandstorm. Satellite imagery of the aftermath shows extensive damage to the facility, and the fifty-four colonists who called it home are presumed dead. Three years later, a new mission sets down on the planet surface to investigate what remains of the derelict site. But, it's not long before they realize the colony is not as lifeless as everyone thought. Someone is still alive -- hiding out somewhere. Yet, before they can find the elusive colonist a strange illness starts to affect the crew. Pressure now mounts on Biologist, Dr. Jann Malbec, to locate the source and find a way to fight it. However, as she investigates she begins to suspect a dark and deadly secret lurking within the facility. A secret that threatens not just the crew but the entire population of Earth. With limited resources and time running out, she must find some answers and find them fast. Because if she doesn't, none of them will be going home. About Colony One Mars: This is the first book in a Sci-Fi series set in a human colony on Mars. The science depicted is, for the most part, plausible. In other words, what's technically possible with either current technology or taking experimental research a step or two further. That said, you won't need a calculator or a slide-rule to enjoy the story.",
        "category": "Mystery",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 1991,
        "thumbnail": "http://books.google.com/books/content?id=w2d-vQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "The Mammoth Book of Extreme Science Fiction",
        "author": "Mike Ashley",
        "description": "Here are 25 stories of science fiction that push the envelope, by the biggest names in an emerging new crop of high-tech futuristic SF - including Charles Stross, Robert Reed, Alastair Reynolds, Peter Hamilton and Neal Asher. High-tech SF has made a significant comeback in the last decade, as bestselling authors successfully blend the super-science of 'hard science fiction' with real characters in an understandable scenario. It is perhaps a reflection of how technologically controlled our world is that readers increasingly look for science fiction that considers the fates of mankind as a result of increasing scientific domination. This anthology brings together the most extreme examples of the new high-tech, far-future science fiction, pushing the limits way beyond normal boundaries. The stories include: \"A Perpetual War Fought Within a Cosmic String\", \"A Weapon That Could Destroy the Universe\", \"A Machine That Detects Alternate Worlds and Creates a Choice of Christs\", \"An Immortal Dead Man Sent To The End of the Universe\", \"Murder in Virtual Reality\", \"A Spaceship So Large That There is An Entire Planetary System Within It\", and \"An Analytical Engine At The End of Time\", and \"Encountering the Untouchable.\"",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2011,
        "thumbnail": "http://books.google.com/books/content?id=_mHBBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Sci-fi Channel Encyclopedia of TV Science Fiction",
        "author": "Roger Fulton",
        "description": "Provides episode listings, cast and credits for both classic and obscure science fiction TV shows from the last fifty years",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 1983,
        "thumbnail": "http://books.google.com/books/content?id=PGmpHAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "The Case of the Mystery Meat Loaf",
        "author": "David Lewman",
        "description": "How do you dust for fingerprints on a meat loaf? Club CSI: is on the case in this new middle-grade series about forensic science! Calling all kid crime-solvers: Forensic science isn’t just for grown-ups anymore! Thanks to the popularity of shows like CSI: Crime Scene Investigation, forensic science has made its way into the classroom. This new middle-grade series stars a group of students whose forensic science class inspires them to form a “Club CSI:” to investigate crimes and capers at school. As Club CSI: collects clues, readers will love trying to put the pieces together to find out what really happened in this series that is part mystery, part detective story, and just plain fun! In The Case of the Mystery Meat Loaf, Ben, Corey, and Hannah’s first case as Club CSI: begins when a bunch of students and the principal get food poisoning from the cafeteria’s hot lunch. Everyone blames the new science teacher because she pushed the lunch lady to add her healthy “meatless meat loaf” recipe to the menu, but Club CSI: isn’t pointing fingers until they evaluate the evidence. Can they find out who messed with the meat loaf before the science teacher gets in trouble or more people get sick? Club CSI: is on the case!",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2001,
        "thumbnail": "http://books.google.com/books/content?id=3sVT45uOgKIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Fires of Invention",
        "author": "Jeffrey Scott Savage",
        "description": "Even though technology and inventions have been outlawed in the mountain city of Cove, in order to save the city Trenton and Kallista must follow a set of mysterious blueprints to build a creature to protect them from the dragons outside their door.",
        "category": "Mystery",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2024,
        "thumbnail": "http://books.google.com/books/content?id=dI7iswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Ferandan",
        "author": "Mark Grisham",
        "description": "Haldan explores the piles of junk that cover the entire surface of Ferandan. There he seeks answers, but finds himself in great danger under the cool red sun. His adventures with the enigmatic dwellers in the waste lead him to understand that not everything is as it seems at the recycling factory where his father works.",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2021,
        "thumbnail": "http://books.google.com/books/content?id=UYXpoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Tales of Space and Time \"Annotated\" Action & Adventure Short Story",
        "author": "H G Wells",
        "description": "Herbert George Wells, better known as H. G. Wells, was an English writer best known for such science fiction novels as The Time Machine, The War of the Worlds, The Invisible Man and The Island of Doctor Moreau. He was a prolific writer of both fiction and non-fiction, and produced works in many different genres, including contemporary novels, history, and social commentary. He was also an outspoken socialist. His later works become increasingly political and didactic, and only his early science fiction novels are widely read today. Wells, along with Hugo Gernsback and Jules Verne, is sometimes referred to as \"The Father of Science Fiction\".",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Short Read",
        "published_year": 2008,
        "thumbnail": "http://books.google.com/books/content?id=-n97zQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Poor Man's Fight",
        "author": "Elliott Kay",
        "description": "High school senior Tanner Malone has bombed the Test, a high-stakes exam that establishes how much he owes for his corporate-funded education. Burdened by a crushing debt that rules out college, Tanner enlists in the navy of Archangel, a star system with four terraformed worlds. But he hasn't factored in the space pirates. Just as Tanner begins basic training, the government ramps up its forces to confront a band of rowdy raiders who are wreaking havoc in the void. Led by complex and charismatic Captain Casey, the outlaws love a little murder and mayhem, but they are also democratic, egalitarian, and devoted to freeing each new recruit from debt and corporate oppression. Assigned to the front lines, Tanner soon finds himself caught in the crossfire between ruthless foes, cruel comrades, and unforgiving space. Can he do his duty when good and evil look so much alike?",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2007,
        "thumbnail": "http://books.google.com/books/content?id=iUM4rgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Magic Kingdom for Sale--Sold!",
        "author": "Terry Brooks",
        "description": "Here in his first non-Shannara novel, Terry Brooks has written a gripping story of mystery, magic, and adventure—sure to delight fantasy readers everywhere. Landover was a genuine magic kingdom, with fairy folk and wizardry, just as the advertisement has promised. But after he purchased it, Ben Holiday learned that there were a few details the ad had failed to mention. The kingdom was in ruin. The Barons refused to recognize a king, and the peasants were without hope. A dragon was laying waste the countryside, while an evil witch plotted to destroy everything. Ben's only followers were the incompetent Court Magician; Abernathy, the talking dog who served as Court Scribe; and the lovely Willow—but she had a habit of putting down roots in the moonlight and turning into a tree. The Paladin, legendary champion of the Kings of Landover, seemed to be only a myth and an empty suit of armor. To put the final touch on the whole affair, Ben soon learned that the Iron Mark, terrible lord of the demons, had challenged all prospective Kings of Landover to duel to the death—a duel which no human could hope to win. The task of proving his right to be King seemed hopeless. But Ben Holiday was stubborn. . . .",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Short Read",
        "published_year": 2019,
        "thumbnail": "http://books.google.com/books/content?id=UD9bqLruYaUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "XOM-B",
        "author": "Jeremy Robinson",
        "description": "Freeman is a genius with an uncommon mixture of memory, intelligence and creativity. He lives in a worldwide utopia, but it was not always so. There was a time known as the Grind—when Freeman's people lived as slaves to another race referred to simply as \"Master.\" They were property. But a civil rights movement emerged. Change seemed near, but the Masters refused to bend. Instead, they declared war. And lost. Now, the freed world is threatened by a virus, spread through bites, sweeping through the population. Those infected are propelled to violence, driven to disperse the virus. Uniquely suited to respond to this new threat, Freeman searches for a cure, but instead finds the source—the Masters, intent on reclaiming the world. Freeman must fight for his life, for his friends and for the truth, which is far more complex and dangerous than he ever imagined. Robinson's lightning fast, cutting-edge novels have won over thriller, horror, science-fiction and action/adventure fans alike, and he has received high praise from peers like James Rollins, Jonathan Maberry, and Scott Sigler. XOM-B is a wildly inventive zombie novel with a high-tech twist that will keep readers guessing until the very last sentence.",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2013,
        "thumbnail": "http://books.google.com/books/content?id=DOhzAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Battlefield Earth",
        "author": "L. Ron Hubbard",
        "description": "Sadistic Aliens... ...Man is an endangered species. Is it the end of the world or the rebirth of a new one? In the year A.D. 3000, Earth is a dystopian wasteland. The great cities stand crumbling as a brutal reminder of what we once were. When the Psychlos invaded, all the world’s armies mustered little resistance against the advanced alien weapons. Now, the man animals serve one purpose. Do the Psychlos’ bidding or face extinction. One man, Jonnie Goodboy Tyler, has a plan. They must learn about the Psychlos and their weapons. He needs the other humans to follow him. And that may not be enough. Can he outwit his Psychlo captor, Terl? The fate of the Galaxy lies on the Battlefield of Earth. Get it now. “Pulse-pounding mile-a-minute sci-fi action-adventure that does not stop. It is a masterpiece of popular adventure science fiction.” —Brandon Sanderson “Battlefield Earth is like a 12-hour ‘Indiana Jones’ marathon. Non-stop and fast-paced. Every chapter has a big bang-up adventure.” —Kevin J. Anderson (co-author of the Dune Sagas) “Over 1,000 pages of thrills, spills, vicious aliens and noble humans. I found Battlefield Earth un-put-downable.” —Neil Gaiman",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Standard Length",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=zh57CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Widowland",
        "author": "C. J. Carey",
        "description": "2023 Philip K. Dick Award Nominee \"A compulsive, terrifying read.\"—Kate Quinn, New York Times bestselling author of The Rose Code For readers of Margaret Atwood's The Handmaid's Tale comes a thrilling feminist dystopian novel set in an alternative history that terrifyingly imagines what a British alliance with Germany would look like if the Nazis had won WWII. To control the past, they edited history. To control the future, they edited literature. LONDON, 1953. Thirteen years have passed since England surrendered to the Nazis and formed a Grand Alliance with Germany. It was forced to adopt many of its oppressive ideologies, one of which was the strict classification of women into hierarchical groups based on the perceived value they brought to society. Rose Ransom, a member of the privileged Geli class, remembers life from before the war but knows better than to let it show. She works for the Ministry of Culture, rewriting the classics of English literature to ensure there are no subversive thoughts that will give women any ideas. Outbreaks of insurgency have been seen across the country with graffiti made up of seditious lines from forbidden works by women painted on public buildings. Suspicion has fallen on Widowland, the run-down slums where childless women over fifty have been banished. Rose is given the dangerous task of infiltrating Widowland to find the source of the rebellion before the Leader arrives in England for the Coronation ceremony of King Edward VIII and Queen Wallis. Will Rose follow her instructions and uncover the criminals? Or will she fight for what she knows in her heart is right? Praise for Widowland: \"A mind-bender of a novel about the power of literature to change minds. I loved it!\" —Mark Sullivan, bestselling author of The Last Green Valley and Beneath a Scarlet Sky \"I rarely come across a book I can't put down but I devoured this one.\" —Rhys Bowen, New York Times bestselling author of two historical mystery series as well as several internationally bestselling historical novels \"An electrifying, Orwellian dystopia with a thrilling feminist twist.\" —Lara Prescott, New York Times bestselling author of The Secrets We Kept \"Tense, thought-provoking, and terrifying.\" —Natalie Jenner, international bestselling author of The Jane Austen Society and Bloomsbury Girls",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2001,
        "thumbnail": "http://books.google.com/books/content?id=gGpMEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Great Secret",
        "author": "L. Ron Hubbard",
        "description": "Women. Liquor. Power. Women. Liquor. Power. That is Fanner Marston's mantra--his reason for being--and while he knows a little about the first and a lot about the second, he may well be on the verge of learning everything there is to know about the third. Power. He may, in fact, be about to uncover the key to gaining absolute control over the entire universe. The only problem is, Fanner is certifiably insane.... His starship has crash-landed, and he's the sole survivor, which doesn't matter to him. Driven by greed and lust for power, wracked by thirst, hunger and pain, all he cares about is reaching the ancient city of Parva and making himself at home. Because there lies The Great Secret to universal domination--and what's a little suffering on the road to becoming God? Does Fanner have a prayer? The writing's on the walls of Parva--and you won't believe what it says.... Also includes the science fiction adventures, \"The Space Can,\" in which a decrepit space battleship is a civilian fleet's only defense; \"The Beast,\" the tale of a hunter in the jungles of Venus, chasing an immoral beast; and \"The Slaver,\" in which an alien race has enslaved the human race, but can't repress the power of human love. Blast off on a head-trip you'll never forget as The Great Secret takes you inside the mind of a man who is crazy with lust for power. \"Serves as a wonderful introduction to the breadth of Hubbard's output.\" --Comic Buyers Guide",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Short Read",
        "published_year": 2019,
        "thumbnail": "http://books.google.com/books/content?id=gwolGaa-J9oC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "A Fire Upon The Deep",
        "author": "Vernor Vinge",
        "description": "Now with a new introduction for the Tor Essentials line, A Fire Upon the Deep is sure to bring a new generation of SF fans to Vinge's award-winning works. A Hugo Award-winning Novel! “Vinge is one of the best visionary writers of SF today.”-David Brin Thousands of years in the future, humanity is no longer alone in a universe where a mind's potential is determined by its location in space, from superintelligent entities in the Transcend, to the limited minds of the Unthinking Depths, where only simple creatures, and technology, can function. Nobody knows what strange force partitioned space into these \"regions of thought,\" but when the warring Straumli realm use an ancient Transcendent artifact as a weapon, they unwittingly unleash an awesome power that destroys thousands of worlds and enslaves all natural and artificial intelligence. Fleeing this galactic threat, Ravna crash lands on a strange world with a ship-hold full of cryogenically frozen children, the only survivors from a destroyed space-lab. They are taken captive by the Tines, an alien race with a harsh medieval culture, and used as pawns in a ruthless power struggle. Tor books by Vernor Vinge Zones of Thought Series A Fire Upon The Deep A Deepness In The Sky The Children of The Sky Realtime/Bobble Series The Peace War Marooned in Realtime Other Novels The Witling Tatja Grimm's World Rainbows End Collections Collected Stories of Vernor Vinge True Names At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2001,
        "thumbnail": "http://books.google.com/books/content?id=fCCWWgZ7d6UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Outer Earth: The Complete Trilogy",
        "author": "Rob Boffard",
        "description": "'EXHILARATING AND UNFORGETTABLE' Sarah Lotz, author of The Three 'SETS A NEW STANDARD FOR ALL-ACTION SF' Ken MacLeod An omnibus edition containing all three of Rob Boffard's thrilling Outer Earth novels: Tracer, Zero-G and Impact. Outer Earth is a huge space station orbiting the ruins of our planet. Dirty, overcrowded and inescapable, it's humanity's last refuge . . . and possibly its final resting place. For there are dark forces at work on the station: forces that seek to unleash chaos. If they succeed, there will be nowhere left to run. 'Fast-paced, action-packed, cinematic space adventure' Civilian Reader 'Relentlessly fast pace...Vivid action scenes' SFX 'Compelling, compulsive...Thoroughly entertaining' SciFi and Fantasy Reviews 'Guaranteed to keep you hooked until the very last page' Glamour",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Standard Length",
        "published_year": 2013,
        "thumbnail": "http://books.google.com/books/content?id=ABeUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Spark Anomaly",
        "author": "Jeffrey Freedman",
        "description": "\"What happens when 2 earthquakes occur 42 minutes apart in Chile & China?\" Answer: The end of the world As Arnold Spark, drives his rescue vehicle across the magma lake toward the destroyed volcanic generator's intake pipe, he wonders if his design is to blame for the catastrophe. Spark searches the globe for the truth aided by: Soona, a lonely robot living on the moon, who must escape her cruel human captors to search for answers on the comet Charybdis; Helen, a bereaved widow, who blames Spark for her husband's death; And Cathy, a shy college student who is oblivious to Spark's quest, but solves his disguised homework problems unaware her brilliant solutions are the key to saving humanity The Spark Anomaly is a thrilling Sci-Fi adventure novel set in a 2067 utopia with a hidden dark side. You will enter an amazing world of future technologies and believable advances in modern physics. \"...Indiana Jones [style] solid sci fi with characters we relate to and care about... Cathy and the housekeeping robots made me laugh out loud.\" - Star Trek novelist Margaret W Bonanno",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2019,
        "thumbnail": "http://books.google.com/books/content?id=KHjUygEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Free Science Fiction Books On Kindle: Linked List of over 350 Free SciFi Classic Stories And Early Fantasy Novels",
        "author": "Morris Rosenthal",
        "description": "Latest version free online at http://www.ifitbreaks.com/free.htm All links checked and updated on September 6th, 2015, if you have an older version please contact customer service. To download free eBooks directly, you must use Kindle Fire. Amazon has changed their other Kindle reader software (PaperWhite, eInk and Touch) so those users must use this eBook in Amazon's downloadable Cloud Reader (read.amazon.com) on a PC or laptop to select and send the free classics to their Kindle. iPad users must use the Cloud Reader from \"Manage Your Kindle\" to use the download links, see \"From The Author\" below. Amazon Prime members are welcome to use their free monthly borrow to get this list and download hundreds of the free classics for future reading. This linked list of over 350 free science fiction stories and novels in Amazon's permanent collection was recently updated with hundreds of works from famous science fiction writers who wrote in the 1950's and 1960's and apparently forgot to extend their copyright protection. For the more recent authors SciFi fans will be familiar with, I just list the links (arranged by author) that will take you to their titles in the Kindle store for free download. For the earlier writers, I usually include a one or two line summary of their books. I thought I read all the classic SciFi twenty years ago, but I found a couple dozen authors I'd never heard of while researching Amazon's free collection. Most of the titles in this linked list of the free classic science fiction on Amazon were written before the \"Golden Age\" of science fiction, but influenced the authors who came later. I've included several early utopia/dystopia books, a popular subject in the late Victorian period. A few supernatural titles are included when the author also wrote other types of books. I didn't include fairy tales, and I made judgment calls on skipping science fiction/fantasy that was written for children and young adults, or just included a few samples from those authors.",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Standard Length",
        "published_year": 2006,
        "thumbnail": "http://books.google.com/books/content?id=bNGFCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Colony World",
        "author": "Tarah Benner",
        "description": "The high-octane fourth installment in The Elderon Chronicles. Three years after a heartbreaking defeat, Maggie’s world is unrecognizable. She’s gone underground to hide from Mordecai. Her career as a journalist is over. She’s scrubbing toilets in a seedy hotel just to make ends meet. Mordecai’s vision for bot domination has brought the country to its knees. An attack on Congress and a humanoid army has shrouded Maggie’s city in fear. Tripp is a hostage on his own space station, forced to finance Mordecai’s campaign of terror. Maggie, Ping, and Alex are fighting from the shadows, but Maggie can’t escape the wounds of her past. When she receives a message from Tripp, she puts a dangerous plan into motion. The mission could thwart Mordecai’s global ambitions and stop the spread of bots. But when Maggie gets a visit from a mysterious stranger, her entire world is turned upside down. Overnight she becomes the most hunted woman alive and learns a shocking truth. *** KEYWORDS: best science fiction, sci fi, adventure stories, space opera, military sci fi, space marine, military science fiction, space force, action and adventure, robots, AI, artificial intelligence evil robots, space station, space colony, colonization, free space opera, free military science fiction, free military sci fi, sci fi romance, spaceships, space travel, sci fi books that are free, read ebooks for free, stories to read online free, google books free to read, evil corporation, strong female lead, female protagonist, slow-burn romance, near-future technology",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2019,
        "thumbnail": "http://books.google.com/books/content?id=Kpj9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Colony War",
        "author": "Tarah Benner",
        "description": "From the author of Colony One comes an action-packed sequel to the near-future conspiracy. An army of bots is roaming the space station — hijacked by a terrorist inside BlumBot International. The bots share a hive mind that learns and adapts, making them the most deadly adversaries Jonah has ever faced. Jonah and Maggie are prepared to fight alongside the Space Force, but how can they defeat an army that never eats, never sleeps, and never grows tired? To protect the colony, they must join forces with Tripp Van de Graaf — the cocky young executive with dimples for days. Tripp makes no effort to hide his attraction toward Maggie, and Jonah hates him instantly. But Tripp’s company holds the key to defeating the bots: their human creator, Ziva Blum. When Maggie, Tripp, and Jonah learn that more humanoids are hibernating on Earth, they must race to stop a madman bent on destruction and save the world from a robot apocalypse. *** KEYWORDS: best science fiction, sci fi, adventure stories, space opera, military sci fi, space marine, military science fiction, space force, action and adventure, robots, AI, artificial intelligence evil robots, space station, space colony, colonization, free space opera, free military science fiction, free military sci fi, sci fi romance, spaceships, space travel, sci fi books that are free, read ebooks for free, stories to read online free, google books free to read, evil corporation, strong female lead, female protagonist, slow-burn romance, near-future technology",
        "category": "Action Adventure",
        "format": "Ebook",
        "length": "Long Read",
        "published_year": 2005,
        "thumbnail": "http://books.google.com/books/content?id=2nn7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "The Proto Project",
        "author": "Bryan R. Johnson",
        "description": "Age Level: 8 and up | Grade Level: 3 and upLexile score 600L-700L | DRA 28 | Guided Reading Level NFeatured Children's Book Selection by Kirkus ReviewsPraised by Publishers WeeklyMom's Choice Award Gold WinnerReaders' Favorite Five StarRoyal Dragonfly Award 1st Place Middle Grade FictionRECOMMENDED by the US ReviewWhen Jason meets his mom's billion-dollar invention, an artificial intelligence device named Proto, he accidentally gets caught up in a mysterious adventure. Proto goes missing, and then people go missing. Now Jason and his coolest-neighbor-ever Maya must risk their lives to prevent global mayhem. But who is behind this devious plot? Is it another AI? The FBI? Or any other abbreviation with an I? What exactly is there to learn about artificial and human intelligence while fighting for your life against a legion of furry puppies or a battalion of drones? A lot- if you live to tell about it.Best for kids who- Are ages 8-12- Have outgrown chapter books- Adore contemporary realistic fiction and fantasy/science fiction- Love fast-paced novels with humor, mystery, suspense, and adventure- Enjoy books like I Survived, Diary of a Wimpy Kid, The Last Kids on EarthGreat for gift-givers, parents, and educators looking for- An entertaining and educational novel- Upholding strong values, intellectual curiosity, a growth mindset, and social/global responsibility- Encouraging interest in STEM careers (science, technology, engineering, math)- Incorporating potential real-world applications of modern developments in Artificial Intelligence\"Johnson keeps the middle school laughs going in this action-packed, accessible look at the pros and cons of advancing AI and technology, a contemporary tale certain to intrigue and entertain young readers.\" Publishers Weekly\"A fast-paced and exciting novel that makes the techiest James Bond spy thriller seem old-fashioned and stodgy by comparison ...The plot is zany and unpredictable, and Johnson's characters are a hoot to watch as they expand their imaginations, skills, and world-views in response to the crisis they're facing ? Impossible to put down.\" - Readers' Favorite 5-star reviewAvailable in hardcover, paperback, audiobook, and Kindle.",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 2006,
        "thumbnail": "http://books.google.com/books/content?id=952qxAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Will Save the Galaxy for Food",
        "author": "Yahtzee Croshaw",
        "description": "A not-quite epic science fiction adventure about a down-on-his luck galactic pilot caught in a cross-galaxy struggle for survival! Space travel just isn't what it used to be. With the invention of Quantum Teleportation, space heroes aren't needed anymore. When one particularly unlucky ex-adventurer masquerades as famous pilot and hate figure Jacques McKeown, he's sucked into an ever-deepening corporate and political intrigue. Between space pirates, adorable deadly creatures, and a missing fortune in royalties, saving the universe was never this difficult! From the creator of Mogworld and Jam! Benjamin Richard \"Yahtzee\" Croshaw is a British-Australian comedic writer, video game journalist, author, and video game developer. He is perhaps best known for his acerbic video game review series, Zero Punctuation, for The Escapist.",
        "category": "Action Adventure",
        "format": "Audiobook",
        "length": "Long Read",
        "published_year": 1974,
        "thumbnail": "http://books.google.com/books/content?id=qojmDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "title": "Hab 12",
        "author": "Mark Wayne McGinnis",
        "description": "\"Buckle up--this is another crazy ride!\" The Scrapyard Ship sci-fi \"cliff-hanger\" adventures continue with HAB 12, the second book in the series: Captain Jason Reynolds faces new challenges, not only on Earth but from the far side of the universe as well. The only way to stop the Craing this time will be to square off with them on their home turf. Jason's been informed that three powerful Craing warships, having similar technology as The Lilly, will soon be en route to Earth. The Alliance must destroy the Craing's wormhole means of distant space travel to avert Earth's total annihilation. Unfortunately, there's no way to reach the Craing worlds in time, at least not through conventional means. It's up to Jason and his hand-picked assault team to traverse, by advanced phase-shifting means, through the hazardous environment of HAB 12. This is an adventure fraught with carnivores of a Jurassic Age magnitude, and a terrain so deadly that turning back may be their only hope of survival. Note from the author: Don't be surprised by cliff-hanger endings. I'll do my best to keep Scrapyard Ship as well as the Tapped In series books coming so you wont have long to wait for the next book. Enjoy!",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2023,
        "thumbnail": "http://books.google.com/books/content?id=DyfFoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
        "title": "Contract of Betrayal: Spectras Arise Trilogy, Book 2",
        "author": "Tammy Salyer",
        "description": "THE DEVIL YOU KNOW OR THE DEVIL YOU DON'T—SOMETIMES THEY'RE BOTH WORSE THAN YOU CAN IMAGINE. In a bid to free the settlers of Agate Beach from their dependence on picking at Admin scraps, Corps-deserter Aly Erikson's crew is willing to make a few deals, even with the devil. When Aly learns her friends have deceived her, she has to decide which is stronger: her sense of having been betrayed or her allegiance to the rebel cause. After an old ally offers her a convenient escape to a new life, the decision should be easy. But when the Corps threatens to wipe out everything that matters to her, the only course of action left is the same one she’s taken for as long as she can remember—fighting back. What people saying about the Spectras Arise Series “A fast-paced and fun sci-fi space adventure with a great protagonist… starts with a running gun fight and doesn't let up until the explosive conclusion.” “Top Notch SciFi Read!” “I'm torn between wanting to savor every exciting moment of this gorgeously written series or binge-read to find out what happens next.” “Thrilling, Roller-Coaster Ride of Military Sci-Fi Adventure” “Contains the kind of action that makes it hard to turn off the light and go to sleep.” Other books in the Spectras Arise Series Conviction: A Spectras Arise Prequel Novella Contract of Defiance: Spectras Arise Trilogy, Book 1 Contract of Betrayal: Spectras Arise Trilogy, Book 2 Contract of War: Spectras Arise Trilogy, Book 3 The Spectras Arise Series Omnibus, including all four books Fans of the following authors may also enjoy this science fiction series: Aaron Dembski Bowden, Adrian Tchaikovsky, Ann Leckie, Anna Hackett, Anthony J.Melchiorri, Arthur C Clarke, B. V. Larson, Carlos R. Tkacz, Craig A. Falconer, Craig Alanson, Craig Martelle, Dan Simmons, Dennis E. Taylor, Douglas E. Richards, Eric Vall, Ernest Cline, Evan Currie, G.S. Jennsen, Gav Thorpe, George Mann, Ian St Martin, Ian Watson, Isaac Asimov, Isaac Hooke, James Corey, Jay Allan, Jessie Mihalik, Joe Haldeman, John Conroe, John Ringo, Jonathan Yanez, Joseph Lallo, Josh Hayes, Josh Reynolds, Joshua Dalzelle, Kris Longknife, Larry Niven, Lindsay Buroker, Martin L. Shoemaker, Mike Resnick, Neil Clarke, Nicholas Sansbury Smith, Nick Webb, Ray Bradbury, Richard Heinlein, Rick Partlow, S. H. Jucha, Samuel Delany, Scott Moon, Vaughn Hepner, Vicky Peterwald Fans of the following books and series may also enjoy this science fiction series: A Call To Arms, A Call To Vengeance, A Rising Thunder, A Trick Of Light, Across The Galactic Pond, Agent To The Stars, Albion Lost, Alliance, Archangel One, Ashes Of Victory, At All Costs, Aurora Blazing, Aurora Renegades, Aurora Rising, Big Sigma, Broken Worlds, Chaos Space Marines, Children Of Time, Clone World, Come Tumbling Down, Count Zero, Cursed Stars, Cygnus Space Opera, Dark Age, Dark Space, Dropship, Earth Fall, Echoes Of Honor, Edge Of Valor, Extinction Shadow, Field Of Dishonor, Flag In Exile, Flight Of The Reaper, Forever Gate, Forever War, Foundation And Earth, Foundation's Edge, Fracture Spacers, Fractured Empire Complete Cadicle Series, Free Trader, Fuzzy Nation, Galactic Vanguard, Galactic War, Gateway To War, Genome, Ghost Fleet, Head On, Helsreach (Space Marine Battles), Hero Code, Honor Among Enemies, Honor Harrington Universe, Hyperion, Imperial Sunset, Imperial Twilight, In Enemy Hands, Infinity Born, Interdependency, Interstellar Warspike Chronicles, Iron Wolves, Judge Jury, Jumper, Kiss Of Eon, Land Of Wolves, Leviathan Wakes, Lock In, Lucky's Marines, Mission Critical, Mission Of Honor, Monster Hunter Guardian, Nemesis, New Frontiers, Odysseus Ascendant Spacers, Odysseus Awakening Spacers, Old Man's War, Omega Force, On Basilisk Station, Primaris Space Marines, Primordial Threat, Recon, Redshirts, Refuge Spacers, Renegade Atlas, Renegade Descent, Renegade Fleet, Renegade Lost, Renegade Moon, Renegade Rising, Renegade Star, Resonant Abyss, Resonant Son, Resurgence, River Of Night, Ruins of the Galaxy, Salvation, Salvation Lost, Shadow Of Freedom, Shadow Of Victory, Shield Of Terra, Ship Of Ruin, Shockwave, Shots Fired, Smoke Bitten, Solar War, Space Marine Conquests, Space Marine Legends, Spacers, Star Force, Star Kingdom, Star Trek Books, Star Forged, Starshine, Stranger In A Strange Land, Summer Frost, Superdreadnought, Terradox Quadrilogy, Terran Scout Fleet 1, The Android's Dream, The Caves Of Steel, The Collapsing Empire, The Consuming Fire, The End Of All Things, The Eon Series, The Expanding Universe, The Fifth Column, The Free Trader Of Planet Vii, The Free Trader Of Warren Deep, The Genesis Fleet, The Ghost Brigades, The Gordian Protocol, The Hidden Ship, The Honor Of The Queen, The Human Division, The Last Colony, The Last Dance, The Last Emperox, The Last Stand, The Lost Colony, The Lost Starship, The Orbs Series, The Originator Wars, The Robots Of Dawn, The Sagan Diary, The Short Victorious War, The Slaver Wars, The Star Cross, The Void Within, Though Hell Should Bar The Way, Through Fiery Trials, Tiamat's Wrath, To Clear Away The Shadows, Tomorrow Factory, Uncompromising Honor, Undying Mercenaries Series, Unlocked, Vanquish, Vigilance Spacers, War Of Honor, Wastelands, We Are Legion, Winds Of Wrath, Wings Of The Reaper, Winter World, Wrath Of The Reaper, Zoe's Tale, Zone War Keywords related to this science fiction series: Ace, Action Adventure, Action Adventure Books, Action Books, Adventure, Angry Robot, Baen, Daw, Del Rey, Essential Reads, Female Action Adventure, Female Adventure Books, Female Space Marines, Fleet, Futuristic Weapons, Galactic Empire, Galactic Liberation, Galactic Vanguard, Galactic War, Genetic Engineering, Heroine, Hugo, Hugo Award, Military Science Fiction, Military Science Fiction Action Adventure, Military Science Fiction Books, Military Science Fiction Series, Msf Books, Nebula, Nebula Award, New Wave Sf, Outcast Marines, Popular Series, Republic, Science Fiction, Science Fiction Action Adventure, Science Fiction Series, Smuggler, Soldier, Space Flight, Space Marine, Space Opera, Space Warfare, Spaceship, Starship, Strong Female Character, Subterranean Press, Top Rated Books, Tor Omnibus Set, Omnibus Collection, Omnibus Bundle, Science Fiction Omnibus, Science Fiction Bundle, Science Fiction Box Sets, Science Fiction Box Set, Collections & Anthologies, Boxed Set, Best Rated Science Fiction Omnibus",
        "category": "Action Adventure",
        "format": "Paperback",
        "length": "Long Read",
        "published_year": 2016,
        "thumbnail": "http://books.google.com/books/content?id=zV74DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
]